[{"markets": 1, "payable": 73, "remain": 2, "with": 3, "Cattrall": 4, "1990": 5, "bonds": 74, "business": 6, "chief": 75, "Stage": 76, "manufacture": 77, "plan": 145, "at": 7, "growth": 132, "weapons": 134, "For": 79, "and": 137, ",": 8, "Eastern": 80, "new": 10, "set": 11, "from": 83, "U.S.": 13, "Cars": 14, "n't": 90, "Howard": 15, "executive": 102, "be": 16, "alcoholic": 86, "rate": 17, "college": 87, "Some": 51, "are": 18, "up": 19, "pension": 142, "for": 20, "in": 91, "year": 92, "Chicago": 123, "last": 23, "19": 94, "role": 24, "rest": 96, "excluded": 25, "Revitalized": 26, "maker": 97, "expects": 99, "Take": 85, "Christina": 100, "Inc.": 101, "tobacco": 28, "``": 29, "employees": 103, "1,200": 30, "was": 104, "of": 105, "been": 108, "an": 31, "mistakenly": 88, "City": 32, "short-term": 33, "sold": 34, "by": 35, "plays": 112, "its": 113, "Goodman": 36, "cents": 37, "quarterly": 115, "10": 116, "In": 141, "the": 117, "Haag": 118, "Motor": 38, "invested": 78, "into": 39, "1,214": 58, "sign": 121, "Misanthrope": 109, "BELL": 147, "Kim": 40, "anticipates": 110, "Also": 41, "&": 42, "Britain": 43, "fund": 124, "said": 125, "Leisure": 44, "has": 127, "sales": 111, "record": 126, "officer": 45, "companies": 70, "investments": 46, "Oct.": 81, "Mosher": 47, "15": 48, "Arts": 22, "steady": 129, "approve": 49, "-LRB-": 50, "date": 93, "Celimene": 52, "-RRB-": 53, "The": 130, "'s": 54, "beverages": 55, "Windy": 131, "institutions": 56, "part": 57, "stemming": 59, "it": 60, "INDUSTRIES": 133, "''": 122, "also": 82, "seven": 106, "auto": 61, "percent": 135, "attributed": 136, "to": 9, "Classics": 62, "president": 21, "Far": 114, "significant": 119, "Rolls-Royce": 64, "must": 95, "Sixty": 65, "Elianti": 89, "going": 120, "A": 138, "a": 107, "options": 66, "will": 139, "about": 140, "Europe": 67, "review": 68, "Feb.": 69, "Theatre": 143, "Ms.": 144, "4,300": 12, "or": 27, "increased": 71, "luxury": 84, "played": 63, "cars": 72, "stocks": 146, "he": 128, "share": 98}, {"NN": 20, "NNS": 1, "NNPS": 17, "TO": 2, "MD": 3, "VBG": 18, "VBZ": 19, "CC": 4, "''": 5, "POS": 6, "VBN": 7, "VB": 27, ",": 8, "RB": 9, "``": 21, "VBD": 10, "DT": 22, "CD": 23, "VBP": 11, "RP": 12, "NNP": 25, "PRP$": 24, "IN": 26, "JJ": 14, "-RRB-": 15, "PRP": 16, "-LRB-": 13}]