Starting job 16175460 ("rnn-randomprojection-wikipedia") on c16-31 at tor dec 15 13:03:47 CET 2016
Python environment is set up
Copying files to /work/jobs/16175460.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175460.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
EMBEDDING_PATH: /work/jobs/16175460.d/resources//word_embeddings/precompiled/random_projection/size=50.merged
MODEL_PATH: /work/jobs/16175460.d/models/rnn-randomprojection-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll15st-en-03-29-16-blind-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175460.d/resources//word_embeddings/precompiled/random_projection/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:05] configuration (/work/jobs/16175460.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:05]     config 'epochs': 200 (1000)
[2016-12-15 13:05]     config 'epochs_len': -1 (-1)
[2016-12-15 13:05]     config 'epochs_patience': 10 (20)
[2016-12-15 13:05]     config 'batch_size':  (64)
[2016-12-15 13:05]     config 'snapshot_size':  (2048)
[2016-12-15 13:05]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:05]     config 'words_dim': 20.0 (20)
[2016-12-15 13:05]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:05]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:05]     config 'final_dim': 40.0 (100)
[2016-12-15 13:05]     config 'arg1_len':  (100)
[2016-12-15 13:05]     config 'arg2_len':  (100)
[2016-12-15 13:05]     config 'conn_len':  (10)
[2016-12-15 13:05]     config 'punc_len':  (2)
[2016-12-15 13:05]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:05]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:05]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:05]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:05]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:05]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:05]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:05]     config 'words2vec_bin': None (None)
[2016-12-15 13:05]     config 'words2vec_txt': /work/jobs/16175460.d/resources//word_embeddings/precompiled/random_projection/size=50.merged (None)
[2016-12-15 13:05]   args.lang: en
[2016-12-15 13:05]   args.model_dir: /work/jobs/16175460.d/models/rnn-randomprojection-wikipedia/
[2016-12-15 13:05]   args.dataset_dir: /work/jobs/16175460.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
[2016-12-15 13:05]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll15st-en-03-29-16-blind-test/
[2016-12-15 13:05]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:05]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:05]   filter_types: None
[2016-12-15 13:05]   filter_senses: None
[2016-12-15 13:05]   filter_fn_name: conn_gt_0
[2016-12-15 13:05]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175460.d/resources//word_embeddings/precompiled/random_projection/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:05] load dataset for prediction (/work/jobs/16175460.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:05] lang: ?, doc_ids: 71, words: 34621, rel_ids: 625, relation tokens: 25754
[2016-12-15 13:05]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:05] build model
[2016-12-15 13:05]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:06]     config 'optimizer':  (adam)
[2016-12-15 13:06] previous weights (/work/jobs/16175460.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:06] convert from dataset (/work/jobs/16175460.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:06] make predictions
[2016-12-15 13:07] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll15st-en-03-29-16-blind-test/)
/work/jobs/16175460.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 553 to 'Expansion.Conjunction' ([  2.94404202e-07   9.92582027e-01   1.62048604e-03   1.09655934e-03
   1.03856402e-03   7.02133405e-04   2.74696738e-04   5.32732697e-04
   1.93715550e-03   7.73054638e-05   3.10941833e-05   2.36723155e-05
   3.01913389e-05   1.91278446e-06   3.56844177e-05   4.07646032e-06
   6.55277702e-06   1.68369332e-06   2.75414039e-07   1.25331440e-06
   9.96594057e-07   6.52030908e-07])
fallback 917 to 'Expansion.Conjunction' ([  5.29358522e-06   5.59092514e-01   1.44324614e-01   1.24625346e-01
   3.12946323e-02   2.37411797e-02   3.18419817e-02   3.25238253e-02
   1.13853773e-02   2.21978348e-02   5.72392523e-03   4.12789680e-03
   2.57001930e-03   1.08917510e-03   4.18673031e-03   8.97434702e-04
   1.09568382e-04   9.82418482e-05   4.67420862e-05   3.65169903e-05
   7.01922026e-05   1.09593419e-05])
fallback 179 to 'Expansion.Conjunction' ([  6.29382384e-06   3.69862055e-01   1.96586045e-01   1.83838474e-01
   4.37434806e-02   3.41269900e-02   5.02228184e-02   4.68636906e-02
   1.47672605e-02   3.23665444e-02   8.27992811e-03   6.47050756e-03
   3.90777602e-03   1.91676351e-03   5.20857337e-03   1.37584856e-03
   1.50023510e-04   1.09140515e-04   5.35200568e-05   4.52289247e-05
   8.94540074e-05   9.58381964e-06])
fallback 581 to 'Expansion.Conjunction' ([  1.33216133e-06   8.38410915e-01   5.83390594e-02   4.74455729e-02
   9.78451037e-03   6.07205229e-03   9.59931501e-03   1.17536662e-02
   3.08947545e-03   8.68254901e-03   1.89979701e-03   2.00686325e-03
   9.52211326e-04   2.16987421e-04   1.36765756e-03   2.48931087e-04
   3.72115647e-05   3.31301890e-05   1.32194509e-05   1.74107972e-05
   2.38338271e-05   4.29916327e-06])
fallback 740 to 'Expansion.Conjunction' ([  2.11455681e-05   4.35169784e-01   1.47481754e-01   7.74778571e-02
   7.96542984e-02   9.39713191e-02   2.70338877e-02   3.79706098e-02
   7.33844858e-02   7.86627453e-03   4.30716852e-03   2.27046501e-03
   3.05267259e-03   1.97614449e-03   6.81881417e-03   9.37635715e-04
   1.78295638e-04   2.13343838e-04   8.14022056e-05   4.28438177e-05
   7.34864949e-05   1.63115055e-05])
fallback 602 to 'Expansion.Conjunction' ([  1.49748041e-06   8.08803813e-01   6.38460754e-02   5.96786452e-02
   1.12012171e-02   6.65781800e-03   1.24259622e-02   1.56583305e-02
   3.09914916e-03   9.68936944e-03   2.56722007e-03   2.79464718e-03
   1.38569871e-03   2.51140043e-04   1.44471359e-03   3.30650429e-04
   5.36657910e-05   3.51017996e-05   1.40921723e-05   2.69229828e-05
   3.00222461e-05   4.24738127e-06])
fallback 694 to 'Expansion.Conjunction' ([  3.12668089e-05   6.06762065e-01   1.06449405e-01   5.58081394e-02
   5.21599439e-02   5.65752065e-02   1.80940483e-02   2.50685407e-02
   5.80194531e-02   6.25762870e-03   3.49629492e-03   1.69642623e-03
   2.23977194e-03   1.18996729e-03   4.76015742e-03   7.31122114e-04
   1.81224478e-04   2.08448056e-04   9.15922958e-05   5.25787194e-05
   9.47246975e-05   3.19939943e-05])
fallback 792 to 'Expansion.Conjunction' ([  8.46939656e-06   4.38602991e-01   1.75489473e-01   1.58177810e-01
   3.91792177e-02   2.66560693e-02   4.34792160e-02   4.71458181e-02
   1.25270590e-02   2.90742018e-02   7.91206037e-03   8.41546071e-03
   4.67004727e-03   1.75961040e-03   4.73452087e-03   1.54747840e-03
   2.24293635e-04   1.22013802e-04   5.65674390e-05   7.84978632e-05
   1.25674736e-04   1.34492904e-05])
fallback 354 to 'Expansion.Conjunction' ([  7.36159622e-09   9.98727352e-01   5.96267503e-04   2.85234905e-04
   7.06049011e-05   3.62995659e-05   4.50766989e-05   8.21001934e-05
   5.97990930e-05   5.92810776e-05   1.02976962e-05   1.03341851e-05
   5.73785911e-06   3.83736722e-07   9.79061377e-06   4.45125424e-07
   1.98960984e-07   2.87615583e-07   8.12560946e-08   1.79824477e-07
   1.40983058e-07   9.91305071e-08])
fallback 565 to 'Expansion.Conjunction' ([  2.23181032e-05   7.95129183e-01   5.75781914e-02   3.33027021e-02
   2.41780319e-02   2.45677997e-02   1.02613261e-02   1.40843327e-02
   2.85654442e-02   4.05110374e-03   2.19323371e-03   9.69845049e-04
   1.24502066e-03   5.28000123e-04   2.51449157e-03   3.76083249e-04
   1.19203753e-04   1.19715617e-04   5.64718832e-05   3.61888816e-05
   6.66917915e-05   3.46207272e-05])
fallback 593 to 'Expansion.Conjunction' ([  3.57557883e-06   8.11881113e-01   6.65460070e-02   5.02682135e-02
   1.34992244e-02   9.26936125e-03   1.11584150e-02   1.35848418e-02
   5.35741347e-03   9.81372022e-03   2.44004881e-03   1.90584370e-03
   1.12889717e-03   3.38508364e-04   2.19485789e-03   3.75100406e-04
   6.00039885e-05   6.44958190e-05   2.93046083e-05   2.48205266e-05
   4.46860643e-05   1.15474721e-05])
fallback 347 to 'Expansion.Conjunction' ([  7.00126520e-06   3.62367148e-01   1.96600896e-01   1.85949874e-01
   4.41065946e-02   3.26729673e-02   5.10915622e-02   5.00977815e-02
   1.42992146e-02   3.26773333e-02   8.45296483e-03   8.01082410e-03
   4.54295234e-03   2.01638599e-03   5.03933609e-03   1.55069037e-03
   1.87065930e-04   1.10050072e-04   5.13677507e-05   5.59817883e-05
   1.02051809e-04   9.95541527e-06])
fallback 916 to 'Expansion.Conjunction' ([  2.80730274e-05   2.55222738e-01   2.00562627e-01   1.35057122e-01
   8.82232042e-02   9.38781874e-02   5.61677628e-02   5.97639979e-02
   6.31347300e-02   1.64385736e-02   7.84747397e-03   3.62810191e-03
   5.16570267e-03   3.67116486e-03   8.41585548e-03   1.95789477e-03
   2.53284874e-04   2.37512446e-04   1.31788184e-04   6.65434346e-05
   1.14880190e-04   3.27815906e-05])
fallback 272 to 'Expansion.Conjunction' ([  3.17547383e-05   2.37105997e-01   2.03915940e-01   1.63441465e-01
   8.13020547e-02   8.23155274e-02   6.39651571e-02   6.10646386e-02
   4.76850051e-02   2.25107299e-02   9.98737390e-03   4.81719061e-03
   5.26943899e-03   3.46220683e-03   9.84825759e-03   2.28251611e-03
   3.27455289e-04   2.34071443e-04   1.50628243e-04   7.94000739e-05
   1.58420474e-04   4.47707792e-05])
fallback 137 to 'Expansion.Conjunction' ([  4.91500955e-08   9.87406889e-01   4.47692247e-03   4.45684502e-03
   5.67510363e-04   2.63695454e-04   7.14303795e-04   8.14895711e-04
   1.35258856e-04   7.03505866e-04   1.20806200e-04   1.67376708e-04
   7.45690689e-05   4.29883303e-06   7.35813358e-05   8.93803990e-06
   2.88803579e-06   2.35270608e-06   7.02348458e-07   2.73698532e-06
   1.44432565e-06   4.29487207e-07])
fallback 10 to 'Expansion.Conjunction' ([  3.33886965e-05   6.10276413e-01   1.05704064e-01   5.58064256e-02
   5.13318377e-02   5.55010821e-02   1.82138499e-02   2.50346815e-02
   5.67653973e-02   6.35261660e-03   3.56065163e-03   1.70207178e-03
   2.25967942e-03   1.21835761e-03   4.79554907e-03   7.54110181e-04
   1.87128568e-04   2.15812052e-04   9.67770849e-05   5.49267872e-05
   9.96137334e-05   3.55658856e-05])
fallback 119 to 'Expansion.Conjunction' ([  4.46989725e-06   6.42902425e-01   1.20104185e-01   9.96968956e-02
   2.52364442e-02   1.85060852e-02   2.44581808e-02   2.63328418e-02
   9.28045424e-03   1.80831046e-02   4.55264275e-03   3.43656791e-03
   2.07615431e-03   7.97040808e-04   3.50757963e-03   7.06206881e-04
   9.16603300e-05   8.54642846e-05   3.94214107e-05   3.21119474e-05
   5.96074416e-05   1.04564086e-05])
fallback 467 to 'Expansion.Conjunction' ([  3.12325756e-05   3.56519609e-01   1.69316008e-01   9.81147809e-02
   8.38826223e-02   9.66287328e-02   3.94622348e-02   4.78020123e-02
   7.17150791e-02   1.08132567e-02   5.81656302e-03   2.75789969e-03
   4.00414410e-03   3.16393491e-03   7.68030201e-03   1.47597049e-03
   2.34619175e-04   2.64102942e-04   1.22536119e-04   6.27373009e-05
   9.88942773e-05   3.27270645e-05])
fallback 1024 to 'Expansion.Conjunction' ([  2.34008476e-05   2.61785298e-01   1.81698009e-01   1.02207474e-01
   1.04930349e-01   1.28325835e-01   4.32262420e-02   5.50252348e-02
   8.43565687e-02   1.03952754e-02   5.77753130e-03   3.08496877e-03
   4.25056274e-03   3.86473722e-03   8.80088842e-03   1.50965096e-03
   2.23495022e-04   2.67481897e-04   9.95322551e-05   5.27981246e-05
   7.60771653e-05   1.85894496e-05])
fallback 1 to 'Expansion.Conjunction' ([  8.28525572e-06   3.05931742e-01   2.07733821e-01   2.02939149e-01
   4.86403472e-02   3.71017338e-02   5.82035286e-02   5.50934887e-02
   1.58744117e-02   3.50382024e-02   9.48964510e-03   8.61971625e-03
   5.07881158e-03   2.42278395e-03   5.46346270e-03   1.77824180e-03
   2.13624950e-04   1.20917522e-04   5.82714083e-05   6.29015839e-05
   1.16123510e-04   1.07890408e-05])
fallback 404 to 'Expansion.Conjunction' ([  1.76401181e-06   8.07452636e-01   6.95737242e-02   5.50488990e-02
   1.21170229e-02   7.66801245e-03   1.15661689e-02   1.40396341e-02
   3.98401086e-03   1.03398238e-02   2.24887258e-03   2.35228758e-03
   1.13767295e-03   2.93921161e-04   1.69775685e-03   3.18730227e-04
   4.64349187e-05   4.10357288e-05   1.66773356e-05   1.99957271e-05
   2.96137811e-05   5.30531781e-06])
fallback 922 to 'Expansion.Conjunction' ([  2.46525869e-05   2.93108189e-01   1.76347282e-01   9.84033920e-02
   9.91747283e-02   1.21030283e-01   4.09936561e-02   5.21689344e-02
   8.19690954e-02   1.00274298e-02   5.58652856e-03   2.92054022e-03
   4.05144357e-03   3.59694000e-03   8.42421204e-03   1.43457795e-03
   2.21280987e-04   2.63388699e-04   1.01345262e-04   5.35401984e-05
   7.80249085e-05   2.05355932e-05])
fallback 135 to 'Expansion.Conjunction' ([  4.46478140e-07   9.40582362e-01   2.23082553e-02   1.82741439e-02
   3.06629445e-03   1.76619732e-03   3.20516093e-03   4.08260443e-03
   8.97955117e-04   3.38524054e-03   6.80360497e-04   7.67760350e-04
   3.43562201e-04   5.01286136e-05   4.71133316e-04   6.56528301e-05
   1.22370369e-05   1.39004200e-05   5.36468967e-06   9.24489749e-06
   9.75642279e-06   2.23848367e-06])
fallback 311 to 'Expansion.Conjunction' ([  2.04862758e-08   9.96718644e-01   1.23231183e-03   1.01197103e-03
   1.63781646e-04   6.36816693e-05   1.96045977e-04   2.42368638e-04
   4.35748115e-05   1.94713750e-04   3.21683146e-05   4.64122349e-05
   2.53183534e-05   8.41052553e-07   2.10864600e-05   2.39464316e-06
   1.13910266e-06   8.33417060e-07   3.03030276e-07   1.67176688e-06
   5.04210390e-07   2.13811930e-07])
fallback 840 to 'Expansion.Conjunction' ([  1.81922655e-06   7.48841811e-01   8.60935810e-02   7.58685086e-02
   1.53471369e-02   9.70272985e-03   1.62784436e-02   1.91616842e-02
   4.54059982e-03   1.32130150e-02   3.07955705e-03   3.32397893e-03
   1.60940979e-03   3.91506235e-04   1.93574707e-03   4.28010471e-04
   5.94172771e-05   4.30810063e-05   1.71752342e-05   2.44170275e-05
   3.37429369e-05   4.62762675e-06])
fallback 1066 to 'Expansion.Conjunction' ([  2.46377058e-05   2.58819018e-01   1.75369847e-01   9.76157129e-02
   1.10395471e-01   1.38925122e-01   4.02719348e-02   5.42094306e-02
   8.50282399e-02   9.87313238e-03   5.76370917e-03   3.24028619e-03
   4.12882452e-03   4.03142075e-03   9.96716523e-03   1.53314057e-03
   2.41877515e-04   3.11464484e-04   1.00289335e-04   5.25573713e-05
   7.91454526e-05   1.75735661e-05])
fallback 590 to 'Expansion.Conjunction' ([  4.01512398e-06   5.99957067e-01   1.35430847e-01   1.13443087e-01
   2.72071854e-02   1.92575330e-02   2.75945057e-02   2.96287676e-02
   9.34363091e-03   2.09070096e-02   4.91510765e-03   4.36106663e-03
   2.39839808e-03   9.08474639e-04   3.54299612e-03   7.86455488e-04
   9.75742470e-05   7.94371322e-05   3.55741878e-05   3.32227583e-05
   5.95424917e-05   8.50274253e-06])
fallback 609 to 'Expansion.Conjunction' ([  1.92382522e-05   8.18280597e-01   5.08723420e-02   2.96452052e-02
   2.13145879e-02   2.16091597e-02   8.99095761e-03   1.24884074e-02
   2.61109980e-02   3.53573527e-03   1.91796762e-03   8.59626705e-04
   1.07090643e-03   4.33652556e-04   2.16380116e-03   3.13929173e-04
   1.05514637e-04   1.02040811e-04   4.62702093e-05   3.18481260e-05
   5.70152419e-05   3.01990119e-05])
fallback 87 to 'Expansion.Conjunction' ([  5.91538519e-05   6.78501253e-01   9.03541154e-02   5.44801843e-02
   3.73755137e-02   3.79262681e-02   1.82893631e-02   2.32377613e-02
   3.45739129e-02   8.00147193e-03   4.26056239e-03   1.72911004e-03
   2.54337887e-03   1.38319809e-03   5.23852281e-03   9.79742159e-04
   2.46631624e-04   2.83066273e-04   1.77002426e-04   7.95844250e-05
   1.71886293e-04   1.08316600e-04])
fallback 905 to 'Expansion.Conjunction' ([  1.69714986e-05   3.84587342e-01   1.83694509e-01   1.59486575e-01
   5.22835210e-02   4.47347046e-02   4.86094200e-02   4.88307879e-02
   2.15890609e-02   2.67750021e-02   8.89812118e-03   4.96363586e-03
   4.00948007e-03   2.31813124e-03   6.79266630e-03   1.67656245e-03
   2.03772576e-04   1.89827752e-04   1.10794046e-04   6.30404093e-05
   1.38671921e-04   2.74019836e-05])
fallback 715 to 'Expansion.Conjunction' ([  4.90660896e-05   4.48408503e-01   1.52912509e-01   1.01303381e-01
   6.28162458e-02   6.45361303e-02   3.77445994e-02   4.26553254e-02
   4.82665735e-02   1.39089950e-02   6.96713693e-03   2.82052152e-03
   4.28130467e-03   2.69569403e-03   7.77605762e-03   1.71533979e-03
   2.93333746e-04   3.11683972e-04   1.97280048e-04   8.56595777e-05
   1.77017700e-04   7.76419310e-05])
fallback 853 to 'Expansion.Conjunction' ([  2.81881676e-05   2.63935062e-01   1.96916820e-01   1.27514349e-01
   8.95460181e-02   9.63847720e-02   5.37691903e-02   5.90267857e-02
   6.70624977e-02   1.51767509e-02   7.41492730e-03   3.39500167e-03
   5.15785632e-03   3.73645968e-03   8.20629678e-03   1.89753891e-03
   2.43987599e-04   2.48331288e-04   1.32097282e-04   6.57792194e-05
   1.09322981e-04   3.19675894e-05])
fallback 920 to 'Expansion.Conjunction' ([  2.17683009e-07   9.76351020e-01   9.19879039e-03   7.36076616e-03
   1.09902874e-03   6.18514545e-04   1.17883726e-03   1.44040759e-03
   3.68525128e-04   1.43687962e-03   2.60233122e-04   3.12583724e-04
   1.18668162e-04   1.59329883e-05   1.91604834e-04   2.10446232e-05
   5.33996307e-06   7.05001501e-06   2.54277597e-06   5.56024041e-06
   4.79844947e-06   1.65405867e-06])
fallback 790 to 'Expansion.Conjunction' ([  3.80026868e-05   3.13341226e-01   1.87270639e-01   1.45862980e-01
   7.21348290e-02   7.25323250e-02   5.49609616e-02   5.50047002e-02
   4.32723680e-02   2.10051981e-02   9.45678992e-03   4.23887925e-03
   5.05451013e-03   3.08368164e-03   9.54888002e-03   2.09709300e-03
   3.31371290e-04   2.60058961e-04   1.78440748e-04   8.41566277e-05
   1.82865825e-04   6.00440281e-05])
fallback 14 to 'Expansion.Conjunction' ([  9.07619415e-06   2.51092911e-01   2.20697672e-01   2.16758997e-01
   5.50038815e-02   4.68384922e-02   6.48637862e-02   5.65071852e-02
   1.88493599e-02   3.61617022e-02   1.02602206e-02   7.00079604e-03
   4.68197838e-03   2.78418116e-03   6.19604207e-03   1.74575392e-03
   1.74607602e-04   1.30141780e-04   7.14350173e-05   5.28357305e-05
   1.07684042e-04   1.12608305e-05])
fallback 795 to 'Expansion.Conjunction' ([  1.16018464e-05   8.77543023e-01   3.73381410e-02   2.51753067e-02
   1.18672847e-02   1.06204235e-02   7.11181380e-03   9.35552818e-03
   8.61329669e-03   5.02327266e-03   1.97495471e-03   9.30582396e-04
   9.95831204e-04   3.49959588e-04   2.41544398e-03   3.07872976e-04
   8.29609772e-05   9.02977690e-05   5.33954257e-05   3.32368578e-05
   5.93102262e-05   4.64619838e-05])
fallback 417 to 'Expansion.Conjunction' ([  1.26872337e-05   3.45591875e-01   1.96170391e-01   1.76988647e-01
   5.25167029e-02   4.48554533e-02   5.26791404e-02   5.07688004e-02
   2.00622642e-02   3.01103631e-02   9.23087174e-03   5.66255957e-03
   4.13072577e-03   2.41316298e-03   6.53308075e-03   1.63905277e-03
   1.83230267e-04   1.62086654e-04   9.11090834e-05   5.81402859e-05
   1.20694502e-04   1.89609019e-05])
fallback 1196 to 'Expansion.Conjunction' ([  2.13537314e-05   2.17853054e-01   1.90275579e-01   1.10756903e-01
   1.11146748e-01   1.34293884e-01   4.81363719e-02   5.91389088e-02
   8.75246745e-02   1.12435240e-02   6.13170720e-03   3.34586016e-03
   4.51665603e-03   4.25071547e-03   8.99371408e-03   1.64964643e-03
   2.26785515e-04   2.58502811e-04   9.48711746e-05   5.19352396e-05
   7.21432586e-05   1.64623761e-05])
fallback 241 to 'Expansion.Conjunction' ([  2.53463277e-05   5.13417663e-01   1.29633844e-01   6.71226161e-02
   6.69226723e-02   7.57383632e-02   2.26751567e-02   3.17126067e-02
   6.81819695e-02   7.13084780e-03   3.92126712e-03   1.99658937e-03
   2.69559027e-03   1.57249615e-03   5.78731859e-03   8.36897179e-04
   1.79029260e-04   2.10780622e-04   8.69026629e-05   4.74401897e-05
   8.25855607e-05   2.20171515e-05])
fallback 308 to 'Expansion.Conjunction' ([  9.20410130e-08   9.79887075e-01   7.08101648e-03   7.00565526e-03
   9.49083077e-04   4.61694468e-04   1.13505789e-03   1.39045693e-03
   2.29110404e-04   1.07280911e-03   2.13626672e-04   2.82360738e-04
   1.24145227e-04   8.55786317e-06   1.24986052e-04   1.72184010e-05
   4.76598146e-06   3.80210534e-06   1.18853428e-06   4.15293656e-06
   2.49938627e-06   6.45376365e-07])
fallback 707 to 'Expansion.Conjunction' ([  3.46679116e-07   9.39383730e-01   2.19659765e-02   1.96618491e-02
   2.99544348e-03   1.69759264e-03   3.36763141e-03   4.30278054e-03
   8.06219514e-04   3.34726571e-03   7.06387265e-04   8.18768038e-04
   3.63073830e-04   4.55822803e-05   4.26974199e-04   6.41416326e-05
   1.17446069e-05   1.15003784e-05   4.29265895e-06   8.72820951e-06
   8.32119518e-06   1.64980972e-06])
fallback 399 to 'Expansion.Conjunction' ([  6.42929808e-06   3.68419410e-01   1.96522341e-01   1.84073181e-01
   4.40663287e-02   3.47425641e-02   5.05241343e-02   4.68018019e-02
   1.50393919e-02   3.22673992e-02   8.34087844e-03   6.28076822e-03
   3.86586623e-03   1.92921854e-03   5.28603002e-03   1.37400232e-03
   1.49009837e-04   1.11351518e-04   5.51828018e-05   4.49724104e-05
   8.98841466e-05   9.85497084e-06])
fallback 332 to 'Expansion.Conjunction' ([  1.16146639e-05   2.26550176e-01   2.26230234e-01   2.16374188e-01
   6.02948963e-02   5.24552389e-02   6.78746476e-02   5.94410523e-02
   2.15988755e-02   3.47937606e-02   1.05119776e-02   6.75158714e-03
   4.82243252e-03   3.09631787e-03   6.66280183e-03   1.92164664e-03
   1.89300553e-04   1.47099810e-04   8.43811211e-05   5.64058318e-05
   1.17552903e-04   1.38120913e-05])
fallback 334 to 'Expansion.Conjunction' ([  3.28375393e-07   9.76512184e-01   9.35773728e-03   6.75673869e-03
   1.23776483e-03   7.04252387e-04   1.12202856e-03   1.47798994e-03
   4.53795360e-04   1.38167209e-03   2.60932456e-04   3.04198413e-04
   1.22627679e-04   1.82513648e-05   2.31319119e-04   2.48344256e-05
   6.47235213e-06   9.11691031e-06   3.32930537e-06   5.98114815e-06
   5.99123581e-06   2.45413660e-06])
fallback 569 to 'Expansion.Conjunction' ([  1.03159928e-05   6.04143687e-01   1.25423612e-01   1.03162461e-01
   3.21181868e-02   2.55774095e-02   2.74459574e-02   3.03780850e-02
   1.34137675e-02   1.90741292e-02   5.82786471e-03   3.43985255e-03
   2.53428662e-03   1.13278943e-03   4.81944491e-03   9.75395042e-04
   1.36015691e-04   1.41498576e-04   7.51601484e-05   4.79028538e-05
   9.87564067e-05   2.34208477e-05])
fallback 696 to 'Expansion.Conjunction' ([  9.24339417e-07   9.19015631e-01   3.07835187e-02   2.29971349e-02
   4.79371885e-03   2.85600447e-03   4.31127606e-03   5.63931177e-03
   1.61096393e-03   4.51716867e-03   9.34690920e-04   1.00609321e-03
   4.71117142e-04   8.94388708e-05   7.73225025e-04   1.14401466e-04
   2.06752771e-05   2.30723050e-05   9.19205362e-06   1.22895015e-05
   1.60404759e-05   4.11093599e-06])
fallback 728 to 'Expansion.Conjunction' ([  1.26872337e-05   3.45591875e-01   1.96170391e-01   1.76988647e-01
   5.25167029e-02   4.48554533e-02   5.26791404e-02   5.07688004e-02
   2.00622642e-02   3.01103631e-02   9.23087174e-03   5.66255957e-03
   4.13072577e-03   2.41316298e-03   6.53308075e-03   1.63905277e-03
   1.83230267e-04   1.62086654e-04   9.11090834e-05   5.81402859e-05
   1.20694502e-04   1.89609019e-05])
fallback 24 to 'Expansion.Conjunction' ([  3.53882346e-09   9.99722656e-01   5.15370846e-05   3.61528617e-05
   4.08335544e-05   1.43945135e-05   6.87696090e-06   2.17020715e-05
   1.00034143e-04   2.15854174e-06   5.78197271e-07   7.21012495e-07
   1.27254691e-06   1.03421102e-08   5.24711252e-07   6.42374613e-08
   3.45570668e-07   3.54171482e-08   2.92627654e-09   5.88745725e-08
   2.30103651e-08   1.42180294e-08])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175460.ba+   1851604K    868545K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175460     rnn-rando+          2                         00:04:10      0:0 

Job 16175460 ("rnn-randomprojection-wikipedia") completed on c16-31 at tor dec 15 13:07:54 CET 2016
