Starting job 16175468 ("rnn-glove-wikipedia") on c31-8 at tor dec 15 13:06:56 CET 2016
Python environment is set up
Copying files to /work/jobs/16175468.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175468.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16175468.d/resources//word_embeddings/precompiled/glove/size=50.embeddings
MODEL_PATH: /work/jobs/16175468.d/models/rnn-glove-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175468.d/resources//word_embeddings/precompiled/glove/size=50.embeddings", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:07] configuration (/work/jobs/16175468.d/models/rnn-glove-wikipedia/)
[2016-12-15 13:07]     config 'epochs': 200 (1000)
[2016-12-15 13:07]     config 'epochs_len': -1 (-1)
[2016-12-15 13:07]     config 'epochs_patience': 10 (20)
[2016-12-15 13:07]     config 'batch_size':  (64)
[2016-12-15 13:07]     config 'snapshot_size':  (2048)
[2016-12-15 13:07]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:07]     config 'words_dim': 20.0 (20)
[2016-12-15 13:07]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:07]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:07]     config 'final_dim': 40.0 (100)
[2016-12-15 13:07]     config 'arg1_len':  (100)
[2016-12-15 13:07]     config 'arg2_len':  (100)
[2016-12-15 13:07]     config 'conn_len':  (10)
[2016-12-15 13:07]     config 'punc_len':  (2)
[2016-12-15 13:07]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:07]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:07]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:07]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:07]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:07]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:07]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:07]     config 'words2vec_bin': None (None)
[2016-12-15 13:07]     config 'words2vec_txt': /work/jobs/16175468.d/resources//word_embeddings/precompiled/glove/size=50.embeddings (None)
[2016-12-15 13:07]   args.lang: en
[2016-12-15 13:07]   args.model_dir: /work/jobs/16175468.d/models/rnn-glove-wikipedia/
[2016-12-15 13:07]   args.dataset_dir: /work/jobs/16175468.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-15 13:07]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll16st-en-03-29-16-dev/
[2016-12-15 13:07]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:07]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:07]   filter_types: None
[2016-12-15 13:07]   filter_senses: None
[2016-12-15 13:07]   filter_fn_name: conn_gt_0
[2016-12-15 13:07]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175468.d/resources//word_embeddings/precompiled/glove/size=50.embeddings', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:07] load dataset for prediction (/work/jobs/16175468.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:07] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-15 13:07]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:07] build model
[2016-12-15 13:07]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:08]     config 'optimizer':  (adam)
[2016-12-15 13:08] previous weights (/work/jobs/16175468.d/models/rnn-glove-wikipedia/)
[2016-12-15 13:08] convert from dataset (/work/jobs/16175468.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:08] make predictions
[2016-12-15 13:09] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll16st-en-03-29-16-dev/)
/work/jobs/16175468.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 36214 to 'Expansion.Conjunction' ([  2.62611044e-09   9.98198306e-01   6.30442270e-04   7.09555036e-04
   1.15864805e-04   1.08791416e-05   1.49514260e-04   1.21266163e-04
   1.09501941e-05   2.75290961e-05   3.93500786e-06   8.88281170e-06
   5.05108061e-06   9.75220307e-08   5.61798547e-06   6.35250826e-07
   1.21578122e-06   1.53310804e-07   5.03643070e-09   7.25211730e-08
   1.48104032e-08   9.75936374e-09])
fallback 36212 to 'Expansion.Conjunction' ([  9.23112225e-07   7.31321464e-01   8.96082458e-02   6.66584680e-02
   2.45244190e-02   5.83068895e-03   3.71144978e-02   2.44268089e-02
   4.34956333e-03   5.31321771e-03   2.56799258e-03   3.71837109e-03
   1.87157679e-03   2.71478759e-04   1.42928133e-03   6.50140291e-04
   2.90109023e-04   2.40651155e-05   3.75083601e-06   1.34645790e-05
   6.83374729e-06   4.63916110e-06])
fallback 36262 to 'Expansion.Conjunction' ([  2.70393571e-06   5.23280331e-01   1.84874687e-01   5.60194077e-02
   7.05213111e-02   4.21988114e-02   2.30709299e-02   2.71506668e-02
   5.05905309e-02   9.05743442e-03   2.68615926e-03   1.54472867e-03
   4.04880063e-03   3.81148630e-04   3.32686054e-03   1.06656937e-03
   1.39020720e-04   5.21364299e-06   5.66215076e-06   1.29676921e-05
   1.26627194e-05   3.39207673e-06])
fallback 36920 to 'Expansion.Conjunction' ([  2.14104841e-08   9.86592905e-01   4.46503151e-03   4.65099754e-03
   1.04712836e-03   1.15334808e-04   1.48359595e-03   1.03299461e-03
   1.08256239e-04   2.01773033e-04   4.58675720e-05   1.25928900e-04
   4.82505392e-05   2.21655709e-06   5.40431910e-05   1.12591189e-05
   1.20853303e-05   1.28844797e-06   6.48239090e-08   6.86280270e-07
   1.71485328e-07   9.97893481e-08])
fallback 36919 to 'Expansion.Conjunction' ([  1.61095972e-08   9.91562327e-01   2.65731272e-03   3.27901427e-04
   2.26653744e-03   8.91438878e-04   1.33135795e-04   1.44800611e-04
   1.86903779e-03   6.08160457e-05   5.97432757e-06   7.63357472e-06
   2.73276806e-05   3.91101875e-06   3.54816009e-05   3.98136998e-06
   2.16641961e-06   5.40620999e-08   1.91821052e-08   6.86497415e-08
   3.85442193e-08   1.96303688e-08])
fallback 36362 to 'Expansion.Conjunction' ([  2.27714558e-09   9.98438893e-01   6.98252463e-04   4.55144967e-04
   1.25294406e-04   1.30784301e-05   1.04864841e-04   9.40442768e-05
   1.88438462e-05   2.16786684e-05   5.01527119e-06   6.83485813e-06
   5.93879485e-06   9.39285910e-08   9.99934489e-06   6.72572013e-07
   1.18493494e-06   7.37348243e-08   9.55271594e-09   5.80470320e-08
   1.46101699e-08   7.07534608e-09])
fallback 35749 to 'Expansion.Conjunction' ([  1.49982588e-06   5.59859163e-01   1.49211453e-01   4.06057802e-02
   7.60621959e-02   4.88104230e-02   1.72365161e-02   2.15593076e-02
   7.02886217e-02   6.71006328e-03   1.50925086e-03   1.12730743e-03
   3.25808003e-03   3.94757201e-04   2.63926623e-03   6.08687296e-04
   8.85243581e-05   3.93502846e-06   2.99841739e-06   1.00298167e-05
   9.92750677e-06   2.21206303e-06])
fallback 35923 to 'Expansion.Conjunction' ([  4.41266280e-07   7.86040166e-01   7.62946138e-02   5.51899396e-02
   1.87761145e-02   4.40346112e-03   2.77301531e-02   1.75171266e-02
   3.35151810e-03   3.90421705e-03   1.39415319e-03   2.08473852e-03
   1.43610158e-03   1.38983825e-04   1.17491602e-03   3.81203358e-04
   1.51677708e-04   1.34933949e-05   2.22407715e-06   7.48833534e-06
   4.30265470e-06   2.96653199e-06])
fallback 36222 to 'Expansion.Conjunction' ([  2.85115664e-09   9.98518860e-01   4.40286316e-04   6.49792010e-04
   9.38656062e-05   7.84370949e-06   1.29704739e-04   1.08567253e-04
   6.91077713e-06   2.36824320e-05   3.08318674e-06   8.75013190e-06
   3.31697212e-06   8.44079914e-08   3.28988191e-06   5.27637029e-07
   1.11663278e-06   2.10375086e-07   3.04765716e-09   8.22357913e-08
   1.15112850e-08   8.30272453e-09])
fallback 35791 to 'Expansion.Conjunction' ([  1.50201754e-06   5.49548642e-01   1.50483627e-01   4.07063041e-02
   7.87910469e-02   5.08007049e-02   1.73647614e-02   2.18109700e-02
   7.39511198e-02   6.73807991e-03   1.51438282e-03   1.13710951e-03
   3.33914357e-03   4.16973792e-04   2.66968210e-03   6.05988334e-04
   9.03422650e-05   3.99548355e-06   3.06992215e-06   1.01915442e-05
   1.01143353e-05   2.24811794e-06])
fallback 36651 to 'Expansion.Conjunction' ([  1.22802324e-09   9.99157510e-01   2.20441381e-04   1.46300803e-05
   2.90952920e-04   8.46333806e-05   7.03434595e-06   6.52290251e-06
   2.09713869e-04   2.95480101e-06   1.40664045e-07   4.01014242e-07
   2.15129585e-06   1.95534572e-07   2.29788093e-06   1.74369934e-07
   2.35709740e-07   2.21502288e-09   6.57120317e-10   3.13177824e-09
   1.15923018e-09   1.05453304e-09])
fallback 36254 to 'Expansion.Conjunction' ([  1.28458680e-07   9.61068219e-01   1.29675978e-02   1.09304470e-02
   3.59823766e-03   5.29906832e-04   4.77427014e-03   3.60672713e-03
   5.34108785e-04   6.66582088e-04   2.77813293e-04   5.23321101e-04
   1.90935361e-04   1.89176973e-05   1.86471633e-04   5.89638952e-05
   5.88775259e-05   4.51314511e-06   3.91975507e-07   2.37466158e-06
   7.23472799e-07   4.71882063e-07])
fallback 36213 to 'Expansion.Conjunction' ([  2.59076725e-08   9.85633585e-01   4.71781461e-03   4.93354291e-03
   1.14021226e-03   1.26750976e-04   1.62111242e-03   1.14422696e-03
   1.19402201e-04   2.19760908e-04   5.39159286e-05   1.46820715e-04
   5.24612392e-05   2.67389434e-06   5.76935584e-05   1.29795577e-05
   1.43344883e-05   1.50085039e-06   7.53659088e-08   8.01564887e-07
   1.94806285e-07   1.13600575e-07])
fallback 36502 to 'Expansion.Conjunction' ([  2.87275839e-06   7.22253818e-01   1.09801362e-01   3.37308617e-02
   4.00410714e-02   2.23619385e-02   1.28949688e-02   1.67067428e-02
   2.79827032e-02   5.69825308e-03   1.91303953e-03   9.33994504e-04
   2.24868237e-03   1.94134166e-04   2.24515522e-03   8.29814372e-04
   1.25763184e-04   5.11179873e-06   5.60265394e-06   1.27008801e-05
   8.45035378e-06   2.95886305e-06])
fallback 35802 to 'Expansion.Conjunction' ([  2.16972899e-06   3.76387777e-01   1.87372507e-01   5.38677427e-02
   1.09986850e-01   7.77032156e-02   2.35231147e-02   3.08488851e-02
   1.17045388e-01   9.08894469e-03   2.22932851e-03   1.63434889e-03
   4.94506585e-03   7.59883380e-04   3.61214929e-03   8.14037867e-04
   1.32472313e-04   5.50963435e-06   5.15139757e-06   1.48503733e-05
   1.71305511e-05   3.47792322e-06])
fallback 36611 to 'Expansion.Conjunction' ([  1.50187623e-06   3.42630329e-01   2.26748379e-01   1.53719099e-01
   6.32743319e-02   2.13832503e-02   9.13879581e-02   5.17580774e-02
   1.25100101e-02   1.35358964e-02   4.95138535e-03   6.42560521e-03
   5.12239201e-03   8.13868776e-04   3.66269125e-03   1.63821610e-03
   3.62752358e-04   2.59370956e-05   7.17379641e-06   1.56197494e-05
   1.62405724e-05   9.28465223e-06])
fallback 36080 to 'Expansion.Conjunction' ([  7.61238208e-12   9.99993297e-01   1.15669817e-06   3.05018011e-08
   2.89892924e-06   6.32412747e-07   1.82080390e-08   1.38200665e-08
   1.93025034e-06   8.34687585e-09   1.11188611e-10   8.19864709e-10
   5.32944163e-09   3.80832078e-10   5.47448516e-09   2.70741477e-10
   1.60432951e-09   5.63527811e-12   1.25233826e-12   9.70416342e-12
   1.48586987e-12   3.92235409e-12])
fallback 37106 to 'Expansion.Conjunction' ([  6.89427907e-07   7.85211456e-01   6.00380199e-02   1.25575598e-02
   4.40636656e-02   2.85448213e-02   5.10981361e-03   7.09421664e-03
   5.16088203e-02   2.27564856e-03   4.53195803e-04   3.75987065e-04
   1.17661876e-03   2.29280867e-04   1.01810684e-03   1.79691257e-04
   4.93608357e-05   2.02531763e-06   1.43420370e-06   4.90374858e-06
   3.65243050e-06   1.03228355e-06])
fallback 36017 to 'Expansion.Conjunction' ([  4.41518466e-09   9.98616447e-01   3.99375854e-04   5.70979022e-04
   1.00872588e-04   8.53417160e-06   1.30676707e-04   1.16586851e-04
   8.58451941e-06   2.27326743e-05   4.18616305e-06   1.12006618e-05
   3.61040562e-06   1.34091805e-07   3.42272571e-06   6.17439747e-07
   1.59557565e-06   2.91236202e-07   3.88094442e-09   1.20402304e-07
   1.36047332e-08   9.98572504e-09])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175468.ba+   1648160K    834856K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175468     rnn-glove+          2                         00:02:30      0:0 

Job 16175468 ("rnn-glove-wikipedia") completed on c31-8 at tor dec 15 13:09:24 CET 2016
