Starting job 16175484 ("rnn-random-vectors") on c31-8 at tor dec 15 13:16:45 CET 2016
Python environment is set up
Copying files to /work/jobs/16175484.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175484.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16175484.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt
MODEL_PATH: /work/jobs/16175484.d/models/rnn-random-vectors/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-random-vectors-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175484.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:17] configuration (/work/jobs/16175484.d/models/rnn-random-vectors/)
[2016-12-15 13:17]     config 'epochs': 200 (1000)
[2016-12-15 13:17]     config 'epochs_len': -1 (-1)
[2016-12-15 13:17]     config 'epochs_patience': 10 (20)
[2016-12-15 13:17]     config 'batch_size':  (64)
[2016-12-15 13:17]     config 'snapshot_size':  (2048)
[2016-12-15 13:17]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:17]     config 'words_dim': 20.0 (20)
[2016-12-15 13:17]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:17]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:17]     config 'final_dim': 40.0 (100)
[2016-12-15 13:17]     config 'arg1_len':  (100)
[2016-12-15 13:17]     config 'arg2_len':  (100)
[2016-12-15 13:17]     config 'conn_len':  (10)
[2016-12-15 13:17]     config 'punc_len':  (2)
[2016-12-15 13:17]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:17]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:17]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:17]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:17]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:17]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:17]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:17]     config 'words2vec_bin': None (None)
[2016-12-15 13:17]     config 'words2vec_txt': /work/jobs/16175484.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt (None)
[2016-12-15 13:17]   args.lang: en
[2016-12-15 13:17]   args.model_dir: /work/jobs/16175484.d/models/rnn-random-vectors/
[2016-12-15 13:17]   args.dataset_dir: /work/jobs/16175484.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-15 13:17]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-random-vectors-conll16st-en-03-29-16-test/
[2016-12-15 13:17]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:17]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:17]   filter_types: None
[2016-12-15 13:17]   filter_senses: None
[2016-12-15 13:17]   filter_fn_name: conn_gt_0
[2016-12-15 13:17]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175484.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:17] load dataset for prediction (/work/jobs/16175484.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:17] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-15 13:17]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:17] build model
[2016-12-15 13:17]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:17]     config 'optimizer':  (adam)
[2016-12-15 13:17] previous weights (/work/jobs/16175484.d/models/rnn-random-vectors/)
[2016-12-15 13:17] convert from dataset (/work/jobs/16175484.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:17] make predictions
[2016-12-15 13:19] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-random-vectors-conll16st-en-03-29-16-test/)
/work/jobs/16175484.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 37361 to 'Expansion.Conjunction' ([  9.76062802e-06   8.63928125e-01   7.47114035e-02   1.91124935e-02
   4.98223296e-03   2.72901771e-03   2.12054882e-02   5.48623400e-03
   4.71065162e-04   3.77865199e-03   1.84339969e-03   2.80774689e-04
   7.54771683e-04   6.13997025e-05   5.38657469e-04   7.15525154e-05
   2.90536040e-05   9.44362439e-07   3.63379848e-06   4.35688541e-07
   3.23149118e-07   5.81175915e-07])
fallback 38711 to 'Expansion.Conjunction' ([  6.94436094e-05   3.56852029e-01   2.85135779e-01   9.07033842e-02
   3.97274275e-02   3.07393711e-02   1.11901471e-01   3.32151953e-02
   6.88965534e-03   1.98017361e-02   9.17997688e-03   3.79991303e-03
   5.22368175e-03   1.43265039e-03   3.95654379e-03   8.51208238e-04
   3.82001458e-04   2.84383808e-05   6.31028677e-05   1.08402375e-05
   1.81851012e-05   1.79656983e-05])
fallback 37197 to 'Expansion.Conjunction' ([  2.90051939e-05   4.37932040e-01   2.95469848e-01   5.93959758e-02
   3.63795717e-02   2.33012343e-02   7.65508853e-02   2.71367279e-02
   6.78942486e-03   2.10912207e-02   5.91346616e-03   2.63238905e-03
   3.37229130e-03   7.09102774e-04   2.63072501e-03   4.30005890e-04
   1.86898089e-04   1.15524980e-05   1.95897153e-05   4.86104086e-06
   7.65448742e-06   5.53040304e-06])
fallback 38080 to 'Expansion.Conjunction' ([  6.45301334e-05   4.01529755e-01   2.64774946e-01   8.51917780e-02
   3.60830571e-02   2.74766681e-02   1.05549483e-01   3.12362385e-02
   5.75950503e-03   1.90390700e-02   8.56913152e-03   3.20291539e-03
   5.40446904e-03   1.32601835e-03   3.55178487e-03   7.63470066e-04
   3.55870139e-04   2.41704763e-05   5.72696220e-05   9.24835958e-06
   1.43793930e-05   1.62419854e-05])
fallback 38787 to 'Expansion.Conjunction' ([  1.10662031e-08   9.96260956e-01   1.08643565e-03   2.82044760e-04
   4.08694067e-04   1.07841580e-03   7.57343817e-05   1.33692565e-04
   5.16964713e-04   8.18252387e-05   1.10620096e-05   1.92904511e-06
   4.04416648e-05   1.49312054e-06   1.79651582e-05   1.42716092e-06
   8.72388355e-07   9.86870156e-10   1.63474872e-08   1.11327207e-08
   2.33798673e-09   4.09640461e-09])
fallback 37873 to 'Expansion.Conjunction' ([  3.38018508e-05   3.83536191e-01   2.95583905e-01   6.86321857e-02
   5.37633116e-02   3.50106956e-02   7.13160935e-02   3.58171874e-02
   1.16379299e-02   2.53172257e-02   6.62872757e-03   3.55149434e-03
   4.13467830e-03   1.10911055e-03   3.09712511e-03   4.94325768e-04
   2.69451383e-04   1.38242313e-05   2.36613124e-05   8.48371568e-06
   1.26098267e-05   7.98026943e-06])
fallback 38205 to 'Expansion.Conjunction' ([  1.01972855e-05   6.16243244e-01   1.42107874e-01   5.60174772e-02
   4.27299292e-02   5.32186815e-02   2.07747035e-02   2.12107972e-02
   2.34292634e-02   1.33489361e-02   3.90311913e-03   1.48252829e-03
   2.70440826e-03   8.06354977e-04   1.42948411e-03   3.23046640e-04
   2.18223984e-04   4.21417827e-06   1.48888285e-05   9.40162865e-06
   7.19903939e-06   6.02703495e-06])
fallback 38437 to 'Expansion.Conjunction' ([  4.86144745e-05   4.19037460e-01   2.92022138e-01   7.07655771e-02
   3.19201126e-02   2.03341022e-02   9.97369883e-02   2.53786481e-02
   4.76597155e-03   1.74157340e-02   7.05134401e-03   2.65872431e-03
   3.97130706e-03   9.40623982e-04   2.99376598e-03   6.51175678e-04
   2.20238100e-04   1.82900548e-05   4.18439193e-05   6.16288524e-06
   1.03081520e-05   1.08695567e-05])
fallback 37721 to 'Expansion.Conjunction' ([  3.60675622e-05   3.64138055e-01   3.05872162e-01   7.08007119e-02
   5.46957721e-02   3.55664816e-02   7.46513283e-02   3.70326701e-02
   1.17553180e-02   2.54168204e-02   6.81882935e-03   3.70235566e-03
   4.21855632e-03   1.14679985e-03   3.27953546e-03   5.24585351e-04
   2.73207339e-04   1.50190758e-05   2.48575699e-05   8.86743391e-06
   1.36368258e-05   8.36202226e-06])
fallback 38226 to 'Expansion.Conjunction' ([  9.11226380e-06   8.62659878e-01   7.62970826e-02   1.89344326e-02
   5.13459047e-03   2.83261647e-03   2.05044152e-02   5.61566189e-03
   5.10007379e-04   3.95090229e-03   1.83007250e-03   2.84035750e-04
   7.38163426e-04   5.93807276e-05   5.37164688e-04   6.80669041e-05
   2.90030423e-05   9.02731080e-07   3.23557426e-06   4.29186943e-07
   3.19635890e-07   5.27053832e-07])
fallback 37148 to 'Expansion.Conjunction' ([  1.47566240e-07   9.94954465e-01   3.19906254e-03   7.14073713e-04
   8.10951458e-05   3.70040215e-05   6.02704588e-04   1.68588885e-04
   4.50398555e-06   1.43749697e-04   5.27503361e-05   2.82198675e-06
   2.53751677e-05   3.00824780e-07   1.22490119e-05   7.39113714e-07
   3.32532323e-07   2.54237586e-09   2.97289552e-08   1.41387990e-09
   3.86095516e-10   2.27158469e-09])
fallback 37888 to 'Expansion.Conjunction' ([  1.69564519e-05   5.37195092e-01   2.02244701e-01   6.37953214e-02
   4.46997141e-02   4.01988518e-02   3.43314823e-02   2.81484726e-02
   1.56657437e-02   1.94566550e-02   5.23812283e-03   2.33150579e-03
   3.23474760e-03   8.51918952e-04   1.93362185e-03   3.72084735e-04
   2.35817456e-04   6.59937139e-06   1.81785583e-05   9.21870297e-06
   8.80242178e-06   6.39121442e-06])
fallback 37799 to 'Expansion.Conjunction' ([  1.26234936e-05   8.29524371e-01   9.35080990e-02   2.28163574e-02
   6.42716957e-03   3.37553456e-03   2.79096412e-02   6.65374824e-03
   5.80820818e-04   4.69689615e-03   2.19483154e-03   3.58316017e-04
   1.03594429e-03   9.81977833e-05   6.59251506e-04   1.00986454e-04
   3.80582993e-05   1.46184409e-06   5.60163044e-06   6.15854825e-07
   5.00119013e-07   9.73096317e-07])
fallback 39066 to 'Expansion.Conjunction' ([  3.80826714e-05   3.46042101e-01   3.08713559e-01   7.35280896e-02
   5.96596569e-02   3.84535757e-02   7.38514746e-02   3.88753456e-02
   1.32371673e-02   2.63824261e-02   7.10446164e-03   3.97899845e-03
   4.42479929e-03   1.30449714e-03   3.47357876e-03   5.53263999e-04
   3.00547490e-04   1.61177179e-05   2.71018493e-05   1.01404995e-05
   1.55746422e-05   9.43941826e-06])
fallback 37492 to 'Expansion.Conjunction' ([  3.34442957e-05   3.76686209e-01   2.87326420e-01   7.28301170e-02
   5.99974495e-02   4.08930883e-02   6.36623342e-02   3.76714871e-02
   1.47390093e-02   2.58070766e-02   6.85406278e-03   3.79819323e-03
   4.26080443e-03   1.28673422e-03   3.25447222e-03   5.20520602e-04
   3.04378331e-04   1.38189332e-05   2.60479060e-05   1.04488698e-05
   1.47121297e-05   9.17089694e-06])
fallback 38649 to 'Expansion.Conjunction' ([  1.49755266e-07   9.94706374e-01   3.37913487e-03   7.29282664e-04
   8.90150243e-05   4.01324316e-05   6.20484632e-04   1.77587379e-04
   5.06240567e-06   1.55177765e-04   5.42135885e-05   3.02368739e-06
   2.62152021e-05   3.22553711e-07   1.26687225e-05   7.70163112e-07
   3.47753734e-07   2.68212181e-09   3.00552040e-08   1.54650956e-09
   4.25844935e-10   2.36175120e-09])
fallback 37830 to 'Expansion.Conjunction' ([  5.23882363e-06   7.70320699e-01   1.03761619e-01   3.42418247e-02
   1.83883697e-02   2.09759805e-02   1.53592747e-02   1.28891959e-02
   7.76844224e-03   1.00565616e-02   2.51689316e-03   8.31042284e-04
   1.62352968e-03   2.68695784e-04   7.26807558e-04   1.50943754e-04
   9.94800411e-05   1.69450399e-06   6.56252120e-06   3.06901160e-06
   2.10546428e-06   1.97035702e-06])
fallback 37387 to 'Expansion.Conjunction' ([  2.32382354e-05   4.38196449e-01   2.24546059e-01   8.25346109e-02
   6.06289168e-02   5.67991917e-02   3.78421320e-02   3.56741993e-02
   2.41675953e-02   2.15898435e-02   6.57760861e-03   2.80259083e-03
   4.03073754e-03   1.32314651e-03   2.36463196e-03   4.98320265e-04
   3.25580796e-04   1.01418063e-05   2.48915511e-05   1.51562607e-05
   1.46885495e-05   1.02700378e-05])
fallback 38499 to 'Expansion.Conjunction' ([  2.43700282e-09   9.98779617e-01   3.92760392e-04   8.81180332e-05
   1.34836318e-04   3.27154157e-04   2.29740568e-05   4.31097988e-05
   1.58553947e-04   2.84645327e-05   3.05076135e-06   4.12952014e-07
   1.49606689e-05   3.37245759e-07   5.07044626e-06   3.43434927e-07
   2.27228161e-07   1.54445016e-10   3.04184329e-09   2.27631563e-09
   3.53393989e-10   7.45972023e-10])
fallback 37593 to 'Expansion.Conjunction' ([  1.84737110e-06   8.21250548e-01   3.00073359e-02   1.48449240e-02
   2.03378478e-02   6.29203089e-02   3.78830680e-03   5.74857642e-03
   3.44477925e-02   2.87349472e-03   8.98514515e-04   2.94274502e-04
   1.20240286e-03   2.89852582e-04   8.32749696e-04   1.61066213e-04
   8.78570926e-05   6.06704184e-07   4.87860729e-06   3.12954645e-06
   1.70447854e-06   1.98033420e-06])
fallback 38915 to 'Expansion.Conjunction' ([  3.07361115e-05   4.22374663e-01   3.03730069e-01   6.13730770e-02
   3.67577893e-02   2.35810241e-02   7.99375768e-02   2.75901834e-02
   6.85354830e-03   2.12487149e-02   6.12650761e-03   2.74583998e-03
   3.43657423e-03   7.39071223e-04   2.77428304e-03   4.54538732e-04
   1.93096798e-04   1.25242349e-05   2.10438501e-05   5.05030763e-06
   8.19450447e-06   5.89382485e-06])
fallback 37310 to 'Expansion.Conjunction' ([  9.46552336e-06   8.72161899e-01   7.01680237e-02   1.76457515e-02
   4.56047603e-03   2.36162327e-03   2.08186780e-02   5.01665505e-03
   3.83024296e-04   3.51792564e-03   1.68842713e-03   2.40913090e-04
   7.80180423e-04   6.21671552e-05   4.83161290e-04   6.86623369e-05
   2.70213524e-05   8.92241731e-07   3.76638934e-06   3.92279690e-07
   2.81019956e-07   6.13168008e-07])
fallback 37814 to 'Expansion.Conjunction' ([  4.59471194e-05   4.61221195e-01   2.66683582e-01   6.82161758e-02
   2.91484785e-02   1.86707063e-02   9.40534709e-02   2.42601618e-02
   4.07198450e-03   1.61668884e-02   6.73842626e-03   2.29127243e-03
   4.01415076e-03   8.64313986e-04   2.68493573e-03   5.81472364e-04
   2.09711568e-04   1.57870929e-05   3.77316179e-05   5.43815039e-06
   8.37508844e-06   9.79471147e-06])
fallback 38705 to 'Expansion.Conjunction' ([  4.22849735e-05   5.08717280e-01   2.40424863e-01   6.38979426e-02
   2.60642739e-02   1.67202664e-02   8.69667871e-02   2.27638233e-02
   3.36580967e-03   1.49301266e-02   6.24823547e-03   1.90388008e-03
   4.05930666e-03   7.74178393e-04   2.35923115e-03   5.02970109e-04
   1.93516164e-04   1.30641024e-05   3.26632932e-05   4.59853146e-06
   6.44208489e-06   8.45697710e-06])
fallback 38638 to 'Expansion.Conjunction' ([  2.73009009e-05   4.54795777e-01   2.86356448e-01   5.73623477e-02
   3.58899198e-02   2.29627918e-02   7.31082706e-02   2.65973731e-02
   6.70316301e-03   2.08874829e-02   5.69737096e-03   2.51400237e-03
   3.30337625e-03   6.78702780e-04   2.48375651e-03   4.05271886e-04
   1.80862902e-04   1.06138268e-05   1.82027033e-05   4.66759728e-06
   7.11585015e-06   5.18159912e-06])
fallback 38620 to 'Expansion.Conjunction' ([  5.33674665e-06   9.24846569e-01   4.16279873e-02   1.06654146e-02
   2.40318449e-03   1.17745329e-03   1.21763011e-02   2.91981891e-03
   1.72997763e-04   2.07403065e-03   1.00066185e-03   1.12351486e-04
   4.76259757e-04   2.80128346e-05   2.63417745e-04   3.33201053e-05
   1.41666621e-05   3.61011181e-07   1.82371226e-06   1.65421138e-07
   9.56867204e-08   2.69776245e-07])
fallback 38643 to 'Expansion.Conjunction' ([  1.69665273e-05   7.57695627e-01   1.33217650e-01   3.18612461e-02
   9.79814880e-03   5.53667740e-03   3.79671572e-02   9.63028628e-03
   1.10716456e-03   6.70634453e-03   3.10474173e-03   6.24525603e-04
   1.34193608e-03   1.55866585e-04   1.00895135e-03   1.54670287e-04
   5.79471280e-05   2.55336208e-06   7.99216299e-06   1.05890821e-06
   1.03271977e-06   1.45578908e-06])
fallback 38808 to 'Expansion.Conjunction' ([  1.65100355e-05   5.90031677e-01   2.34728811e-01   3.75454906e-02
   2.46696264e-02   1.30042553e-02   5.23283178e-02   1.75261179e-02
   3.70766940e-03   1.67359931e-02   3.69534591e-03   1.30243807e-03
   2.45883429e-03   4.00304935e-04   1.48130730e-03   2.41705709e-04
   1.02177232e-04   5.08091847e-06   1.02375687e-05   2.33121111e-06
   2.92224055e-06   2.84670929e-06])
fallback 38401 to 'Expansion.Conjunction' ([  9.10117492e-08   9.96488162e-01   2.25454594e-03   4.92788157e-04
   5.14537428e-05   2.34140773e-05   4.05216156e-04   1.15002077e-04
   2.76605376e-06   1.02574596e-04   3.53344479e-05   1.73359366e-06
   1.77793264e-05   1.68603266e-07   8.28643722e-06   4.61630126e-07
   2.00556146e-07   1.33505075e-09   1.82366124e-08   7.43941248e-10
   1.86853062e-10   1.26976863e-09])
fallback 38115 to 'Expansion.Conjunction' ([  1.32930008e-05   4.98376154e-01   1.26397608e-01   6.38852111e-02
   7.04872003e-02   1.12367107e-01   1.94447653e-02   2.46903390e-02
   5.80168582e-02   1.24536472e-02   4.23883315e-03   1.62160814e-03
   3.50090368e-03   1.51215538e-03   2.08430199e-03   5.08015503e-04
   3.29198282e-04   6.44936372e-06   2.23995027e-05   1.78629523e-05
   1.38277544e-05   1.22609270e-05])
fallback 38640 to 'Expansion.Conjunction' ([  1.35506580e-05   5.08646018e-01   1.37809725e-01   6.61605456e-02
   6.65185087e-02   9.81376780e-02   2.10957958e-02   2.54617858e-02
   4.89112331e-02   1.33633531e-02   4.43132646e-03   1.69356111e-03
   3.47053846e-03   1.41409239e-03   2.00546908e-03   4.80214489e-04
   3.17973962e-04   6.45658937e-06   2.15724124e-05   1.64519481e-05
   1.29761185e-05   1.11729998e-05])
fallback 37749 to 'Expansion.Conjunction' ([  3.00011070e-05   3.64061145e-01   2.53779172e-01   8.96497290e-02
   7.17698630e-02   6.23064522e-02   4.63368965e-02   4.07535134e-02
   2.64429952e-02   2.39151007e-02   7.37609804e-03   3.43722848e-03
   4.50090829e-03   1.66335689e-03   2.93244420e-03   5.76178832e-04
   3.77258080e-04   1.38023442e-05   2.91435880e-05   1.70711773e-05
   1.91668040e-05   1.24752896e-05])
fallback 38300 to 'Expansion.Conjunction' ([  3.08393805e-06   7.65289108e-01   3.09013903e-02   1.47935614e-02
   2.68004977e-02   8.28514077e-02   4.21716495e-03   6.52077591e-03
   6.03546522e-02   3.18143695e-03   1.02461313e-03   3.87483557e-04
   1.57007338e-03   3.92705745e-04   1.32340399e-03   2.60629248e-04
   1.09228841e-04   9.02688418e-07   6.39707952e-06   5.42221810e-06
   3.06255143e-06   2.99879449e-06])
fallback 38422 to 'Expansion.Conjunction' ([  3.95267416e-05   3.10888735e-01   2.93974099e-01   8.64766456e-02
   7.54239105e-02   5.48010724e-02   6.23616012e-02   4.35616780e-02
   2.18567418e-02   2.67915258e-02   7.86322534e-03   4.43564677e-03
   4.76601017e-03   1.81696236e-03   3.81559270e-03   6.30538672e-04
   3.94966013e-04   1.79145080e-05   3.30315267e-05   1.55397282e-05
   2.20172585e-05   1.30196284e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175484.ba+   1734292K    921031K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175484     rnn-rando+          2                         00:02:22      0:0 

Job 16175484 ("rnn-random-vectors") completed on c31-8 at tor dec 15 13:19:04 CET 2016
