Starting job 16175465 ("rnn-cbow-googlenews") on c15-24 at tor dec 15 13:04:50 CET 2016
Python environment is set up
Copying files to /work/jobs/16175465.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175465.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16175465.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt
MODEL_PATH: /work/jobs/16175465.d/models/rnn-cbow-googlenews/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175465.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:06] configuration (/work/jobs/16175465.d/models/rnn-cbow-googlenews/)
[2016-12-15 13:06]     config 'epochs': 200 (1000)
[2016-12-15 13:06]     config 'epochs_len': -1 (-1)
[2016-12-15 13:06]     config 'epochs_patience': 10 (20)
[2016-12-15 13:06]     config 'batch_size':  (64)
[2016-12-15 13:06]     config 'snapshot_size':  (2048)
[2016-12-15 13:06]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:06]     config 'words_dim': 20.0 (20)
[2016-12-15 13:06]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:06]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:06]     config 'final_dim': 40.0 (100)
[2016-12-15 13:06]     config 'arg1_len':  (100)
[2016-12-15 13:06]     config 'arg2_len':  (100)
[2016-12-15 13:06]     config 'conn_len':  (10)
[2016-12-15 13:06]     config 'punc_len':  (2)
[2016-12-15 13:06]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:06]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:06]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:06]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:06]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:06]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:06]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:06]     config 'words2vec_bin': None (None)
[2016-12-15 13:06]     config 'words2vec_txt': /work/jobs/16175465.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt (None)
[2016-12-15 13:06]   args.lang: en
[2016-12-15 13:06]   args.model_dir: /work/jobs/16175465.d/models/rnn-cbow-googlenews/
[2016-12-15 13:06]   args.dataset_dir: /work/jobs/16175465.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-15 13:06]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll16st-en-03-29-16-dev/
[2016-12-15 13:06]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:06]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:06]   filter_types: None
[2016-12-15 13:06]   filter_senses: None
[2016-12-15 13:06]   filter_fn_name: conn_gt_0
[2016-12-15 13:06]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175465.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:06] load dataset for prediction (/work/jobs/16175465.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:06] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-15 13:06]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:06] build model
[2016-12-15 13:07]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:07]     config 'optimizer':  (adam)
[2016-12-15 13:07] previous weights (/work/jobs/16175465.d/models/rnn-cbow-googlenews/)
[2016-12-15 13:07] convert from dataset (/work/jobs/16175465.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:07] make predictions
[2016-12-15 13:08] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll16st-en-03-29-16-dev/)
/work/jobs/16175465.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 36919 to 'Expansion.Conjunction' ([  4.42894702e-07   8.52718330e-01   3.41951018e-02   1.99694833e-02
   3.68732912e-02   1.58344372e-02   4.40736662e-03   1.29564839e-02
   1.48988828e-02   4.05298069e-03   4.82426914e-04   5.25595548e-04
   9.37876848e-04   9.11962449e-04   3.82926799e-04   7.70469932e-04
   4.22462424e-05   1.35494180e-05   3.74164382e-06   3.77260848e-06
   1.22964553e-05   6.33484188e-06])
fallback 36611 to 'Expansion.Conjunction' ([  2.35869197e-06   3.65742713e-01   2.84410923e-01   2.10682794e-01
   2.24134586e-02   2.17880271e-02   2.00869068e-02   3.88992130e-02
   2.99684121e-03   2.23340839e-02   3.09183960e-03   1.09377107e-03
   2.98202340e-03   4.33995650e-04   1.66869955e-03   1.17500708e-03
   1.69033199e-04   2.06801742e-05   8.02060809e-07   3.70334464e-06
   1.62699541e-06   1.49865832e-06])
fallback 35791 to 'Expansion.Conjunction' ([  1.44897899e-06   4.48216227e-01   1.21397338e-01   7.29961986e-02
   1.18649296e-01   6.02785419e-02   2.28634829e-02   5.50348233e-02
   6.37590806e-02   1.76334790e-02   2.21390834e-03   2.71121713e-03
   4.17868324e-03   4.08422385e-03   2.73804644e-03   2.92384739e-03
   2.02315494e-04   3.54568217e-05   1.31521200e-05   1.52544852e-05
   3.09676541e-05   2.30115400e-05])
fallback 36262 to 'Expansion.Conjunction' ([  1.00420698e-06   4.09709419e-01   1.78417010e-01   9.78592474e-02
   9.93030730e-02   5.17017351e-02   2.66845801e-02   5.53016433e-02
   3.89510985e-02   2.40488888e-02   2.19379037e-03   2.96700370e-03
   4.44887154e-03   2.30788157e-03   3.40858540e-03   2.49466297e-03
   1.40550923e-04   2.09081515e-05   5.99890693e-06   9.11986525e-06
   1.28208538e-05   1.21066203e-05])
fallback 36212 to 'Expansion.Conjunction' ([  4.72017427e-06   6.06799953e-01   1.69030202e-01   1.36442093e-01
   1.36885530e-02   1.09338051e-02   1.31837975e-02   2.43633778e-02
   1.07543029e-03   1.72931773e-02   2.48912044e-03   6.80807038e-04
   1.93242202e-03   2.09668008e-04   9.54087812e-04   7.29835700e-04
   1.56557316e-04   2.49414749e-05   9.42847168e-07   3.62835904e-06
   1.69312089e-06   1.18636022e-06])
fallback 36920 to 'Expansion.Conjunction' ([  2.60150273e-07   9.77931187e-01   9.70427305e-03   9.44141751e-03
   3.69765965e-04   3.24191608e-04   3.72115779e-04   1.09149118e-03
   9.79504316e-06   5.92359450e-04   6.73418171e-05   8.48026581e-06
   3.97717516e-05   1.14734006e-06   1.13052918e-05   2.94054640e-05
   5.10531065e-06   5.05694224e-07   1.34551071e-08   3.88407843e-08
   2.26348519e-08   4.95984668e-09])
fallback 36284 to 'Expansion.Conjunction' ([  3.98502880e-06   2.35402704e-01   9.87965391e-02   7.44671152e-02
   1.77520052e-01   1.25035361e-01   2.97734067e-02   7.09800870e-02
   1.43368125e-01   1.40146679e-02   3.30754021e-03   3.10535124e-03
   4.85244580e-03   1.08263455e-02   3.63128027e-03   4.03254014e-03
   5.89528005e-04   1.03813080e-04   3.71422030e-05   3.25515612e-05
   7.47842861e-05   4.46354680e-05])
fallback 36254 to 'Expansion.Conjunction' ([  1.48301524e-06   8.94071377e-01   4.39190182e-02   3.98415987e-02
   3.17404714e-03   2.82624543e-03   3.21471916e-03   7.08685797e-03
   1.54131248e-04   4.28564882e-03   5.29866186e-04   1.08267156e-04
   3.36960764e-04   2.09338754e-05   1.68788432e-04   2.13045461e-04
   4.02949180e-05   5.67815126e-06   1.72313629e-07   4.74538796e-07
   2.64228213e-07   1.27527724e-07])
fallback 36222 to 'Expansion.Conjunction' ([  2.61805209e-08   9.98347616e-01   6.71005500e-04   8.47183496e-04
   1.67255599e-05   1.28381386e-05   1.75157525e-05   5.69960925e-05
   1.25082661e-07   2.29373703e-05   3.64641246e-06   2.28214839e-07
   1.33461455e-06   1.57544232e-08   1.56222935e-07   1.34560670e-06
   2.80085964e-07   2.10386423e-08   5.59849875e-10   1.51235598e-09
   1.10644635e-09   6.79334281e-11])
fallback 36213 to 'Expansion.Conjunction' ([  3.23431919e-07   9.72373293e-01   1.20635450e-02   1.16503172e-02
   4.96469140e-04   4.42365207e-04   5.17187167e-04   1.43829137e-03
   1.40182927e-05   7.85769535e-04   9.01826703e-05   1.20009034e-05
   5.24855161e-05   1.68429231e-06   1.61430978e-05   3.86284986e-05
   6.50947586e-06   6.78196263e-07   1.83963828e-08   5.18175007e-08
   3.00392453e-08   7.54006003e-09])
fallback 36362 to 'Expansion.Conjunction' ([  9.74097070e-09   9.99063023e-01   3.78952801e-04   4.57982914e-04
   2.03276488e-05   1.47076208e-05   5.49376186e-06   3.73248152e-05
   4.39392128e-07   1.67873587e-05   1.64512893e-06   1.44175929e-07
   1.56612499e-06   2.89312345e-08   2.20848166e-07   9.70179151e-07
   3.35215222e-07   3.58881247e-08   4.90768763e-10   1.46427382e-09
   2.81125414e-09   1.58696321e-10])
fallback 35802 to 'Expansion.Conjunction' ([  2.05884271e-06   4.28486529e-01   1.02770821e-01   6.72883693e-02
   1.29765899e-01   6.98849265e-02   2.22636053e-02   5.95076498e-02
   8.20172285e-02   1.62510742e-02   2.36479497e-03   2.80847402e-03
   4.29980646e-03   5.75528018e-03   2.73783693e-03   3.33067823e-03
   2.79811766e-04   5.21487603e-05   2.35223526e-05   2.19423747e-05
   5.22536069e-05   3.52895952e-05])
fallback 36838 to 'Expansion.Conjunction' ([  1.74244940e-06   2.61831877e-01   1.47522895e-01   9.42060863e-02
   1.56117706e-01   8.94732764e-02   3.48499041e-02   7.46927477e-02
   9.12454268e-02   2.26836761e-02   3.30055176e-03   3.72676501e-03
   5.50433196e-03   6.78427370e-03   3.77287665e-03   3.87103572e-03
   2.72018716e-04   4.64034815e-05   1.59289864e-05   1.76828033e-05
   3.22050070e-05   3.05888604e-05])
fallback 36017 to 'Expansion.Conjunction' ([  5.56253887e-08   9.95411965e-01   1.92864339e-03   2.11053685e-03
   7.52800677e-05   6.62151342e-05   8.59170372e-05   2.15239948e-04
   7.88892897e-07   8.13696948e-05   1.17732131e-05   1.35854517e-06
   3.74283071e-06   9.74220997e-08   9.84493427e-07   5.24436868e-06
   7.14181263e-07   6.26193693e-08   2.12000056e-09   4.94099148e-09
   3.29898277e-09   4.94443861e-10])
fallback 36070 to 'Expansion.Conjunction' ([  1.42471902e-06   1.87199116e-01   1.71802089e-01   1.07613996e-01
   1.65749878e-01   9.86057148e-02   4.19408679e-02   8.05934668e-02
   9.17920992e-02   2.53598988e-02   3.79344216e-03   4.15153895e-03
   5.90071595e-03   6.97381469e-03   4.25574277e-03   3.90625885e-03
   2.49149074e-04   3.75507552e-05   1.12163762e-05   1.45922959e-05
   2.11979568e-05   2.62298090e-05])
fallback 35923 to 'Expansion.Conjunction' ([  2.30610613e-06   7.71895870e-01   1.04370689e-01   8.23772310e-02
   6.54856475e-03   5.32565628e-03   5.13938246e-03   1.18093125e-02
   4.60156900e-04   8.94762744e-03   1.05677881e-03   2.33972280e-04
   9.32358245e-04   7.49552550e-05   3.95604256e-04   3.38399078e-04
   7.59680828e-05   1.25202839e-05   2.99678754e-07   1.31518809e-06
   6.80708511e-07   3.51545445e-07])
fallback 36788 to 'Expansion.Conjunction' ([  2.48452648e-06   3.13977057e-01   1.17860717e-01   7.99804165e-02
   1.52241316e-01   8.87501595e-02   2.89121041e-02   7.16146962e-02
   9.96506567e-02   1.92902960e-02   3.02521483e-03   3.49191034e-03
   5.30286123e-03   7.87309728e-03   3.45943838e-03   3.99738310e-03
   3.51380928e-04   6.64277964e-05   2.76808000e-05   2.51820088e-05
   5.67079067e-05   4.28113700e-05])
fallback 36651 to 'Expansion.Conjunction' ([  1.43761753e-07   9.59431049e-01   6.21391738e-03   3.99304506e-03
   1.31333461e-02   5.57641404e-03   8.70481422e-04   3.55077534e-03
   5.61320547e-03   6.79804709e-04   1.07054707e-04   1.04493840e-04
   1.80179194e-04   2.86136404e-04   4.59773581e-05   1.85259254e-04
   9.22502019e-06   6.87954705e-06   1.65492508e-06   1.16146304e-06
   7.12638755e-06   2.66921165e-06])
fallback 36214 to 'Expansion.Conjunction' ([  1.98203942e-08   9.98805288e-01   4.86327511e-04   6.12101229e-04
   1.30237004e-05   9.59661250e-06   9.69968281e-06   4.04041713e-05
   1.29956348e-07   1.80263488e-05   2.49065693e-06   1.39759877e-07
   1.29962882e-06   1.35713032e-08   1.31893387e-07   1.01750766e-06
   2.63996044e-07   2.32870524e-08   4.56444245e-10   1.32226985e-09
   1.16890409e-09   5.93573734e-11])
fallback 35749 to 'Expansion.Conjunction' ([  1.39634687e-06   4.45678384e-01   1.25935406e-01   7.48074131e-02
   1.17511571e-01   5.95058987e-02   2.32369602e-02   5.47920541e-02
   6.13928551e-02   1.80565287e-02   2.21569976e-03   2.73421617e-03
   4.23244015e-03   3.91623612e-03   2.79210276e-03   2.88413000e-03
   1.95690635e-04   3.40069092e-05   1.21053154e-05   1.45590266e-05
   2.86481064e-05   2.16980607e-05])
fallback 36502 to 'Expansion.Conjunction' ([  8.60710315e-07   5.66920743e-01   1.46875050e-01   8.30788367e-02
   6.23733497e-02   3.33263344e-02   1.63819748e-02   4.01040268e-02
   2.06657307e-02   1.84954065e-02   1.53366309e-03   1.84208650e-03
   3.12872875e-03   1.22621571e-03   2.25622480e-03   1.63803443e-03
   1.11642400e-04   1.47969364e-05   3.86988621e-06   6.86884305e-06
   8.76856734e-06   6.78737461e-06])
fallback 37106 to 'Expansion.Conjunction' ([  1.64342441e-06   6.44326558e-01   5.37147142e-02   3.74328265e-02
   8.78374415e-02   4.86288995e-02   1.14025286e-02   3.70290274e-02
   5.84441899e-02   8.32002598e-03   1.34028737e-03   1.54578416e-03
   2.46263501e-03   3.87572165e-03   1.21015262e-03   2.06981480e-03
   1.84145375e-04   4.85253069e-05   2.23208823e-05   1.56568492e-05
   5.76507364e-05   2.94501711e-05])
fallback 36080 to 'Expansion.Conjunction' ([  1.89519494e-11   9.99839042e-01   8.55495069e-06   5.83807726e-06
   9.01393045e-05   3.52774468e-05   6.94149190e-07   5.88107772e-06
   1.39795317e-05   1.35109598e-07   6.48963178e-08   2.06076395e-08
   6.98282587e-08   1.64265610e-07   5.09877416e-09   1.18816541e-07
   6.37551551e-09   6.81063899e-09   1.23331203e-10   6.16818039e-11
   1.18813256e-09   4.56261767e-10])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175465.ba+   1652436K    831798K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175465     rnn-cbow-+          2                         00:04:16      0:0 

Job 16175465 ("rnn-cbow-googlenews") completed on c15-24 at tor dec 15 13:09:00 CET 2016
