Starting job 16175458 ("rnn-glove-wikipedia") on c17-18 at tor dec 15 13:02:48 CET 2016
Python environment is set up
Copying files to /work/jobs/16175458.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175458.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
EMBEDDING_PATH: /work/jobs/16175458.d/resources//word_embeddings/precompiled/glove/size=50.embeddings
MODEL_PATH: /work/jobs/16175458.d/models/rnn-glove-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll15st-en-03-29-16-blind-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175458.d/resources//word_embeddings/precompiled/glove/size=50.embeddings", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:04] configuration (/work/jobs/16175458.d/models/rnn-glove-wikipedia/)
[2016-12-15 13:04]     config 'epochs': 200 (1000)
[2016-12-15 13:04]     config 'epochs_len': -1 (-1)
[2016-12-15 13:04]     config 'epochs_patience': 10 (20)
[2016-12-15 13:04]     config 'batch_size':  (64)
[2016-12-15 13:04]     config 'snapshot_size':  (2048)
[2016-12-15 13:04]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:04]     config 'words_dim': 20.0 (20)
[2016-12-15 13:04]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:04]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:04]     config 'final_dim': 40.0 (100)
[2016-12-15 13:04]     config 'arg1_len':  (100)
[2016-12-15 13:04]     config 'arg2_len':  (100)
[2016-12-15 13:04]     config 'conn_len':  (10)
[2016-12-15 13:04]     config 'punc_len':  (2)
[2016-12-15 13:04]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:04]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:04]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:04]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:04]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:04]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:04]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:04]     config 'words2vec_bin': None (None)
[2016-12-15 13:04]     config 'words2vec_txt': /work/jobs/16175458.d/resources//word_embeddings/precompiled/glove/size=50.embeddings (None)
[2016-12-15 13:04]   args.lang: en
[2016-12-15 13:04]   args.model_dir: /work/jobs/16175458.d/models/rnn-glove-wikipedia/
[2016-12-15 13:04]   args.dataset_dir: /work/jobs/16175458.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
[2016-12-15 13:04]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll15st-en-03-29-16-blind-test/
[2016-12-15 13:04]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:04]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:04]   filter_types: None
[2016-12-15 13:04]   filter_senses: None
[2016-12-15 13:04]   filter_fn_name: conn_gt_0
[2016-12-15 13:04]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175458.d/resources//word_embeddings/precompiled/glove/size=50.embeddings', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:04] load dataset for prediction (/work/jobs/16175458.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:04] lang: ?, doc_ids: 71, words: 34621, rel_ids: 625, relation tokens: 25754
[2016-12-15 13:04]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:04] build model
[2016-12-15 13:04]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:04]     config 'optimizer':  (adam)
[2016-12-15 13:05] previous weights (/work/jobs/16175458.d/models/rnn-glove-wikipedia/)
[2016-12-15 13:05] convert from dataset (/work/jobs/16175458.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:05] make predictions
[2016-12-15 13:06] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll15st-en-03-29-16-blind-test/)
/work/jobs/16175458.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 565 to 'Expansion.Conjunction' ([  8.92188368e-09   9.95133682e-01   1.51289007e-03   1.65058996e-04
   1.38355754e-03   5.01973081e-04   6.87448326e-05   7.23760374e-05
   1.08402046e-03   3.14100502e-05   2.66522120e-06   3.93504518e-06
   1.48668303e-05   1.97308347e-06   1.94078017e-05   2.01559416e-06
   1.31613431e-06   2.77665903e-08   9.18320960e-09   3.37591922e-08
   1.77293803e-08   1.01917362e-08])
fallback 119 to 'Expansion.Conjunction' ([  1.62952676e-06   3.15908726e-01   2.57077184e-01   1.40346287e-01
   7.18624061e-02   2.72720173e-02   8.03112675e-02   5.11493751e-02
   1.87358612e-02   1.35260129e-02   5.05773624e-03   4.72201587e-03
   6.47247481e-03   8.18005345e-04   4.73283644e-03   1.68182361e-03
   2.63187827e-04   1.93801295e-05   7.16993090e-06   1.23742182e-05
   1.37146024e-05   8.51430730e-06])
fallback 602 to 'Expansion.Conjunction' ([  7.64185188e-07   7.27133222e-01   9.22997231e-02   6.92003824e-02
   2.43232402e-02   5.83810412e-03   3.76631584e-02   2.38929487e-02
   4.20408840e-03   5.30115707e-03   2.28158946e-03   3.42023888e-03
   1.85454429e-03   2.42184806e-04   1.43345109e-03   6.10220543e-04
   2.52598405e-04   2.18551616e-05   3.44463869e-06   1.20895885e-05
   6.54836238e-06   4.44616221e-06])
fallback 696 to 'Expansion.Conjunction' ([  5.38166915e-08   9.62057718e-01   1.47375307e-02   1.08133062e-02
   3.04130328e-03   5.08617439e-04   4.04835356e-03   2.76687883e-03
   4.91916439e-04   5.94842544e-04   1.67948472e-04   2.72539417e-04
   2.09693668e-04   9.09281342e-06   2.14126836e-04   3.60329398e-05
   2.56708847e-05   1.98055342e-06   2.89883419e-07   1.23332064e-06
   5.40897365e-07   3.29959110e-07])
fallback 334 to 'Expansion.Conjunction' ([  2.13036544e-09   9.98483017e-01   5.75212771e-04   5.61065049e-04
   9.88305343e-05   9.72311151e-06   1.19198850e-04   9.69215704e-05
   1.05390083e-05   2.30211557e-05   3.56267134e-06   6.80106915e-06
   4.67880189e-06   7.72551812e-08   5.60357066e-06   5.14402992e-07
   1.03592073e-06   1.09551132e-07   5.15695272e-09   5.86664664e-08
   1.32079567e-08   8.18300640e-09])
fallback 241 to 'Expansion.Conjunction' ([  3.47659949e-07   8.74536644e-01   3.44273750e-02   6.39166597e-03
   2.72287748e-02   1.66380370e-02   2.56287822e-03   3.48339001e-03
   3.18132196e-02   1.17176912e-03   2.04109473e-04   1.82421385e-04
   5.80940053e-04   1.17478341e-04   5.41967346e-04   8.48291393e-05
   2.79692525e-05   1.03572382e-06   6.66445836e-07   2.34014217e-06
   1.64117968e-06   5.00434573e-07])
fallback 707 to 'Expansion.Conjunction' ([  1.81994988e-08   9.85951805e-01   4.87653504e-03   4.79076628e-03
   1.07743617e-03   1.23130364e-04   1.52432631e-03   1.03452315e-03
   1.16887185e-04   2.06720613e-04   4.47315080e-05   1.15981328e-04
   5.24724722e-05   2.10422200e-06   5.90391115e-05   1.07544559e-05
   1.07709514e-05   1.08531142e-06   6.44683255e-08   5.86335957e-07
   1.65515392e-07   9.63445027e-08])
fallback 694 to 'Expansion.Conjunction' ([  5.49613617e-08   9.70577482e-01   8.36190677e-03   1.16582914e-03
   7.33473341e-03   3.58955633e-03   4.77165742e-04   5.67802696e-04
   7.40392695e-03   2.10131097e-04   2.54059033e-05   2.93243721e-05
   1.08340283e-04   1.71832326e-05   1.10705129e-04   1.35054352e-05
   6.16862009e-06   1.60700538e-07   7.50679947e-08   2.97408065e-07
   1.76038640e-07   6.92040276e-08])
fallback 609 to 'Expansion.Conjunction' ([  5.11248066e-09   9.97124201e-01   8.80835466e-04   8.55565600e-05
   8.61305283e-04   2.89369231e-04   3.65916496e-05   3.72633587e-05
   6.42730800e-04   1.66494611e-05   1.22560437e-06   2.08909206e-06
   8.34538610e-06   1.01858598e-06   1.08920359e-05   1.05352945e-06
   8.17836512e-07   1.46151367e-08   4.54370943e-09   1.72176194e-08
   8.43637254e-09   5.47293636e-09])
fallback 740 to 'Expansion.Conjunction' ([  1.71901354e-06   5.90681081e-01   1.01372809e-01   2.56131107e-02
   7.90707326e-02   5.78003679e-02   1.00731040e-02   1.62796882e-02
   1.06509888e-01   4.82119344e-03   1.11697906e-03   8.41096574e-04
   2.50967128e-03   6.76699745e-04   2.05331158e-03   4.45052752e-04
   9.50542533e-05   5.41419654e-06   4.37319117e-06   1.38900242e-05
   1.14359783e-05   3.32812604e-06])
fallback 404 to 'Expansion.Conjunction' ([  4.80895835e-07   7.71207861e-01   8.47825101e-02   5.69461988e-02
   2.03704068e-02   5.18415118e-03   2.78730855e-02   1.82144118e-02
   4.05589161e-03   4.13827920e-03   1.46213580e-03   1.94479861e-03
   1.70769401e-03   1.46609075e-04   1.39176693e-03   4.03320907e-04
   1.40198941e-04   1.26287021e-05   2.44260693e-06   7.53931764e-06
   4.47404313e-06   3.11465211e-06])
fallback 920 to 'Expansion.Conjunction' ([  1.91835492e-10   9.99613895e-01   1.38088990e-04   1.52729352e-04
   2.60578876e-05   1.76912138e-06   3.23381505e-05   2.46892363e-05
   2.20576956e-06   4.76467182e-06   5.33222881e-07   1.34499625e-06
   5.68219953e-07   8.99891285e-09   7.14337953e-07   5.74635920e-08
   2.08566877e-07   1.77932089e-08   3.99088823e-10   6.04278236e-09
   1.24319201e-09   7.87805387e-10])
fallback 135 to 'Expansion.Conjunction' ([  1.44427883e-08   9.87250688e-01   4.67528264e-03   4.22699937e-03
   9.56142207e-04   1.13210205e-04   1.32265687e-03   8.96940068e-04
   1.12734008e-04   1.83769895e-04   3.95634016e-05   9.21582689e-05
   5.08006452e-05   1.69236842e-06   5.81428359e-05   8.75245771e-06
   8.91202128e-06   7.97652207e-07   6.04826483e-08   4.56441883e-07
   1.43743790e-07   8.23289882e-08])
fallback 590 to 'Expansion.Conjunction' ([  1.52955454e-06   2.76537804e-01   2.61949806e-01   1.56132191e-01
   7.34415647e-02   2.73125450e-02   9.36150844e-02   5.46694544e-02
   1.72056015e-02   1.45167000e-02   5.16252962e-03   5.57394603e-03
   6.36496625e-03   9.03796691e-04   4.49796485e-03   1.75706960e-03
   2.91892850e-04   2.09470344e-05   7.14475979e-06   1.27667335e-05
   1.54644021e-05   9.23025341e-06])
fallback 593 to 'Expansion.Conjunction' ([  9.89533874e-07   6.67011859e-01   1.32045091e-01   7.08795639e-02
   3.29217465e-02   1.06733637e-02   3.41719651e-02   2.55194363e-02
   8.69773517e-03   6.24307340e-03   2.54362729e-03   2.28414057e-03
   3.18336907e-03   2.68921897e-04   2.61577266e-03   7.31234906e-04
   1.66974700e-04   1.49269545e-05   4.50774043e-06   1.05439804e-05
   6.55481656e-06   4.60231060e-06])
fallback 553 to 'Expansion.Conjunction' ([  7.16511989e-11   9.99940501e-01   1.30275774e-05   5.08325904e-07
   2.48402808e-05   5.25302168e-06   2.97842685e-07   2.24518129e-07
   1.49765426e-05   1.19504689e-07   2.58799289e-09   1.52365691e-08
   9.59489967e-08   6.00442354e-09   1.06421416e-07   6.16243892e-09
   1.91295403e-08   8.72102656e-11   1.98343388e-11   1.19478634e-10
   2.96453240e-11   4.71879508e-11])
fallback 137 to 'Expansion.Conjunction' ([  1.16476870e-10   9.99741353e-01   7.31610473e-05   1.26988755e-04
   1.47468578e-05   9.26507177e-07   2.09183577e-05   1.60620344e-05
   6.60994700e-07   3.33291534e-06   2.63214497e-07   9.55092993e-07
   2.53572602e-07   4.56240058e-09   2.28122753e-07   3.30973250e-08
   8.34409216e-08   2.20915636e-08   8.82614309e-11   5.70323509e-09
   4.05733882e-10   3.15655828e-10])
fallback 10 to 'Expansion.Conjunction' ([  5.75468349e-08   9.69420857e-01   8.84804974e-03   1.26096083e-03
   7.57656997e-03   3.68677548e-03   5.15143041e-04   6.08968669e-04
   7.52370810e-03   2.25803263e-04   2.77732563e-05   3.13280836e-05
   1.14816205e-04   1.82232508e-05   1.18981109e-04   1.47023467e-05
   6.44798915e-06   1.76148576e-07   8.09283597e-08   3.13908318e-07
   1.88781131e-07   7.43473839e-08])
fallback 715 to 'Expansion.Conjunction' ([  2.85035867e-06   2.93883026e-01   2.62702286e-01   8.53459314e-02
   1.06890991e-01   6.52054474e-02   3.75492200e-02   4.06203494e-02
   7.52676875e-02   1.32142501e-02   3.84140271e-03   2.33561383e-03
   6.37945067e-03   6.93579088e-04   4.43823310e-03   1.42400758e-03
   1.59128045e-04   5.63333788e-06   5.93491587e-06   1.28624743e-05
   1.78692590e-05   4.24523569e-06])
fallback 467 to 'Expansion.Conjunction' ([  2.16857325e-06   3.64706107e-01   2.03904782e-01   5.98746029e-02
   1.07603843e-01   7.50933678e-02   2.61591529e-02   3.24983343e-02
   1.05273651e-01   9.87088421e-03   2.42808559e-03   1.75378510e-03
   5.25986461e-03   7.14781709e-04   3.79022498e-03   8.92838365e-04
   1.28352610e-04   5.29213696e-06   4.97341817e-06   1.41998219e-05
   1.72355143e-05   3.47301928e-06])
fallback 311 to 'Expansion.Conjunction' ([  3.13053854e-11   9.99971464e-01   7.37956963e-06   1.43840436e-05
   1.82424926e-06   8.86182802e-08   2.18341123e-06   1.99445233e-06
   9.68309677e-08   3.90051303e-07   2.86773329e-08   9.39698395e-08
   2.34097332e-08   4.16765517e-10   2.21167212e-08   2.03694242e-09
   1.79961701e-08   5.25716944e-09   9.43118947e-12   1.13127542e-09
   6.43186971e-11   5.69493141e-11])
fallback 581 to 'Expansion.Conjunction' ([  3.06823779e-07   8.38911678e-01   5.94084095e-02   4.18555042e-02
   1.39832613e-02   3.17335138e-03   1.96610583e-02   1.27750443e-02
   2.57431165e-03   2.83402423e-03   9.53661482e-04   1.39040853e-03
   1.08976863e-03   8.53979826e-05   9.27437358e-04   2.49713871e-04
   1.05498405e-04   9.21014026e-06   1.57737718e-06   5.36430724e-06
   2.98412087e-06   2.02794383e-06])
fallback 840 to 'Expansion.Conjunction' ([  9.09295409e-07   5.90297808e-01   1.43081439e-01   1.00273548e-01
   3.75548743e-02   1.03557061e-02   5.60658862e-02   3.35099766e-02
   7.01548798e-03   7.94558958e-03   2.98486528e-03   4.13890595e-03
   2.95079238e-03   3.73806769e-04   2.24107966e-03   8.89275556e-04
   2.66048994e-04   2.20774087e-05   4.47803578e-06   1.23769239e-05
   9.11425543e-06   5.95435802e-06])
fallback 795 to 'Expansion.Conjunction' ([  3.36470339e-06   6.81001681e-01   1.32766206e-01   4.26601257e-02
   4.19901807e-02   2.16984587e-02   1.74271376e-02   2.01245831e-02
   2.33182187e-02   6.81661227e-03   2.99559146e-03   1.27824574e-03
   3.15852448e-03   2.45195092e-04   3.18343061e-03   1.12698661e-03
   1.59989843e-04   8.27328243e-06   8.33220041e-06   1.54567173e-05
   9.38303153e-06   4.02317629e-06])
fallback 87 to 'Expansion.Conjunction' ([  7.47174909e-07   8.22755235e-01   6.49155913e-02   1.60732366e-02
   3.12477655e-02   1.74203500e-02   6.43331618e-03   8.35505425e-03
   2.64346139e-02   2.70567561e-03   5.70709422e-04   4.18294579e-04
   1.10778820e-03   1.13018951e-04   1.13082936e-03   2.63101980e-04
   4.24436666e-05   2.01536868e-06   1.24439830e-06   4.76053229e-06
   3.30385394e-06   9.04363636e-07])
fallback 308 to 'Expansion.Conjunction' ([  3.20284577e-09   9.98605778e-01   3.97844382e-04   6.15783728e-04
   8.99646029e-05   7.40388206e-06   1.25830875e-04   1.07349005e-04
   6.54103490e-06   2.26391837e-05   3.22803586e-06   9.34743993e-06
   3.15105191e-06   9.06311674e-08   2.97254721e-06   5.17452060e-07
   1.19933394e-06   2.38963506e-07   2.96883981e-09   9.40791329e-08
   1.14705124e-08   8.29344407e-09])
fallback 354 to 'Expansion.Conjunction' ([  2.21090108e-11   9.99986779e-01   6.49947340e-06   3.70359935e-06
   1.28369619e-06   1.14691077e-07   5.45527547e-07   5.21269846e-07
   2.00121891e-07   2.13523509e-07   1.55555943e-08   2.98007755e-08
   2.43749326e-08   1.65148577e-10   5.89767921e-08   1.20718248e-09
   7.99414854e-09   5.21894311e-10   2.40619419e-11   4.35244706e-10
   9.44880226e-11   3.92959489e-11])
fallback 24 to 'Expansion.Conjunction' ([  1.24489854e-11   9.99989277e-01   1.88255320e-06   5.28041045e-08
   4.61213497e-06   1.01150363e-06   3.12314407e-08   2.41517918e-08
   3.06918152e-06   1.42750337e-08   2.04963603e-10   1.50483282e-09
   9.72567188e-09   6.80569993e-10   1.00408873e-08   5.02195122e-10
   2.81151082e-09   9.63489016e-12   2.21375784e-12   1.66325808e-11
   2.83798724e-12   6.46233027e-12])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175458.ba+   1628056K    825809K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175458     rnn-glove+          2                         00:03:51      0:0 

Job 16175458 ("rnn-glove-wikipedia") completed on c17-18 at tor dec 15 13:06:36 CET 2016
