Starting job 16175482 ("rnn-tscca-wikipedia") on c12-25 at tor dec 15 13:15:44 CET 2016
Python environment is set up
Copying files to /work/jobs/16175482.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175482.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16175482.d/resources//word_embeddings/precompiled/tscca/size=50.embeddings
MODEL_PATH: /work/jobs/16175482.d/models/rnn-tscca-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-tscca-wikipedia-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175482.d/resources//word_embeddings/precompiled/tscca/size=50.embeddings", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:16] configuration (/work/jobs/16175482.d/models/rnn-tscca-wikipedia/)
[2016-12-15 13:16]     config 'epochs': 200 (1000)
[2016-12-15 13:16]     config 'epochs_len': -1 (-1)
[2016-12-15 13:16]     config 'epochs_patience': 10 (20)
[2016-12-15 13:16]     config 'batch_size':  (64)
[2016-12-15 13:16]     config 'snapshot_size':  (2048)
[2016-12-15 13:16]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:16]     config 'words_dim': 20.0 (20)
[2016-12-15 13:16]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:16]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:16]     config 'final_dim': 40.0 (100)
[2016-12-15 13:16]     config 'arg1_len':  (100)
[2016-12-15 13:16]     config 'arg2_len':  (100)
[2016-12-15 13:16]     config 'conn_len':  (10)
[2016-12-15 13:16]     config 'punc_len':  (2)
[2016-12-15 13:16]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:16]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:16]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:16]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:16]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:16]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:16]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:16]     config 'words2vec_bin': None (None)
[2016-12-15 13:16]     config 'words2vec_txt': /work/jobs/16175482.d/resources//word_embeddings/precompiled/tscca/size=50.embeddings (None)
[2016-12-15 13:16]   args.lang: en
[2016-12-15 13:16]   args.model_dir: /work/jobs/16175482.d/models/rnn-tscca-wikipedia/
[2016-12-15 13:16]   args.dataset_dir: /work/jobs/16175482.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-15 13:16]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-tscca-wikipedia-conll16st-en-03-29-16-test/
[2016-12-15 13:16]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:16]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:16]   filter_types: None
[2016-12-15 13:16]   filter_senses: None
[2016-12-15 13:16]   filter_fn_name: conn_gt_0
[2016-12-15 13:16]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175482.d/resources//word_embeddings/precompiled/tscca/size=50.embeddings', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:16] load dataset for prediction (/work/jobs/16175482.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:16] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-15 13:16]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:16] build model
[2016-12-15 13:16]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:16]     config 'optimizer':  (adam)
[2016-12-15 13:17] previous weights (/work/jobs/16175482.d/models/rnn-tscca-wikipedia/)
[2016-12-15 13:17] convert from dataset (/work/jobs/16175482.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:17] make predictions
[2016-12-15 13:18] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-tscca-wikipedia-conll16st-en-03-29-16-test/)
/work/jobs/16175482.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 38115 to 'Expansion.Conjunction' ([  1.25107836e-05   6.97969926e-01   6.73998905e-02   3.83592032e-02
   7.02868862e-02   1.93569329e-02   1.94748718e-02   1.25666570e-02
   4.84915645e-02   9.64313298e-03   2.21665394e-03   1.81289125e-03
   3.74710730e-03   5.32054771e-03   7.24250581e-04   1.60557710e-03
   7.90396371e-04   7.81791983e-05   1.75428344e-05   6.61481039e-05
   2.80569098e-05   3.10724032e-05])
fallback 37310 to 'Expansion.Conjunction' ([  1.29170598e-06   7.85608306e-01   9.54288187e-02   7.16185807e-02
   1.24682153e-02   3.61115702e-03   8.34307369e-03   1.45501357e-02
   9.59132758e-04   4.08293408e-03   1.23875020e-03   8.21204464e-04
   3.80692312e-04   1.48689377e-04   1.20510080e-04   5.63043355e-04
   3.82457008e-05   3.89277791e-06   2.39749993e-06   3.48920668e-06
   6.13950226e-06   1.29961156e-06])
fallback 37149 to 'Expansion.Conjunction' ([  3.85115382e-05   1.90460075e-01   1.31084340e-01   7.08639486e-02
   1.75249535e-01   8.36986394e-02   4.48043616e-02   3.72980803e-02
   1.89094413e-01   2.34918357e-02   7.61576989e-03   5.92972769e-03
   9.27578955e-03   1.61195717e-02   4.67684222e-03   7.13677299e-03
   2.28688358e-03   2.27357047e-04   1.28547314e-04   2.25075438e-04
   1.74563163e-04   1.19358973e-04])
fallback 38300 to 'Expansion.Conjunction' ([  4.27536756e-10   9.91777132e-01   8.93507220e-04   3.30611601e-04
   3.49166783e-03   6.09462621e-04   1.02975960e-04   2.63858880e-04
   2.41308638e-03   5.97986006e-05   9.39763786e-06   2.22164342e-06
   1.17531000e-05   2.83790035e-05   8.27278776e-07   4.93507473e-06
   3.03711178e-07   3.54745143e-08   9.90403991e-10   2.64202067e-08
   1.03917098e-08   8.22776699e-09])
fallback 38226 to 'Expansion.Conjunction' ([  1.17719162e-06   7.14337419e-01   1.29176380e-01   8.93067656e-02
   1.85179639e-02   5.43953580e-03   1.18367059e-02   1.84812269e-02
   2.12575941e-03   6.27381643e-03   1.49874252e-03   1.15711174e-03
   5.68547993e-04   2.36553027e-04   2.24141233e-04   7.43283319e-04
   5.35987864e-05   4.77753936e-06   3.79359454e-06   4.80733850e-06
   6.12906124e-06   1.76341169e-06])
fallback 38499 to 'Expansion.Conjunction' ([  2.33367348e-09   9.97245560e-01   3.57523331e-04   1.26863598e-04
   1.26608777e-03   1.84375416e-04   3.92815931e-05   9.83962027e-05
   6.44241466e-04   1.89767963e-05   2.30742605e-06   9.96163645e-07
   3.55465366e-06   1.03507774e-05   1.21050563e-07   9.48214629e-07
   2.93011286e-07   6.15055959e-08   9.70044165e-10   4.05503439e-08
   5.27758331e-09   1.23061180e-08])
fallback 38649 to 'Expansion.Conjunction' ([  2.72973573e-08   9.90538172e-01   4.62254086e-03   3.62631932e-03
   3.60968374e-04   5.72169006e-05   2.15176389e-04   4.20710127e-04
   1.95035298e-05   9.93458444e-05   1.92196056e-05   7.84031174e-06
   4.47766521e-06   1.17393289e-06   5.34004125e-07   6.07318220e-06
   4.44750181e-07   3.86160540e-08   4.61604511e-08   9.49348325e-08
   6.23294122e-08   1.42570816e-08])
fallback 37387 to 'Expansion.Conjunction' ([  1.19606839e-05   3.37166731e-01   1.86424615e-01   9.92172075e-02
   1.06404664e-01   4.00434738e-02   5.03699227e-02   3.06752365e-02
   7.03467810e-02   3.00041329e-02   8.15957795e-03   8.75224930e-03
   9.32101359e-03   9.45368049e-03   5.32263990e-03   5.91079852e-03
   2.03885537e-03   1.42971987e-04   5.29545112e-05   8.22788144e-05
   5.65111848e-05   4.17432680e-05])
fallback 37888 to 'Expansion.Conjunction' ([  1.10916289e-05   3.43200050e-01   1.97207178e-01   1.02048045e-01
   1.00371403e-01   3.77351000e-02   4.93970018e-02   3.11513685e-02
   6.25672773e-02   2.93912825e-02   7.98150879e-03   8.79018362e-03
   8.59311111e-03   8.35162196e-03   5.24774601e-03   5.70201582e-03
   1.89951477e-03   1.37174979e-04   4.93122341e-05   7.41797104e-05
   5.36528338e-05   4.01802418e-05])
fallback 37424 to 'Expansion.Conjunction' ([  2.07243957e-05   2.07667965e-01   1.56671363e-01   8.90701055e-02
   1.55337887e-01   6.60770918e-02   5.29846781e-02   3.48977899e-02
   1.48578035e-01   2.89749433e-02   8.60799490e-03   7.31750030e-03
   1.22872006e-02   1.54471269e-02   5.59411020e-03   7.42695073e-03
   2.44513181e-03   1.80532082e-04   7.94140955e-05   1.48235590e-04
   1.11768177e-04   7.34514263e-05])
fallback 38401 to 'Expansion.Conjunction' ([  7.90201327e-09   9.95627207e-01   2.19251747e-03   1.71992098e-03
   1.30351165e-04   1.97318419e-05   8.40597335e-05   1.73901947e-04
   5.80814766e-06   3.35540711e-05   6.98723931e-06   2.08504885e-06
   1.39848803e-06   3.18591697e-07   1.35529331e-07   1.80854746e-06
   1.27413995e-07   9.70175123e-09   1.29157403e-08   3.29061572e-08
   1.95770436e-08   3.76790414e-09])
fallback 37830 to 'Expansion.Conjunction' ([  6.70087547e-06   7.04681381e-01   9.18775329e-02   4.92399883e-02
   4.95912422e-02   1.43893125e-02   2.20047976e-02   1.28088805e-02
   2.80034573e-02   1.06687245e-02   2.88228125e-03   2.37976033e-03
   4.10226770e-03   3.23370185e-03   1.22191137e-03   1.96713321e-03
   7.51659956e-04   8.11454502e-05   1.97643945e-05   4.08954065e-05
   2.37158724e-05   2.37457893e-05])
fallback 39007 to 'Expansion.Conjunction' ([  4.71295352e-05   3.31273136e-01   1.04239485e-01   5.54453242e-02
   1.51407658e-01   6.24613012e-02   3.94240131e-02   2.67428940e-02
   1.62357404e-01   1.94842535e-02   6.15249244e-03   4.73793360e-03
   9.06308640e-03   1.48932402e-02   3.15052501e-03   6.08769241e-03
   2.21031088e-03   2.42302789e-04   1.05244158e-04   2.09660588e-04
   1.51025581e-04   1.13887501e-04])
fallback 38929 to 'Expansion.Conjunction' ([  2.00104514e-05   4.88814707e-01   1.02587535e-01   5.72429183e-02
   1.13539039e-01   3.88885249e-02   3.32877074e-02   2.12798229e-02
   9.33715023e-02   1.77117883e-02   4.43822561e-03   3.74777542e-03
   7.05523504e-03   1.05378906e-02   1.96526757e-03   3.74938079e-03
   1.37783260e-03   1.26030106e-04   4.18641535e-05   1.07770377e-04
   5.86686687e-05   5.05030107e-05])
fallback 38205 to 'Expansion.Conjunction' ([  8.33898775e-06   6.47026127e-01   9.28187079e-02   5.33606898e-02
   6.70545777e-02   2.00612323e-02   2.63817666e-02   1.51248138e-02
   4.34905741e-02   1.28149242e-02   3.49425760e-03   2.70635311e-03
   5.17690232e-03   5.39213051e-03   1.47372870e-03   2.41909527e-03
   9.65745021e-04   9.29812530e-05   2.38176091e-05   5.65793093e-05
   2.76951234e-05   2.89621169e-05])
fallback 38640 to 'Expansion.Conjunction' ([  1.00657189e-05   6.68658514e-01   7.72218503e-02   4.48111383e-02
   7.22822270e-02   2.06961954e-02   2.24885649e-02   1.40110351e-02
   4.94741961e-02   1.11939975e-02   2.74472249e-03   2.16827641e-03
   4.40765511e-03   5.81608496e-03   9.87892417e-04   1.94973970e-03
   8.58707669e-04   8.12144304e-05   1.92489157e-05   6.27183417e-05
   2.70195186e-05   2.89357221e-05])
fallback 38245 to 'Expansion.Conjunction' ([  2.71728022e-05   4.56660032e-01   1.02320783e-01   5.58597185e-02
   1.23309731e-01   4.41635065e-02   3.39791439e-02   2.23371331e-02
   1.07153736e-01   1.82130877e-02   4.67030005e-03   3.96173075e-03
   7.34162004e-03   1.17648262e-02   2.10767030e-03   4.15319903e-03
   1.50852150e-03   1.44882593e-04   5.25839532e-05   1.31044871e-04
   7.72679050e-05   6.23079322e-05])
fallback 37361 to 'Expansion.Conjunction' ([  1.24283849e-06   7.36786822e-01   1.17827025e-01   8.51990855e-02
   1.61672565e-02   4.76441892e-03   1.05998075e-02   1.74555383e-02
   1.54557797e-03   5.49109731e-03   1.44979831e-03   1.06887738e-03
   5.02211319e-04   2.02686986e-04   1.81279853e-04   6.90097552e-04
   4.71685549e-05   4.47138870e-06   3.19213987e-06   4.32245576e-06
   6.44265020e-06   1.57989378e-06])
fallback 38620 to 'Expansion.Conjunction' ([  5.25990117e-07   9.11106810e-01   4.21444953e-02   2.97760232e-02
   4.64283528e-03   1.23479751e-03   2.87383511e-03   5.63756507e-03
   3.22134345e-04   1.32442171e-03   3.91242059e-04   1.89791358e-04
   9.60694582e-05   4.08338085e-05   2.48973934e-05   1.76013765e-04
   1.22321397e-05   1.08196080e-06   7.85539088e-07   1.24408630e-06
   2.03402507e-06   3.30456226e-07])
fallback 38051 to 'Expansion.Conjunction' ([  2.11209535e-05   5.46810209e-01   6.90608023e-02   3.56085896e-02
   1.15125961e-01   4.36460785e-02   2.32477188e-02   1.93095933e-02
   1.13892793e-01   1.08799413e-02   2.90118344e-03   1.95728475e-03
   4.68643800e-03   7.64015222e-03   1.14026561e-03   2.79086315e-03
   8.85166575e-04   1.39669224e-04   4.13651614e-05   9.59134557e-05
   5.81792191e-05   6.07111832e-05])
fallback 37799 to 'Expansion.Conjunction' ([  2.01902549e-06   6.83234444e-01   1.37122152e-01   1.03969871e-01
   1.93041318e-02   5.98396399e-03   1.36774758e-02   2.21671832e-02
   1.58465081e-03   6.78445529e-03   2.14295110e-03   1.66292091e-03
   7.35495230e-04   2.81263721e-04   2.58852986e-04   9.88260364e-04
   6.93055108e-05   7.33419019e-06   4.06928524e-06   5.93588121e-06
   1.06973820e-05   2.56637778e-06])
fallback 37944 to 'Expansion.Conjunction' ([  2.02566498e-05   3.15349936e-01   1.36702910e-01   7.70802644e-02
   1.40722811e-01   5.52196128e-02   4.57598007e-02   2.93911732e-02
   1.25599056e-01   2.48993169e-02   6.91345006e-03   5.82850397e-03
   1.02560166e-02   1.39433387e-02   3.89267433e-03   5.95903395e-03
   1.95839954e-03   1.59762945e-04   6.43164019e-05   1.30419386e-04
   8.58291239e-05   6.31182627e-05])
fallback 38643 to 'Expansion.Conjunction' ([  2.21529308e-06   4.97492433e-01   2.20559374e-01   1.50369376e-01
   3.26042809e-02   1.15440311e-02   2.44054944e-02   3.48637663e-02
   3.78119457e-03   1.24982596e-02   3.61339539e-03   3.39245122e-03
   1.53692591e-03   6.22317080e-04   7.22840488e-04   1.81140239e-03
   1.30873305e-04   1.16967713e-05   6.96738290e-06   1.02318818e-05
   1.58777184e-05   4.59484546e-06])
fallback 38787 to 'Expansion.Conjunction' ([  1.40637513e-09   9.95405672e-01   6.62726232e-04   2.36034276e-04
   1.96609529e-03   3.01146268e-04   7.03057447e-05   1.59249030e-04
   1.12020829e-03   3.93754962e-05   5.97696315e-06   2.02943829e-06
   7.23975789e-06   2.01915590e-05   4.21988744e-07   2.79472874e-06
   4.11243916e-07   5.45337570e-08   1.30304789e-09   4.14426430e-08
   1.04634816e-08   1.25470105e-08])
fallback 39022 to 'Expansion.Conjunction' ([  4.71295352e-05   3.31273136e-01   1.04239485e-01   5.54453242e-02
   1.51407658e-01   6.24613012e-02   3.94240131e-02   2.67428940e-02
   1.62357404e-01   1.94842535e-02   6.15249244e-03   4.73793360e-03
   9.06308640e-03   1.48932402e-02   3.15052501e-03   6.08769241e-03
   2.21031088e-03   2.42302789e-04   1.05244158e-04   2.09660588e-04
   1.51025581e-04   1.13887501e-04])
fallback 38450 to 'Expansion.Conjunction' ([  2.56985859e-05   2.74123108e-01   1.35322588e-01   7.53625422e-02
   1.51145089e-01   6.19751636e-02   4.71296319e-02   3.09180344e-02
   1.46153229e-01   2.49792882e-02   7.36733726e-03   6.06619066e-03
   1.08299984e-02   1.49300381e-02   4.25734193e-03   6.58572524e-03
   2.21647256e-03   1.87005589e-04   7.88497360e-05   1.56539641e-04
   1.11654046e-04   7.84745003e-05])
fallback 37593 to 'Expansion.Conjunction' ([  4.36870451e-09   9.84131308e-01   2.35320714e-03   9.26415584e-04
   6.08364754e-03   1.10551595e-03   3.00546488e-04   5.50232346e-04
   4.15009900e-03   1.85711857e-04   3.52448541e-05   1.11742535e-05
   4.05080925e-05   9.93978436e-05   4.16938871e-06   2.04038782e-05
   1.94791613e-06   1.82479292e-07   8.40539702e-09   1.56397969e-07
   7.22660027e-08   4.61237364e-08])
fallback 37148 to 'Expansion.Conjunction' ([  1.95898693e-08   9.91839033e-01   4.08246081e-03   3.09550594e-03
   2.84091128e-04   4.63688694e-05   1.77058068e-04   3.54690034e-04
   1.43145714e-05   7.56842987e-05   1.53556536e-05   5.58350975e-06
   3.33393490e-06   8.63222267e-07   3.91528424e-07   4.72547609e-06
   3.35302923e-07   2.61176178e-08   3.17591281e-08   7.01596351e-08
   4.71254138e-08   9.50007433e-09])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175482.ba+   1962748K    983754K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175482     rnn-tscca+          2                         00:03:10      0:0 

Job 16175482 ("rnn-tscca-wikipedia") completed on c12-25 at tor dec 15 13:18:52 CET 2016
