Starting job 16175475 ("rnn-cbow-googlenews") on c13-26 at tor dec 15 13:10:53 CET 2016
Python environment is set up
Copying files to /work/jobs/16175475.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175475.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16175475.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt
MODEL_PATH: /work/jobs/16175475.d/models/rnn-cbow-googlenews/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175475.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:11] configuration (/work/jobs/16175475.d/models/rnn-cbow-googlenews/)
[2016-12-15 13:11]     config 'epochs': 200 (1000)
[2016-12-15 13:11]     config 'epochs_len': -1 (-1)
[2016-12-15 13:11]     config 'epochs_patience': 10 (20)
[2016-12-15 13:11]     config 'batch_size':  (64)
[2016-12-15 13:11]     config 'snapshot_size':  (2048)
[2016-12-15 13:11]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:11]     config 'words_dim': 20.0 (20)
[2016-12-15 13:11]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:11]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:11]     config 'final_dim': 40.0 (100)
[2016-12-15 13:11]     config 'arg1_len':  (100)
[2016-12-15 13:11]     config 'arg2_len':  (100)
[2016-12-15 13:11]     config 'conn_len':  (10)
[2016-12-15 13:11]     config 'punc_len':  (2)
[2016-12-15 13:11]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:11]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:11]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:11]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:11]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:11]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:11]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:11]     config 'words2vec_bin': None (None)
[2016-12-15 13:11]     config 'words2vec_txt': /work/jobs/16175475.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt (None)
[2016-12-15 13:11]   args.lang: en
[2016-12-15 13:11]   args.model_dir: /work/jobs/16175475.d/models/rnn-cbow-googlenews/
[2016-12-15 13:11]   args.dataset_dir: /work/jobs/16175475.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-15 13:11]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll16st-en-03-29-16-test/
[2016-12-15 13:11]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:11]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:11]   filter_types: None
[2016-12-15 13:11]   filter_senses: None
[2016-12-15 13:11]   filter_fn_name: conn_gt_0
[2016-12-15 13:11]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175475.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:11] load dataset for prediction (/work/jobs/16175475.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:11] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-15 13:11]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:11] build model
[2016-12-15 13:12]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:12]     config 'optimizer':  (adam)
[2016-12-15 13:12] previous weights (/work/jobs/16175475.d/models/rnn-cbow-googlenews/)
[2016-12-15 13:12] convert from dataset (/work/jobs/16175475.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:12] make predictions
[2016-12-15 13:14] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll16st-en-03-29-16-test/)
/work/jobs/16175475.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 37361 to 'Expansion.Conjunction' ([  1.29164039e-06   8.72698376e-01   5.68606040e-02   4.94123106e-02
   3.12952212e-03   2.55747165e-03   2.53465006e-03   6.62382746e-03
   1.61205973e-04   4.58806059e-03   5.17234968e-04   1.02396153e-04
   4.12025581e-04   2.37593579e-05   1.56229043e-04   1.76064075e-04
   3.85300304e-05   5.42991899e-06   1.25679266e-07   4.88853066e-07
   2.86849345e-07   1.09613546e-07])
fallback 37799 to 'Expansion.Conjunction' ([  1.51814129e-06   8.54977384e-01   6.34615879e-02   5.57766529e-02
   3.80692312e-03   3.19174706e-03   3.34992498e-03   8.11555158e-03
   1.95419594e-04   5.38934916e-03   6.38607668e-04   1.33905271e-04
   4.68601248e-04   2.96578897e-05   1.95373188e-04   2.15558339e-04
   4.46930761e-05   6.31736622e-06   1.61206248e-07   5.80638879e-07
   3.38580355e-07   1.46827420e-07])
fallback 37814 to 'Expansion.Conjunction' ([  5.89608453e-06   3.67348852e-01   2.73468407e-01   2.03187214e-01
   2.44560578e-02   2.05521808e-02   2.63252279e-02   4.11304350e-02
   2.70649397e-03   2.70531384e-02   4.41281314e-03   1.52992470e-03
   3.62450026e-03   5.71810527e-04   2.00682251e-03   1.34015992e-03
   2.28691833e-04   3.56273560e-05   1.88728610e-06   7.67756051e-06
   3.10921748e-06   3.07344546e-06])
fallback 38640 to 'Expansion.Conjunction' ([  1.22577887e-06   4.57087634e-01   1.42672240e-01   8.00069492e-02
   1.06657884e-01   5.32663797e-02   2.31867767e-02   5.12872671e-02
   4.84424082e-02   1.91930494e-02   2.09551420e-03   2.75350524e-03
   4.42907910e-03   3.07557451e-03   2.99158179e-03   2.59565770e-03
   1.70211394e-04   2.90857477e-05   8.52026092e-06   1.21186039e-05
   2.08481541e-05   1.64888787e-05])
fallback 38787 to 'Expansion.Conjunction' ([  2.50175525e-09   9.97848057e-01   2.94090459e-04   1.68471266e-04
   9.72753937e-04   3.13851960e-04   2.38360886e-05   1.37617014e-04
   2.06883740e-04   1.11835291e-05   2.74247674e-06   1.52403280e-06
   4.63608659e-06   7.77713030e-06   4.28611098e-07   5.52285395e-06
   1.80904440e-07   2.68824357e-07   2.01979540e-08   1.42389792e-08
   9.78257071e-08   3.96175439e-08])
fallback 38437 to 'Expansion.Conjunction' ([  3.87738964e-06   3.12633481e-01   3.00636258e-01   2.22076652e-01
   2.57749499e-02   2.35036441e-02   2.69465928e-02   4.48340620e-02
   3.28748833e-03   2.65512370e-02   4.17987253e-03   1.55152798e-03
   3.68790930e-03   5.98001869e-04   2.07681509e-03   1.40986718e-03
   2.07303090e-04   2.77971264e-05   1.43673195e-06   6.13111745e-06
   2.51564617e-06   2.57915210e-06])
fallback 38205 to 'Expansion.Conjunction' ([  9.80957907e-07   4.41257744e-01   1.73620909e-01   9.56138966e-02
   9.10677013e-02   4.75834756e-02   2.44277063e-02   5.22501728e-02
   3.44123318e-02   2.30896994e-02   2.05497536e-03   2.72667593e-03
   4.18040621e-03   2.03161267e-03   3.17921791e-03   2.31141899e-03
   1.34596353e-04   1.95565262e-05   5.52503159e-06   8.66967727e-06
   1.18946054e-05   1.08333643e-05])
fallback 38929 to 'Expansion.Conjunction' ([  1.61825801e-06   2.52564281e-01   1.54811606e-01   9.74437967e-02
   1.56021252e-01   8.90959651e-02   3.60606201e-02   7.48539642e-02
   8.84985999e-02   2.34068688e-02   3.34628998e-03   3.77153186e-03
   5.55658713e-03   6.51246449e-03   3.84976063e-03   3.81747633e-03
   2.57345673e-04   4.28630556e-05   1.40274924e-05   1.63930599e-05
   2.83840782e-05   2.83035806e-05])
fallback 38649 to 'Expansion.Conjunction' ([  7.14006276e-09   9.99598842e-01   1.53667043e-04   2.22739512e-04
   3.00967912e-06   2.01081430e-06   2.96014304e-06   1.13174308e-05
   1.29523820e-08   4.12134561e-06   7.07531727e-07   2.84382450e-08
   2.57041047e-07   1.54870391e-09   1.67160664e-08   2.35853416e-07
   6.01119712e-08   4.05889892e-09   1.02314030e-10   2.90410662e-10
   2.46628213e-10   6.95927808e-12])
fallback 38051 to 'Expansion.Conjunction' ([  4.34059393e-06   2.67140359e-01   9.26958323e-02   7.07172230e-02
   1.70619249e-01   1.20761767e-01   2.71854866e-02   6.84108958e-02
   1.40088871e-01   1.29922247e-02   3.11072800e-03   2.97540613e-03
   4.59904317e-03   1.02950195e-02   3.52351088e-03   3.93814314e-03
   6.30734780e-04   1.06833504e-04   4.16063522e-05   3.48697868e-05
   8.21967042e-05   4.56585986e-05])
fallback 37593 to 'Expansion.Conjunction' ([  1.43761753e-07   9.59431049e-01   6.21391738e-03   3.99304506e-03
   1.31333461e-02   5.57641404e-03   8.70481422e-04   3.55077534e-03
   5.61320547e-03   6.79804709e-04   1.07054707e-04   1.04493840e-04
   1.80179194e-04   2.86136404e-04   4.59773581e-05   1.85259254e-04
   9.22502019e-06   6.87954705e-06   1.65492508e-06   1.16146304e-06
   7.12638755e-06   2.66921165e-06])
fallback 38808 to 'Expansion.Conjunction' ([  9.80458935e-07   5.76936015e-01   1.95777002e-01   1.35997581e-01
   1.66438318e-02   1.50358446e-02   9.54797040e-03   2.65310988e-02
   2.38125286e-03   1.51992880e-02   1.46987000e-03   6.05562595e-04
   1.81449056e-03   2.48968110e-04   9.76466647e-04   7.26238719e-04
   9.16220174e-05   1.20247971e-05   4.23001274e-07   1.85515719e-06
   9.36033430e-07   6.77684521e-07])
fallback 38620 to 'Expansion.Conjunction' ([  5.46185504e-07   9.52915347e-01   2.03885468e-02   1.92162576e-02
   9.89757338e-04   8.86859991e-04   1.01644951e-03   2.61839077e-03
   3.37844677e-05   1.50147682e-03   1.73916934e-04   2.69251552e-05
   1.05007171e-04   4.28873808e-06   3.79264484e-05   7.06440606e-05
   1.22094513e-05   1.43138887e-06   3.84717599e-08   1.10291102e-07
   6.45492248e-08   2.06270427e-08])
fallback 38401 to 'Expansion.Conjunction' ([  3.99895361e-09   9.99782003e-01   8.11390327e-05   1.25324933e-04
   1.37991068e-06   8.96620897e-07   1.45206271e-06   5.35842979e-06
   4.36507442e-09   1.84359836e-06   3.31347273e-07   1.11230986e-08
   1.07509007e-07   4.94151264e-10   6.32817118e-09   1.07054949e-07
   2.84403090e-08   1.55900000e-09   4.37106070e-11   1.18042948e-10
   9.86654486e-11   2.27524396e-12])
fallback 38245 to 'Expansion.Conjunction' ([  1.84124303e-06   2.14788943e-01   1.48950666e-01   9.76585594e-02
   1.66545987e-01   1.00294672e-01   3.77210676e-02   8.00783632e-02
   1.00878149e-01   2.31003928e-02   3.64137719e-03   4.01882966e-03
   5.79365807e-03   7.93151089e-03   4.04744780e-03   4.09661651e-03
   3.01493797e-04   4.89304365e-05   1.69263821e-05   1.87624900e-05
   3.20303260e-05   3.37764140e-05])
fallback 37830 to 'Expansion.Conjunction' ([  6.69206656e-07   6.73183719e-01   1.24362256e-01   7.48945229e-02
   3.54655374e-02   2.11242673e-02   1.00679553e-02   2.94173761e-02
   9.51572293e-03   1.45767485e-02   1.09405859e-03   1.05469973e-03
   2.10791238e-03   5.93734946e-04   1.44684823e-03   9.86985367e-04
   8.37673044e-05   9.58514255e-06   1.97234197e-06   4.24028700e-06
   4.36388323e-06   3.05677227e-06])
fallback 38226 to 'Expansion.Conjunction' ([  1.32360265e-06   8.66218216e-01   6.03399542e-02   5.14801968e-02
   3.37064199e-03   2.68778812e-03   2.51287969e-03   6.78566103e-03
   1.88351115e-04   4.87277707e-03   5.37559161e-04   1.07405046e-04
   4.65149878e-04   2.74161014e-05   1.73514696e-04   1.81375422e-04
   4.25378715e-05   6.08896703e-06   1.37257062e-07   5.69732326e-07
   3.31842730e-07   1.24615370e-07])
fallback 38499 to 'Expansion.Conjunction' ([  2.35986730e-10   9.99418687e-01   6.22146479e-05   3.62472896e-05
   3.07503101e-04   9.14930725e-05   4.03910012e-06   3.01481981e-05
   4.46436830e-05   1.41186128e-06   4.33301357e-07   1.88399911e-07
   6.88963447e-07   1.19861399e-06   4.47288540e-08   9.66232971e-07
   2.87131335e-08   4.67543484e-08   1.72706662e-09   1.20719869e-09
   9.56891376e-09   4.02323956e-09])
fallback 38300 to 'Expansion.Conjunction' ([  1.02987350e-07   9.78813550e-01   2.09026509e-03   1.48833849e-03
   7.38453462e-03   3.53492804e-03   3.50615512e-04   1.85536190e-03
   3.82850374e-03   2.10872550e-04   4.56300632e-05   4.15336481e-05
   7.70435234e-05   1.61681008e-04   1.57195049e-05   7.92576701e-05
   6.00745229e-06   5.21245522e-06   1.48414646e-06   7.51816133e-07
   6.74243407e-06   1.86285085e-06])
fallback 38705 to 'Expansion.Conjunction' ([  7.81951439e-06   4.28240629e-01   2.41995693e-01   1.83235095e-01
   2.29513684e-02   1.82509814e-02   2.48211325e-02   3.80937384e-02
   2.32012804e-03   2.67001429e-02   4.39013636e-03   1.44995552e-03
   3.48253969e-03   5.16825067e-04   1.93242148e-03   1.29963027e-03
   2.51231483e-04   4.26110748e-05   2.29567923e-06   8.74273796e-06
   3.56674720e-06   3.31543630e-06])
fallback 37310 to 'Expansion.Conjunction' ([  1.10507904e-06   8.96098056e-01   4.53933504e-02   4.07793922e-02
   2.53926747e-03   2.17606914e-03   2.29035056e-03   5.77842803e-03
   1.16038577e-04   3.69537170e-03   4.25937663e-04   8.24321303e-05
   2.99506872e-04   1.65329653e-05   1.20295194e-04   1.52919583e-04
   3.01391185e-05   4.07379356e-06   1.01560891e-07   3.44537475e-07
   2.06793752e-07   8.09545123e-08])
fallback 37148 to 'Expansion.Conjunction' ([  6.19134122e-09   9.99647164e-01   1.33548823e-04   1.98386876e-04
   2.53854688e-06   1.70499872e-06   2.63776594e-06   9.54159645e-06
   9.61831703e-09   3.37548212e-06   6.02615117e-07   2.31908560e-08
   1.99130175e-07   1.16727042e-09   1.28798148e-08   1.95304911e-07
   4.85447249e-08   3.06389587e-09   8.14548378e-11   2.21838247e-10
   1.87649664e-10   5.24376214e-12])
fallback 38643 to 'Expansion.Conjunction' ([  2.36894766e-06   7.74371360e-01   1.01802778e-01   8.27184366e-02
   6.33205918e-03   5.14091907e-03   5.28507569e-03   1.19734747e-02
   4.12138078e-04   8.88615631e-03   1.07577661e-03   2.35585139e-04
   8.95102187e-04   6.88587656e-05   3.73206351e-04   3.37445137e-04
   7.48201539e-05   1.19333350e-05   2.95954000e-07   1.23830098e-06
   6.45233605e-07   3.26840069e-07])
fallback 38115 to 'Expansion.Conjunction' ([  1.16026092e-06   5.25312491e-01   1.16978282e-01   6.72263662e-02
   9.86104398e-02   4.85568798e-02   1.91902670e-02   4.55959557e-02
   4.69801805e-02   1.59109051e-02   1.81219566e-03   2.30018099e-03
   3.67686204e-03   2.90153738e-03   2.31989686e-03   2.38354158e-03
   1.54497773e-04   2.82991027e-05   9.11366000e-06   1.14669266e-05
   2.28774373e-05   1.66035663e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175475.ba+   1723584K    920931K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175475     rnn-cbow-+          2                         00:03:24      0:0 

Job 16175475 ("rnn-cbow-googlenews") completed on c13-26 at tor dec 15 13:14:13 CET 2016
