Starting job 16188385 ("rnn-rsv50-wikipedia") on c14-29 at lör dec 17 13:14:07 CET 2016
Python environment is set up
Copying files to /work/jobs/16188385.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16188385.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16188385.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed
MODEL_PATH: /work/jobs/16188385.d/models/rnn-rsv50-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16188385.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-17 13:14] configuration (/work/jobs/16188385.d/models/rnn-rsv50-wikipedia/)
[2016-12-17 13:14]     config 'epochs': 200 (1000)
[2016-12-17 13:14]     config 'epochs_len': -1 (-1)
[2016-12-17 13:14]     config 'epochs_patience': 10 (20)
[2016-12-17 13:14]     config 'batch_size':  (64)
[2016-12-17 13:14]     config 'snapshot_size':  (2048)
[2016-12-17 13:14]     config 'random_per_sample': 24.0 (32)
[2016-12-17 13:14]     config 'words_dim': 20.0 (20)
[2016-12-17 13:14]     config 'focus_dim': 6.0 (4)
[2016-12-17 13:14]     config 'rnn_dim': 50.0 (20)
[2016-12-17 13:14]     config 'final_dim': 40.0 (100)
[2016-12-17 13:14]     config 'arg1_len':  (100)
[2016-12-17 13:14]     config 'arg2_len':  (100)
[2016-12-17 13:14]     config 'conn_len':  (10)
[2016-12-17 13:14]     config 'punc_len':  (2)
[2016-12-17 13:14]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-17 13:14]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-17 13:14]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-17 13:14]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-17 13:14]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-17 13:14]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-17 13:14]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-17 13:14]     config 'words2vec_bin': None (None)
[2016-12-17 13:14]     config 'words2vec_txt': /work/jobs/16188385.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed (None)
[2016-12-17 13:14]   args.lang: en
[2016-12-17 13:14]   args.model_dir: /work/jobs/16188385.d/models/rnn-rsv50-wikipedia/
[2016-12-17 13:14]   args.dataset_dir: /work/jobs/16188385.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-17 13:14]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll16st-en-03-29-16-dev/
[2016-12-17 13:14]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-17 13:14]   os.getenv("THEANO_FLAGS"): None
[2016-12-17 13:14]   filter_types: None
[2016-12-17 13:14]   filter_senses: None
[2016-12-17 13:14]   filter_fn_name: conn_gt_0
[2016-12-17 13:14]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16188385.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-17 13:14] load dataset for prediction (/work/jobs/16188385.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-17 13:14] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-17 13:14]   rel_senses2id: 22, words2id: 43918
[2016-12-17 13:14] build model
[2016-12-17 13:15]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-17 13:15]     config 'optimizer':  (adam)
[2016-12-17 13:15] previous weights (/work/jobs/16188385.d/models/rnn-rsv50-wikipedia/)
[2016-12-17 13:15] convert from dataset (/work/jobs/16188385.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-17 13:15] make predictions
[2016-12-17 13:16] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll16st-en-03-29-16-dev/)
/work/jobs/16188385.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 37106 to 'Expansion.Conjunction' ([  4.03612876e-06   6.79140623e-01   4.38639296e-02   2.64618824e-02
   9.47725022e-02   2.74211316e-02   1.36767979e-02   1.07462713e-02
   9.27952895e-02   4.49652921e-03   6.71454352e-04   1.51350430e-03
   1.49627518e-03   6.52006300e-04   8.81593902e-04   1.02704833e-03
   1.62730065e-04   1.80799018e-04   1.75727120e-06   1.78580793e-05
   8.67299145e-06   7.30697862e-06])
fallback 36788 to 'Expansion.Conjunction' ([  9.57599968e-06   3.31078708e-01   1.13972723e-01   7.09121078e-02
   1.71872735e-01   6.50366693e-02   3.80353778e-02   2.65966318e-02
   1.46441132e-01   1.30997058e-02   2.82939872e-03   4.70913900e-03
   4.86847711e-03   2.37159757e-03   3.76821146e-03   3.46529693e-03
   5.56170125e-04   2.75798782e-04   6.95930429e-06   4.11165783e-05
   2.48285432e-05   2.76395840e-05])
fallback 36017 to 'Expansion.Conjunction' ([  3.48423121e-08   9.30706568e-01   3.30424013e-02   2.17375254e-02
   1.72825927e-03   8.27396761e-04   4.02386257e-03   4.38009998e-03
   3.14769891e-04   1.93018805e-03   4.75980956e-04   9.55783479e-05
   5.26870954e-04   1.85541741e-05   9.91581554e-05   8.69228177e-05
   3.24828605e-06   1.44698391e-06   7.26643143e-08   3.11729738e-07
   4.93220082e-08   6.99290132e-07])
fallback 36919 to 'Expansion.Conjunction' ([  4.42112935e-07   9.19309770e-01   1.76299191e-02   8.43407656e-03
   2.53245190e-02   4.76598121e-03   4.06072650e-03   3.60171347e-03
   1.44131329e-02   1.27698210e-03   1.20284018e-04   2.57450818e-04
   3.66759331e-04   6.59148555e-05   1.59499129e-04   1.69894639e-04
   2.12103054e-05   1.78800578e-05   1.29784635e-07   1.64704097e-06
   9.30710402e-07   1.13647954e-06])
fallback 36080 to 'Expansion.Conjunction' ([  1.24150565e-10   9.99880262e-01   2.26270278e-06   1.10126610e-06
   6.30738000e-05   3.21820701e-06   2.33861643e-07   1.42425507e-07
   4.95828393e-05   6.48046173e-08   3.40441944e-09   1.93194955e-08
   1.77112246e-08   3.76355794e-09   9.13227278e-09   1.56639047e-09
   8.49765819e-10   1.51092384e-09   6.33596166e-11   8.85269503e-11
   1.02030252e-09   1.68539177e-11])
fallback 37045 to 'Expansion.Conjunction' ([  5.38014638e-06   2.51863099e-01   1.94312831e-01   1.06600094e-01
   1.60416309e-01   5.89976885e-02   5.15418141e-02   3.89279510e-02
   9.08109347e-02   1.84637741e-02   3.89196175e-03   5.47815222e-03
   7.24614105e-03   1.95431645e-03   5.24940495e-03   3.57170296e-03
   4.80918139e-04   1.17449799e-04   5.11094017e-06   1.82038225e-05
   1.47475015e-05   3.20148255e-05])
fallback 36070 to 'Expansion.Conjunction' ([  7.17788225e-06   2.34801784e-01   1.71460748e-01   9.86688583e-02
   1.77286416e-01   6.75388649e-02   5.22105358e-02   3.74600626e-02
   1.12858444e-01   1.79582666e-02   4.02471702e-03   5.92738995e-03
   6.71637384e-03   2.53479904e-03   5.58280432e-03   4.07391879e-03
   6.26832304e-04   1.72507585e-04   6.93078527e-06   2.57804277e-05
   2.15663167e-05   3.52214410e-05])
fallback 36502 to 'Expansion.Conjunction' ([  1.27941087e-06   6.34353094e-01   1.26079781e-01   5.67983159e-02
   6.86396800e-02   1.86600459e-02   2.46544310e-02   2.38050015e-02
   2.79853043e-02   8.71970122e-03   1.26647575e-03   1.81224079e-03
   3.74215907e-03   3.25532655e-04   1.44863837e-03   1.55335465e-03
   9.52245817e-05   3.92001307e-05   8.90819070e-07   6.53520002e-06
   3.23374294e-06   9.87978717e-06])
fallback 36651 to 'Expansion.Conjunction' ([  2.54425800e-07   9.58933133e-01   5.33610546e-03   2.88777944e-03
   1.53568725e-02   2.56012688e-03   1.38031857e-03   9.89764947e-04
   1.17799651e-02   4.06668471e-04   3.69016168e-05   9.59795816e-05
   9.83983864e-05   3.11696937e-05   4.42716381e-05   4.16454721e-05
   8.34024574e-06   1.06637683e-05   5.58557300e-08   7.64783934e-07
   5.09014977e-07   3.11017578e-07])
fallback 36362 to 'Expansion.Conjunction' ([  9.14054255e-09   9.83809072e-01   8.28251537e-03   4.04906979e-03
   6.59200840e-04   2.07782523e-04   8.96900035e-04   1.29296447e-03
   1.35536395e-04   4.09280918e-04   5.37839597e-05   3.13197421e-05
   1.12958305e-04   1.92012798e-06   1.95580382e-05   3.63569095e-05
   8.99588956e-07   5.47345006e-07   1.37875074e-08   9.57075574e-08
   1.36612297e-08   2.01836077e-07])
fallback 35791 to 'Expansion.Conjunction' ([  3.17646118e-06   6.23290462e-01   8.57219375e-02   4.47486888e-02
   9.73534483e-02   2.71106672e-02   2.27840425e-02   1.88235617e-02
   6.23740574e-02   7.77645807e-03   1.13733808e-03   1.93427055e-03
   2.75196291e-03   6.45007979e-04   1.62966370e-03   1.58419782e-03
   1.93877315e-04   1.03030133e-04   1.64345324e-06   1.35169299e-05
   7.61520393e-06   1.13759940e-05])
fallback 36920 to 'Expansion.Conjunction' ([  1.29029402e-07   7.61956863e-01   1.14046424e-01   6.54716038e-02
   8.33769321e-03   3.99030369e-03   1.62583812e-02   1.59381515e-02
   1.63208529e-03   7.07496836e-03   1.45773856e-03   4.57718498e-04
   2.35149192e-03   9.70260071e-05   5.27684746e-04   3.71461614e-04
   1.89456858e-05   5.78169642e-06   4.10181737e-07   1.12036934e-06
   2.68717398e-07   3.74924885e-06])
fallback 36214 to 'Expansion.Conjunction' ([  8.20323542e-09   9.84013152e-01   8.08488587e-03   4.46743244e-03
   3.98796173e-04   1.77886164e-04   8.95750312e-04   1.25218429e-03
   6.89134184e-05   3.98877372e-04   6.41530722e-05   2.78670217e-05
   9.93950100e-05   2.55577246e-06   1.93695871e-05   2.67931412e-05
   1.10697716e-06   5.26475623e-07   2.50397128e-08   9.21341094e-08
   1.22018219e-08   2.17702083e-07])
fallback 36222 to 'Expansion.Conjunction' ([  1.19247723e-08   9.72318099e-01   1.37484537e-02   8.40449321e-03
   5.98823003e-04   2.83620258e-04   1.48018575e-03   1.96341073e-03
   9.85464853e-05   6.74766944e-04   1.39711670e-04   4.07863039e-05
   1.70152603e-04   5.00205526e-06   3.28995661e-05   3.85270099e-05
   1.43140685e-06   6.35559209e-07   3.17701096e-08   1.15464671e-07
   1.69725866e-08   2.78655047e-07])
fallback 36838 to 'Expansion.Conjunction' ([  7.72651401e-06   3.30967638e-01   1.40060948e-01   8.12020905e-02
   1.62232281e-01   5.85903568e-02   4.34845764e-02   3.11131145e-02
   1.12945707e-01   1.50584887e-02   3.13185810e-03   4.65449602e-03
   5.63025992e-03   2.07438718e-03   4.35940413e-03   3.66781213e-03
   5.36028708e-04   1.94808310e-04   5.82909712e-06   3.19457107e-05
   2.09963511e-05   2.92472580e-05])
fallback 35749 to 'Expansion.Conjunction' ([  2.96038957e-06   6.30045554e-01   8.75183298e-02   4.49698210e-02
   9.41253783e-02   2.59197382e-02   2.28099793e-02   1.91271982e-02
   5.78045641e-02   7.79210522e-03   1.12418322e-03   1.88522571e-03
   2.76900581e-03   6.07110522e-04   1.61350663e-03   1.57230679e-03
   1.85513861e-04   9.49559284e-05   1.53845547e-06   1.26718191e-05
   7.14408157e-06   1.12087422e-05])
fallback 35802 to 'Expansion.Conjunction' ([  5.85615953e-06   5.09918687e-01   8.64958609e-02   5.06838445e-02
   1.31974160e-01   4.20252529e-02   2.65742576e-02   1.97266898e-02
   1.09781324e-01   9.13969608e-03   1.58478540e-03   2.79285268e-03
   3.26150188e-03   1.18825922e-03   2.16369074e-03   2.11992882e-03
   3.10212110e-04   1.94569117e-04   3.27650626e-06   2.54274417e-05
   1.39222238e-05   1.59449136e-05])
fallback 36262 to 'Expansion.Conjunction' ([  1.96184305e-06   5.61939845e-01   1.40005159e-01   6.62263643e-02
   8.70753393e-02   2.50222054e-02   2.97426847e-02   2.67853909e-02
   3.95169526e-02   1.06352327e-02   1.63841658e-03   2.33167926e-03
   4.40223197e-03   5.11615197e-04   2.00701439e-03   1.92771425e-03
   1.46900525e-04   5.45965423e-05   1.36504050e-06   9.07879273e-06
   4.91866703e-06   1.33325850e-05])
fallback 36213 to 'Expansion.Conjunction' ([  1.53526074e-07   7.05180962e-01   1.40587364e-01   8.20783846e-02
   1.04048376e-02   5.00963642e-03   2.02581031e-02   1.92827737e-02
   2.00170098e-03   8.58018571e-03   1.89391878e-03   5.49749312e-04
   2.91112492e-03   1.27082287e-04   6.53944811e-04   4.45218041e-04
   2.22151436e-05   6.40408388e-06   4.82015095e-07   1.26465060e-06
   3.39436677e-07   4.15498255e-06])
fallback 36254 to 'Expansion.Conjunction' ([  5.77222011e-07   3.48172093e-01   2.97730173e-01   1.73005131e-01
   2.93101217e-02   1.56582349e-02   5.09717755e-02   3.97014165e-02
   6.26743436e-03   2.03178988e-02   5.28971936e-03   1.57699033e-03
   8.01183551e-03   6.12606285e-04   2.13898343e-03   1.11509916e-03
   8.38142502e-05   1.72811594e-05   1.85535870e-06   3.88807388e-06
   1.54953179e-06   1.15209812e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16188385.ba+   1650556K    847403K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16188385     rnn-rsv50+          2                         00:02:54      0:0 

Job 16188385 ("rnn-rsv50-wikipedia") completed on c14-29 at lör dec 17 13:16:59 CET 2016
