Starting job 16175480 ("rnn-randomprojection-wikipedia") on c13-15 at tor dec 15 13:11:49 CET 2016
Python environment is set up
Copying files to /work/jobs/16175480.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175480.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16175480.d/resources//word_embeddings/precompiled/random_projection/size=50.merged
MODEL_PATH: /work/jobs/16175480.d/models/rnn-randomprojection-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175480.d/resources//word_embeddings/precompiled/random_projection/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:12] configuration (/work/jobs/16175480.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:12]     config 'epochs': 200 (1000)
[2016-12-15 13:12]     config 'epochs_len': -1 (-1)
[2016-12-15 13:12]     config 'epochs_patience': 10 (20)
[2016-12-15 13:12]     config 'batch_size':  (64)
[2016-12-15 13:12]     config 'snapshot_size':  (2048)
[2016-12-15 13:12]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:12]     config 'words_dim': 20.0 (20)
[2016-12-15 13:12]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:12]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:12]     config 'final_dim': 40.0 (100)
[2016-12-15 13:12]     config 'arg1_len':  (100)
[2016-12-15 13:12]     config 'arg2_len':  (100)
[2016-12-15 13:12]     config 'conn_len':  (10)
[2016-12-15 13:12]     config 'punc_len':  (2)
[2016-12-15 13:12]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:12]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:12]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:12]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:12]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:12]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:12]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:12]     config 'words2vec_bin': None (None)
[2016-12-15 13:12]     config 'words2vec_txt': /work/jobs/16175480.d/resources//word_embeddings/precompiled/random_projection/size=50.merged (None)
[2016-12-15 13:12]   args.lang: en
[2016-12-15 13:12]   args.model_dir: /work/jobs/16175480.d/models/rnn-randomprojection-wikipedia/
[2016-12-15 13:12]   args.dataset_dir: /work/jobs/16175480.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-15 13:12]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-test/
[2016-12-15 13:12]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:12]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:12]   filter_types: None
[2016-12-15 13:12]   filter_senses: None
[2016-12-15 13:12]   filter_fn_name: conn_gt_0
[2016-12-15 13:12]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175480.d/resources//word_embeddings/precompiled/random_projection/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:12] load dataset for prediction (/work/jobs/16175480.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:12] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-15 13:12]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:12] build model
[2016-12-15 13:13]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:13]     config 'optimizer':  (adam)
[2016-12-15 13:13] previous weights (/work/jobs/16175480.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:13] convert from dataset (/work/jobs/16175480.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:13] make predictions
[2016-12-15 13:15] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-test/)
/work/jobs/16175480.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 38437 to 'Expansion.Conjunction' ([  3.62361970e-06   6.57009724e-01   1.11664273e-01   1.01817072e-01
   2.18871572e-02   1.37609077e-02   2.41097176e-02   2.86695176e-02
   6.44289100e-03   1.76380110e-02   4.71810906e-03   5.09178595e-03
   2.68930641e-03   6.76663072e-04   2.74465840e-03   7.45660804e-04
   1.13826886e-04   6.81965907e-05   2.94101757e-05   4.77978322e-05
   6.38577479e-05   7.83145337e-06])
fallback 38620 to 'Expansion.Conjunction' ([  3.61677905e-07   9.46746795e-01   1.81819411e-02   1.78285489e-02
   2.76050189e-03   1.45108804e-03   3.08592394e-03   4.11991694e-03
   7.14544868e-04   2.67824282e-03   7.03919874e-04   8.32467132e-04
   3.59267269e-04   3.70969949e-05   3.79460759e-04   6.91705448e-05
   1.51724967e-05   1.06084566e-05   3.72839929e-06   1.11637513e-05
   8.38869007e-06   1.69077890e-06])
fallback 38929 to 'Expansion.Conjunction' ([  2.53472845e-05   2.61556385e-01   1.92242696e-01   1.16654768e-01
   9.57301626e-02   1.07816576e-01   4.99422845e-02   5.76326173e-02
   7.66140516e-02   1.28455850e-02   6.60604048e-03   3.17033029e-03
   4.78322196e-03   3.82679675e-03   8.05844175e-03   1.72976322e-03
   2.27573836e-04   2.47957038e-04   1.14886199e-04   5.96468741e-05
   8.97487256e-05   2.51195414e-05])
fallback 38080 to 'Expansion.Conjunction' ([  1.01544501e-05   5.86550938e-01   1.26779270e-01   1.12911155e-01
   3.05382230e-02   1.86122913e-02   3.12833369e-02   3.63763228e-02
   9.68220250e-03   2.17093131e-02   6.80456482e-03   7.54880609e-03
   3.95621025e-03   1.27334855e-03   3.83290361e-03   1.39107086e-03
   2.68835947e-04   1.34106446e-04   5.83369898e-05   1.15698528e-04
   1.42783753e-04   2.01267990e-05])
fallback 38300 to 'Expansion.Conjunction' ([  6.37514950e-06   8.40024089e-01   4.15343481e-02   2.18284180e-02
   2.10048215e-02   2.32260891e-02   5.80401981e-03   9.50496802e-03
   3.09587000e-02   1.86962827e-03   1.08380764e-03   5.94812195e-04
   6.10839732e-04   2.09634899e-04   1.44206635e-03   1.37118459e-04
   5.51496180e-05   5.11367601e-05   1.41502137e-05   1.33510199e-05
   2.10342126e-05   5.44203369e-06])
fallback 39043 to 'Expansion.Conjunction' ([  9.88967713e-06   3.62056584e-01   1.93034262e-01   1.81352392e-01
   4.51600590e-02   3.22057084e-02   5.21007927e-02   5.33350447e-02
   1.45769176e-02   3.25492137e-02   9.20097533e-03   9.11245405e-03
   5.27313167e-03   2.22626050e-03   5.30324738e-03   1.81377808e-03
   2.51614286e-04   1.34753253e-04   6.45740367e-05   8.41404620e-05
   1.40116201e-04   1.40900902e-05])
fallback 38051 to 'Expansion.Conjunction' ([  2.22457329e-05   2.99843643e-01   1.72656300e-01   9.60603667e-02
   1.03080922e-01   1.25733332e-01   3.59225985e-02   5.00924854e-02
   7.91615332e-02   9.90850398e-03   5.56965505e-03   3.08834369e-03
   3.94654000e-03   3.21023939e-03   9.58684658e-03   1.37251838e-03
   2.21931829e-04   2.84209822e-04   9.38283495e-05   4.72667749e-05
   8.13890448e-05   1.53000603e-05])
fallback 38485 to 'Expansion.Conjunction' ([  8.28525572e-06   3.05931742e-01   2.07733821e-01   2.02939149e-01
   4.86403472e-02   3.71017338e-02   5.82035286e-02   5.50934887e-02
   1.58744117e-02   3.50382024e-02   9.48964510e-03   8.61971625e-03
   5.07881158e-03   2.42278395e-03   5.46346270e-03   1.77824180e-03
   2.13624950e-04   1.20917522e-04   5.82714083e-05   6.29015839e-05
   1.16123510e-04   1.07890408e-05])
fallback 38638 to 'Expansion.Conjunction' ([  5.40300016e-06   5.72503520e-01   1.39797333e-01   1.20327386e-01
   3.05998519e-02   2.33477266e-02   3.07582885e-02   3.15486871e-02
   1.12970167e-02   2.13751369e-02   5.59435146e-03   3.91385667e-03
   2.48313282e-03   1.04851127e-03   4.15555723e-03   8.71593094e-04
   1.07955154e-04   9.94239113e-05   4.75128410e-05   3.62516338e-05
   7.00304970e-05   1.14733087e-05])
fallback 38787 to 'Expansion.Conjunction' ([  1.21701405e-07   9.96835463e-01   6.83136978e-04   4.82693631e-04
   4.47967349e-04   2.55155521e-04   1.19217190e-04   2.47166345e-04
   8.35083419e-04   3.48485407e-05   1.27761477e-05   1.03718502e-05
   1.43440347e-05   5.78651448e-07   1.36334992e-05   1.64612776e-06
   3.51618948e-06   6.87587767e-07   1.07059150e-07   6.69101150e-07
   4.48108946e-07   3.67661412e-07])
fallback 38226 to 'Expansion.Conjunction' ([  8.41812948e-07   8.69734563e-01   4.62521116e-02   4.04084203e-02
   7.32272891e-03   4.38042719e-03   7.73973976e-03   9.62364928e-03
   2.07735989e-03   6.98060943e-03   1.56379324e-03   1.71281777e-03
   7.97853319e-04   1.42179237e-04   9.87733805e-04   1.79884674e-04
   2.76648509e-05   2.35827986e-05   9.08689957e-06   1.46501139e-05
   1.73948060e-05   2.90756786e-06])
fallback 38711 to 'Expansion.Conjunction' ([  9.55658288e-06   5.00750237e-01   1.55377282e-01   1.38521669e-01
   3.54226823e-02   2.29366288e-02   3.81584423e-02   4.30682780e-02
   1.13511755e-02   2.58695610e-02   7.59828546e-03   8.31974287e-03
   4.41606290e-03   1.57094500e-03   4.42238239e-03   1.51251185e-03
   2.50287118e-04   1.30277096e-04   5.91462805e-05   9.87270528e-05
   1.39483031e-04   1.66363896e-05])
fallback 38245 to 'Expansion.Conjunction' ([  2.19203121e-05   2.20082075e-01   1.97287605e-01   1.18707300e-01
   1.04919240e-01   1.20903589e-01   5.21272349e-02   6.06259483e-02
   8.31284974e-02   1.25578968e-02   6.51437047e-03   3.32488657e-03
   4.84179335e-03   4.15463608e-03   8.34312666e-03   1.74337673e-03
   2.21669558e-04   2.40954251e-04   1.01933620e-04   5.49834551e-05
   7.77617755e-05   1.91999607e-05])
fallback 37444 to 'Expansion.Conjunction' ([  1.28252996e-05   2.50365944e-01   2.20299424e-01   2.06512378e-01
   5.95793728e-02   5.17132844e-02   6.46093417e-02   5.80680038e-02
   2.19495689e-02   3.32616793e-02   1.02638398e-02   6.38732411e-03
   4.69619504e-03   2.97642361e-03   6.76336563e-03   1.90245350e-03
   1.93921486e-04   1.57008865e-04   9.08481457e-05   5.81141943e-05
   1.22601720e-04   1.60815617e-05])
fallback 37310 to 'Expansion.Conjunction' ([  5.79556115e-07   9.15658759e-01   2.86986172e-02   2.77168169e-02
   4.49109676e-03   2.48871903e-03   4.99906430e-03   6.64467821e-03
   1.19415937e-03   4.24787350e-03   1.12612218e-03   1.28597729e-03
   5.73039862e-04   7.22044850e-05   6.09431989e-04   1.18742310e-04
   2.26253757e-05   1.58342552e-05   5.85019953e-06   1.46527998e-05
   1.28850486e-05   2.27023335e-06])
fallback 37814 to 'Expansion.Conjunction' ([  3.55419866e-06   7.12251946e-01   9.22777410e-02   8.59975499e-02
   1.84820197e-02   1.11994341e-02   2.02117577e-02   2.45331223e-02
   5.44431142e-03   1.44830623e-02   4.27765018e-03   4.62708845e-03
   2.31008716e-03   5.47234598e-04   2.35774759e-03   6.65479966e-04
   1.14845175e-04   6.46603208e-05   2.68800917e-05   5.37415497e-05
   6.17263127e-05   8.35961492e-06])
fallback 38115 to 'Expansion.Conjunction' ([  5.48031348e-05   5.62808881e-01   1.20602282e-01   7.01789943e-02
   5.37028732e-02   5.72780567e-02   2.48596207e-02   3.10788328e-02
   4.93651302e-02   9.16152371e-03   5.03032058e-03   2.12400410e-03
   3.09729232e-03   1.96702968e-03   6.39712915e-03   1.22564754e-03
   2.63622617e-04   3.10180482e-04   1.73810087e-04   8.05057003e-05
   1.60384504e-04   7.90750142e-05])
fallback 38401 to 'Expansion.Conjunction' ([  9.12670117e-08   9.79008011e-01   7.55705353e-03   7.39802414e-03
   8.76704923e-04   4.65683985e-04   1.13658944e-03   1.34948349e-03
   2.39366227e-04   1.18689133e-03   2.20894404e-04   2.82942956e-04
   1.11674918e-04   9.64918210e-06   1.25708290e-04   1.51671692e-05
   3.92222452e-06   3.72266774e-06   1.24785003e-06   3.95412505e-06
   2.54849963e-06   6.68022716e-07])
fallback 38808 to 'Expansion.Conjunction' ([  4.05060746e-06   7.33759642e-01   9.18887333e-02   7.28306771e-02
   1.89490970e-02   1.34454351e-02   1.69952009e-02   1.94465406e-02
   7.22625620e-03   1.36698727e-02   3.41458572e-03   2.62274314e-03
   1.56857481e-03   5.33721992e-04   2.83872569e-03   5.28207166e-04
   7.56555019e-05   7.55950606e-05   3.45870140e-05   2.86462000e-05
   5.23662166e-05   1.10855208e-05])
fallback 37387 to 'Expansion.Conjunction' ([  5.53152313e-05   4.66514971e-01   1.48569955e-01   1.14319420e-01
   5.31425173e-02   5.09260479e-02   3.98658734e-02   4.32500053e-02
   3.29438333e-02   1.93810107e-02   8.43302898e-03   3.55851926e-03
   4.80454923e-03   2.36317537e-03   8.68546396e-03   1.82517989e-03
   3.53413835e-04   2.99000528e-04   2.44850349e-04   1.01408404e-04
   2.47978836e-04   1.14482106e-04])
fallback 37802 to 'Expansion.Conjunction' ([  1.75825171e-05   2.48183461e-01   2.18884664e-01   2.02751132e-01
   6.16487531e-02   5.37014608e-02   6.56516781e-02   5.96245197e-02
   2.37465596e-02   3.15760973e-02   1.03894548e-02   5.95868430e-03
   4.86236489e-03   3.14131009e-03   7.04705954e-03   2.07229985e-03
   2.19432653e-04   1.81327372e-04   1.12972085e-04   6.33994938e-05
   1.43766375e-04   2.20212025e-05])
fallback 38889 to 'Expansion.Conjunction' ([  7.81907875e-06   2.76285139e-01   2.15295372e-01   2.13283343e-01
   5.06851445e-02   4.00708314e-02   6.16201939e-02   5.58656635e-02
   1.65529790e-02   3.67474627e-02   9.76642398e-03   8.28583251e-03
   5.02845314e-03   2.57494345e-03   5.60634624e-03   1.77606717e-03
   1.96794672e-04   1.18697068e-04   5.80810551e-05   5.53437452e-05
   1.09255320e-04   9.81318853e-06])
fallback 38640 to 'Expansion.Conjunction' ([  5.66619783e-05   5.58415963e-01   1.22789416e-01   7.44487289e-02
   5.26052205e-02   5.52075817e-02   2.63451866e-02   3.20030943e-02
   4.61967152e-02   1.00230670e-02   5.37291788e-03   2.20162241e-03
   3.26831577e-03   2.03116686e-03   6.59854354e-03   1.31394240e-03
   2.73647958e-04   3.14995392e-04   1.87819799e-04   8.39198276e-05
   1.73421726e-04   8.80512911e-05])
fallback 37721 to 'Expansion.Conjunction' ([  1.31787237e-05   3.67790052e-01   1.90045153e-01   1.69232224e-01
   5.13345313e-02   4.37628078e-02   5.01822059e-02   4.92052671e-02
   1.99647755e-02   2.89688937e-02   8.99032245e-03   5.42423328e-03
   4.00737357e-03   2.31272337e-03   6.52038415e-03   1.60070222e-03
   1.83715955e-04   1.66498827e-04   9.34693766e-05   5.86509573e-05
   1.22346263e-04   2.04910853e-05])
fallback 38499 to 'Expansion.Conjunction' ([  3.13658960e-10   9.99918205e-01   1.56582443e-05   1.00079349e-05
   1.38386210e-05   3.48523366e-06   1.83926928e-06   6.20078334e-06
   2.89575905e-05   7.84804954e-07   1.73722424e-07   2.61952773e-07
   3.68367829e-07   2.30089699e-09   9.92540077e-08   1.79579388e-08
   7.15208076e-08   8.07509423e-09   3.63049334e-10   1.27750528e-08
   3.45704770e-09   2.22093273e-09])
fallback 38422 to 'Expansion.Conjunction' ([  3.28108472e-05   2.44379875e-01   2.09756849e-01   1.89375473e-01
   6.89374423e-02   6.21435858e-02   6.73128060e-02   6.20155699e-02
   3.09207380e-02   2.80486454e-02   1.09717221e-02   5.35963423e-03
   5.25542854e-03   3.43523659e-03   8.52573839e-03   2.47460484e-03
   3.12047017e-04   2.45453467e-04   1.71748584e-04   8.07910391e-05
   1.98789419e-04   4.50112233e-05])
fallback 37830 to 'Expansion.Conjunction' ([  1.36986173e-05   8.69629758e-01   3.89262855e-02   2.61632600e-02
   1.29360969e-02   1.17364966e-02   7.65016178e-03   9.94905011e-03
   9.99518876e-03   5.11869100e-03   2.10863263e-03   9.60807102e-04
   1.08422423e-03   3.90210313e-04   2.59050080e-03   3.38191668e-04
   9.42041315e-05   9.98347406e-05   5.96039838e-05   3.65415624e-05
   6.47555656e-05   5.38063843e-05])
fallback 39066 to 'Expansion.Conjunction' ([  1.57255017e-05   3.26947213e-01   1.99769736e-01   1.78623900e-01
   5.57881147e-02   4.80233469e-02   5.51098176e-02   5.30059152e-02
   2.20443141e-02   2.93719303e-02   9.50796624e-03   5.51092579e-03
   4.31541447e-03   2.59899744e-03   6.86665020e-03   1.79244892e-03
   2.02923781e-04   1.79900875e-04   1.05287822e-04   6.19478306e-05
   1.34604416e-04   2.29196922e-05])
fallback 38705 to 'Expansion.Conjunction' ([  3.69941927e-06   7.74741956e-01   7.14354523e-02   6.64210997e-02
   1.49696769e-02   8.50563319e-03   1.57281758e-02   1.95558241e-02
   4.41494030e-03   1.14013777e-02   3.63208614e-03   3.93798206e-03
   1.94352797e-03   4.13139501e-04   1.97374846e-03   5.78152313e-04
   1.19110876e-04   6.33376119e-05   2.61202607e-05   6.29798894e-05
   6.20864891e-05   9.89304146e-06])
fallback 37197 to 'Expansion.Conjunction' ([  5.29358522e-06   5.59092514e-01   1.44324614e-01   1.24625346e-01
   3.12946323e-02   2.37411797e-02   3.18419817e-02   3.25238253e-02
   1.13853773e-02   2.21978348e-02   5.72392523e-03   4.12789680e-03
   2.57001930e-03   1.08917510e-03   4.18673031e-03   8.97434702e-04
   1.09568382e-04   9.82418482e-05   4.67420862e-05   3.65169903e-05
   7.01922026e-05   1.09593419e-05])
fallback 37593 to 'Expansion.Conjunction' ([  1.33169806e-05   8.16662358e-01   4.83258396e-02   2.72307280e-02
   2.29104344e-02   2.45887875e-02   7.87739723e-03   1.16366090e-02
   3.22523745e-02   2.66461443e-03   1.54283873e-03   7.76049261e-04
   8.39696893e-04   3.37085448e-04   1.83296131e-03   2.35366209e-04
   8.81971195e-05   8.00576368e-05   2.73409091e-05   2.44565177e-05
   3.80616105e-05   1.54285042e-05])
fallback 37492 to 'Expansion.Conjunction' ([  2.12141713e-05   3.51601003e-01   1.90305679e-01   1.66799872e-01
   5.59386497e-02   4.82799819e-02   5.28382210e-02   5.21591117e-02
   2.36067007e-02   2.71679348e-02   9.43532582e-03   5.02561962e-03
   4.34494203e-03   2.57926806e-03   7.19323845e-03   1.87551101e-03
   2.31267956e-04   2.08012439e-04   1.29277235e-04   6.83854230e-05
   1.57839356e-04   3.29435678e-05])
fallback 38205 to 'Expansion.Conjunction' ([  6.74269395e-05   6.75398949e-01   9.14040213e-02   6.21168877e-02
   3.44469884e-02   3.31876764e-02   2.05707458e-02   2.45748182e-02
   2.84005424e-02   1.02775479e-02   4.98356161e-03   1.97671075e-03
   2.98968192e-03   1.46735705e-03   5.70327000e-03   1.16981706e-03
   2.83184987e-04   2.94945961e-04   2.20944495e-04   9.46710866e-05
   2.15382593e-04   1.54868031e-04])
fallback 37148 to 'Expansion.Conjunction' ([  9.65081952e-08   9.78128057e-01   7.86704928e-03   7.69378091e-03
   9.19971365e-04   4.90812634e-04   1.18257417e-03   1.41693020e-03
   2.50591601e-04   1.22945346e-03   2.32312577e-04   2.96471955e-04
   1.17019930e-04   1.02544625e-05   1.31794336e-04   1.60859051e-05
   4.09152282e-06   3.88894880e-06   1.30832925e-06   4.09227997e-06
   2.67169862e-06   6.90490695e-07])
fallback 37749 to 'Expansion.Conjunction' ([  4.18816016e-05   3.51113968e-01   1.77715119e-01   1.44796056e-01
   6.49736063e-02   6.28844710e-02   5.23450699e-02   5.24377365e-02
   3.67813811e-02   2.23307251e-02   9.68849360e-03   4.35022815e-03
   4.96869431e-03   2.84506188e-03   9.43999904e-03   2.09598961e-03
   3.50925773e-04   2.69505364e-04   1.96874239e-04   9.07468111e-05
   2.09871850e-04   7.35955458e-05])
fallback 38643 to 'Expansion.Conjunction' ([  1.06505081e-06   8.35114659e-01   5.69974110e-02   5.14596739e-02
   9.42472556e-03   5.66550391e-03   1.02285696e-02   1.27029866e-02
   2.61169277e-03   8.64635223e-03   2.04529660e-03   2.23771273e-03
   1.07766665e-03   1.96124806e-04   1.22299185e-03   2.47228454e-04
   3.72453069e-05   2.83072095e-05   1.10602141e-05   1.84543351e-05
   2.20025777e-05   3.26970212e-06])
fallback 38649 to 'Expansion.Conjunction' ([  1.24249013e-07   9.74703958e-01   9.18501607e-03   8.77901345e-03
   1.06123997e-03   5.86072967e-04   1.34408775e-03   1.63235048e-03
   3.01498713e-04   1.43815459e-03   2.78647724e-04   3.47151680e-04
   1.32160697e-04   1.33533712e-05   1.57907676e-04   1.93564718e-05
   4.63333249e-06   4.72022198e-06   1.63594653e-06   4.73782889e-06
   3.32857686e-06   8.49820132e-07])
fallback 37599 to 'Expansion.Conjunction' ([  6.88708997e-06   3.83288706e-01   1.91197899e-01   1.78361175e-01
   4.39835408e-02   3.52404075e-02   4.91409965e-02   4.58839976e-02
   1.53408570e-02   3.07679060e-02   8.26102204e-03   5.77523551e-03
   3.71086289e-03   1.87136277e-03   5.35978742e-03   1.34168330e-03
   1.45653435e-04   1.16724388e-04   5.92175011e-05   4.51140543e-05
   9.00484943e-05   1.09159672e-05])
fallback 38915 to 'Expansion.Conjunction' ([  5.17824401e-06   5.48033047e-01   1.48125705e-01   1.28216025e-01
   3.18253778e-02   2.39845230e-02   3.27159941e-02   3.33497666e-02
   1.14153630e-02   2.29105050e-02   5.82383141e-03   4.33500428e-03
   2.64840777e-03   1.12233343e-03   4.19904422e-03   9.18969608e-04
   1.10913451e-04   9.67891735e-05   4.58273088e-05   3.67345702e-05
   7.01776210e-05   1.04824492e-05])
fallback 37799 to 'Expansion.Conjunction' ([  7.19879210e-07   8.98355552e-01   3.44563353e-02   3.30248478e-02
   5.53623685e-03   3.10974944e-03   6.14022796e-03   8.08984235e-03
   1.48290374e-03   5.12278271e-03   1.36372122e-03   1.53681416e-03
   7.01456862e-04   9.54052603e-05   7.44021330e-04   1.50425870e-04
   2.76094145e-05   1.90088924e-05   7.16324628e-06   1.68971875e-05
   1.56508033e-05   2.62715892e-06])
fallback 37888 to 'Expansion.Conjunction' ([  4.16377261e-05   5.98657190e-01   1.16529874e-01   8.84332432e-02
   3.84912304e-02   3.46307195e-02   2.75843925e-02   3.19964662e-02
   2.26580444e-02   1.67560465e-02   6.69776927e-03   2.99231987e-03
   3.57803702e-03   1.53808750e-03   6.94369477e-03   1.34008459e-03
   2.73531623e-04   2.54291604e-04   1.96839130e-04   8.78184072e-05
   2.15896027e-04   1.02784936e-04])
fallback 37873 to 'Expansion.Conjunction' ([  1.36573108e-05   3.93194258e-01   1.82914525e-01   1.60666048e-01
   4.98640909e-02   4.24116439e-02   4.74222600e-02   4.73898462e-02
   1.97740271e-02   2.77167055e-02   8.71117784e-03   5.16411894e-03
   3.86811420e-03   2.19854363e-03   6.48250383e-03   1.55354570e-03
   1.83699478e-04   1.70605053e-04   9.56447910e-05   5.90171111e-05
   1.23777106e-04   2.21904447e-05])
fallback 37361 to 'Expansion.Conjunction' ([  7.07978302e-07   8.83799101e-01   4.06212595e-02   3.69637619e-02
   6.31773909e-03   3.67664789e-03   6.91355272e-03   8.86698278e-03
   1.69219070e-03   6.15832506e-03   1.43175646e-03   1.59727100e-03
   7.61873285e-04   1.13875565e-04   8.41955620e-04   1.57139167e-04
   2.52130001e-05   2.03516635e-05   7.83001291e-06   1.42985631e-05
   1.56443916e-05   2.52266280e-06])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175480.ba+   1723624K    920725K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175480     rnn-rando+          2                         00:03:17      0:0 

Job 16175480 ("rnn-randomprojection-wikipedia") completed on c13-15 at tor dec 15 13:15:02 CET 2016
