Starting job 16175457 ("rnn-cw-wikipedia") on c13-26 at tor dec 15 13:02:48 CET 2016
Python environment is set up
Copying files to /work/jobs/16175457.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175457.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
EMBEDDING_PATH: /work/jobs/16175457.d/resources//word_embeddings/precompiled/c&w/size=50.merged
MODEL_PATH: /work/jobs/16175457.d/models/rnn-cw-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll15st-en-03-29-16-blind-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175457.d/resources//word_embeddings/precompiled/c&w/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:04] configuration (/work/jobs/16175457.d/models/rnn-cw-wikipedia/)
[2016-12-15 13:04]     config 'epochs': 200 (1000)
[2016-12-15 13:04]     config 'epochs_len': -1 (-1)
[2016-12-15 13:04]     config 'epochs_patience': 10 (20)
[2016-12-15 13:04]     config 'batch_size':  (64)
[2016-12-15 13:04]     config 'snapshot_size':  (2048)
[2016-12-15 13:04]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:04]     config 'words_dim': 20.0 (20)
[2016-12-15 13:04]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:04]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:04]     config 'final_dim': 40.0 (100)
[2016-12-15 13:04]     config 'arg1_len':  (100)
[2016-12-15 13:04]     config 'arg2_len':  (100)
[2016-12-15 13:04]     config 'conn_len':  (10)
[2016-12-15 13:04]     config 'punc_len':  (2)
[2016-12-15 13:04]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:04]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:04]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:04]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:04]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:04]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:04]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:04]     config 'words2vec_bin': None (None)
[2016-12-15 13:04]     config 'words2vec_txt': /work/jobs/16175457.d/resources//word_embeddings/precompiled/c&w/size=50.merged (None)
[2016-12-15 13:04]   args.lang: en
[2016-12-15 13:04]   args.model_dir: /work/jobs/16175457.d/models/rnn-cw-wikipedia/
[2016-12-15 13:04]   args.dataset_dir: /work/jobs/16175457.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
[2016-12-15 13:04]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll15st-en-03-29-16-blind-test/
[2016-12-15 13:04]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:04]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:04]   filter_types: None
[2016-12-15 13:04]   filter_senses: None
[2016-12-15 13:04]   filter_fn_name: conn_gt_0
[2016-12-15 13:04]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175457.d/resources//word_embeddings/precompiled/c&w/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:04] load dataset for prediction (/work/jobs/16175457.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:04] lang: ?, doc_ids: 71, words: 34621, rel_ids: 625, relation tokens: 25754
[2016-12-15 13:04]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:04] build model
[2016-12-15 13:04]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:04]     config 'optimizer':  (adam)
[2016-12-15 13:05] previous weights (/work/jobs/16175457.d/models/rnn-cw-wikipedia/)
[2016-12-15 13:05] convert from dataset (/work/jobs/16175457.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:05] make predictions
[2016-12-15 13:06] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll15st-en-03-29-16-blind-test/)
/work/jobs/16175457.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 917 to 'Expansion.Conjunction' ([  2.96799590e-05   2.86018556e-01   2.62743597e-01   1.90083209e-01
   6.47095007e-02   1.70630089e-02   5.06636137e-02   5.44509227e-02
   1.17274534e-02   1.96176417e-02   1.04840791e-02   1.02450794e-02
   9.69622116e-03   1.46344039e-03   8.38202812e-03   1.94878857e-03
   4.49482011e-04   1.03700159e-04   1.59570375e-05   1.61079009e-05
   4.19438410e-05   4.59891789e-05])
fallback 609 to 'Expansion.Conjunction' ([  1.77932925e-05   6.10387343e-01   9.69001455e-02   6.80191164e-02
   7.72123434e-02   3.01964515e-02   2.73406141e-02   3.37784263e-02
   2.05953574e-02   1.02496998e-02   3.35858539e-03   4.04869591e-03
   6.23253658e-03   2.41900871e-03   4.53575621e-03   3.66010015e-03
   7.47450475e-04   2.21722620e-04   2.53407678e-05   2.27059161e-05
   2.27805947e-05   8.02591081e-06])
fallback 404 to 'Expansion.Conjunction' ([  1.55354992e-05   6.45234225e-01   1.29621014e-01   1.04748919e-01
   2.79364231e-02   5.57867901e-03   2.48118396e-02   2.82876584e-02
   3.32317780e-03   9.86053233e-03   6.48607405e-03   4.04557352e-03
   4.66751725e-03   3.76793584e-04   3.87589749e-03   7.72289522e-04
   2.41792949e-04   5.97532815e-05   4.15447629e-06   1.08571457e-05
   2.12758786e-05   2.00172453e-05])
fallback 795 to 'Expansion.Conjunction' ([  5.10731079e-05   3.94097140e-01   1.80179800e-01   1.35292929e-01
   7.42025655e-02   2.34628817e-02   5.41039729e-02   4.72435083e-02
   1.82540375e-02   2.14199195e-02   9.66227310e-03   9.08092852e-03
   1.37959482e-02   3.10345219e-03   9.54113132e-03   4.50381765e-03
   1.45271009e-03   2.84343572e-04   5.11030690e-05   5.52691877e-05
   1.15704276e-04   4.54916469e-05])
fallback 334 to 'Expansion.Conjunction' ([  8.54700545e-07   9.76904464e-01   6.92508332e-03   7.99704353e-03
   1.76486072e-03   2.05247025e-04   1.86218813e-03   2.33662737e-03
   9.77878384e-05   7.03070438e-04   5.36757353e-04   1.36513323e-04
   2.60771547e-04   8.18405180e-06   1.62312850e-04   5.99340027e-05
   2.79729815e-05   6.78285104e-06   1.04203211e-07   1.37941892e-06
   1.42554019e-06   6.34752049e-07])
fallback 241 to 'Expansion.Conjunction' ([  3.74697120e-05   2.37315620e-01   1.48751629e-01   1.05724176e-01
   1.58897605e-01   9.22706184e-02   5.07335355e-02   5.30414608e-02
   8.79041908e-02   1.92382556e-02   5.02515388e-03   9.84778888e-03
   1.03694944e-02   5.96651610e-03   9.57880803e-03   3.59437422e-03
   1.22198879e-03   3.66169137e-04   4.51511287e-05   2.15378000e-05
   2.92348062e-05   1.92212825e-05])
fallback 119 to 'Expansion.Conjunction' ([  3.12038865e-05   3.77399324e-01   2.29753314e-01   1.65335014e-01
   5.54991474e-02   1.37914875e-02   4.35362568e-02   4.81239183e-02
   9.64101306e-03   1.78452320e-02   9.85135692e-03   9.03337538e-03
   9.06657144e-03   1.18794338e-03   7.53445128e-03   1.70405034e-03
   4.37326960e-04   1.08620675e-04   1.40643969e-05   1.79247799e-05
   4.56528176e-05   4.27510347e-05])
fallback 920 to 'Expansion.Conjunction' ([  1.03791685e-07   9.98105207e-01   3.04939918e-04   5.98860485e-04
   2.89978686e-04   1.44311604e-05   1.55582701e-04   4.39687536e-04
   2.58527070e-06   1.57964129e-05   2.57770620e-05   4.99243505e-06
   1.37426802e-05   2.59216444e-07   5.48137484e-06   1.82413729e-05
   1.69299934e-06   8.46255471e-07   4.24513251e-08   1.64364891e-06
   8.78035617e-08   1.92657104e-08])
fallback 840 to 'Expansion.Conjunction' ([  1.93229989e-05   5.18417832e-01   1.77367462e-01   1.44662752e-01
   3.59594931e-02   8.12693028e-03   3.40426301e-02   3.68239132e-02
   4.37767475e-03   1.25031349e-02   8.15815938e-03   5.80799482e-03
   6.09892044e-03   5.34312039e-04   5.65526118e-03   1.02185853e-03
   2.91402450e-04   6.56486149e-05   6.43215658e-06   1.20511085e-05
   2.00231296e-05   2.67911198e-05])
fallback 10 to 'Expansion.Conjunction' ([  2.84795879e-05   3.57601257e-01   1.43993855e-01   1.04094074e-01
   1.26500100e-01   6.41756954e-02   4.35197765e-02   4.99928484e-02
   5.24869936e-02   1.67428144e-02   5.14833072e-03   8.36813267e-03
   9.37042109e-03   4.42464512e-03   8.03939349e-03   3.97505799e-03
   1.11770106e-03   3.14832259e-04   3.84934248e-05   2.39373149e-05
   2.74831110e-05   1.56784118e-05])
fallback 354 to 'Expansion.Conjunction' ([  1.36075391e-08   9.98091165e-01   4.84268910e-04   6.61268251e-04
   1.89403873e-04   1.60557811e-05   2.04721932e-04   2.05983336e-04
   7.24883651e-06   6.25174000e-05   3.15692961e-05   6.22019345e-06
   1.70092390e-05   5.31609944e-07   9.39654914e-06   7.15531044e-06
   4.90101185e-06   4.78126767e-07   3.54571929e-09   6.38321753e-08
   1.98138928e-08   4.73497909e-09])
fallback 135 to 'Expansion.Conjunction' ([  4.09014729e-06   9.20577005e-01   2.64860936e-02   2.63843485e-02
   5.75874429e-03   7.99481246e-04   5.78034586e-03   7.18690001e-03
   4.07607883e-04   2.19146143e-03   1.86134552e-03   5.71697669e-04
   9.88546077e-04   3.97174087e-05   7.03887153e-04   1.59067774e-04
   6.40243754e-05   2.00333728e-05   5.15519909e-07   4.30879534e-06
   6.93476125e-06   3.84359880e-06])
fallback 707 to 'Expansion.Conjunction' ([  4.31783656e-06   9.13804156e-01   2.86592202e-02   2.91586885e-02
   5.95047407e-03   8.59034814e-04   6.36294752e-03   7.72831016e-03
   4.00375422e-04   2.31309324e-03   2.00404130e-03   6.22283947e-04
   1.04193667e-03   3.98983386e-05   7.84810734e-04   1.65348506e-04
   6.59801577e-05   1.96421821e-05   5.77542767e-07   4.29301591e-06
   6.44599992e-06   4.12345336e-06])
fallback 311 to 'Expansion.Conjunction' ([  2.05596233e-08   9.99396704e-01   9.52193244e-05   1.97686245e-04
   7.05827203e-05   2.47476470e-06   3.44561712e-05   1.84231529e-04
   2.80521539e-07   3.03667350e-06   7.64961004e-06   8.34016267e-07
   2.70863194e-06   5.10979714e-08   1.63659926e-06   1.83832939e-06
   1.22302683e-07   1.09077535e-07   4.00992803e-09   3.44013053e-07
   6.81205552e-09   3.02277943e-09])
fallback 24 to 'Expansion.Conjunction' ([  3.79996266e-07   9.95645065e-01   4.42569647e-04   1.66141853e-04
   2.61227233e-03   3.26572807e-04   4.69758024e-05   3.92789611e-04
   2.87580047e-04   1.39718052e-05   6.06966353e-06   3.68358617e-06
   1.51431280e-05   8.62654923e-06   7.10551390e-06   2.36756991e-05
   1.95587976e-07   8.43619960e-07   4.29561710e-08   1.76447120e-07
   1.09229762e-07   8.79543744e-09])
fallback 308 to 'Expansion.Conjunction' ([  1.47537230e-06   9.69944577e-01   9.12228768e-03   1.09084060e-02
   1.97852515e-03   2.35039605e-04   2.33487827e-03   3.06136923e-03
   8.61272548e-05   7.52805601e-04   7.59490343e-04   1.61087938e-04
   3.28441057e-04   7.81990987e-06   2.29273933e-04   5.36838587e-05
   2.27548203e-05   6.75732040e-06   1.68799769e-07   1.69256017e-06
   2.24627384e-06   1.09157302e-06])
fallback 590 to 'Expansion.Conjunction' ([  2.48723754e-05   3.37723439e-01   2.44699258e-01   1.84587273e-01
   5.63466334e-02   1.41286731e-02   4.69166122e-02   5.06248630e-02
   8.97200139e-03   1.77161473e-02   9.97277084e-03   8.95307319e-03
   8.49158050e-03   1.09237632e-03   7.54437933e-03   1.63259604e-03
   3.90797888e-04   8.67745415e-05   1.16874691e-05   1.37358859e-05
   3.13421483e-05   3.91133987e-05])
fallback 137 to 'Expansion.Conjunction' ([  6.53522136e-07   9.91447069e-01   2.07459852e-03   3.20788582e-03
   6.54245247e-04   4.49196040e-05   6.09338445e-04   1.36888886e-03
   1.30173609e-05   1.85277745e-04   1.90029790e-04   4.26846409e-05
   7.96312798e-05   1.45232670e-06   3.84311525e-05   3.00996683e-05
   6.31579437e-06   2.85029744e-06   6.16370799e-08   1.57066753e-06
   5.80319623e-07   3.98139795e-07])
fallback 694 to 'Expansion.Conjunction' ([  2.84109610e-05   3.53495859e-01   1.40924525e-01   1.01223318e-01
   1.30485040e-01   6.77416013e-02   4.31112378e-02   4.98980721e-02
   5.64852122e-02   1.65486109e-02   4.97088106e-03   8.15758466e-03
   9.16430429e-03   4.50303536e-03   7.92413096e-03   3.83805034e-03
   1.07704345e-03   3.22060566e-04   3.67644418e-05   2.26133975e-05
   2.65001176e-05   1.51432356e-05])
fallback 553 to 'Expansion.Conjunction' ([  2.32203593e-06   9.47653553e-01   1.09300541e-02   5.53224527e-03
   1.91808515e-02   4.53186511e-03   1.92821391e-03   5.02217665e-03
   2.94054679e-03   5.50015900e-04   2.26300404e-04   1.54916710e-04
   4.00229453e-04   2.05260226e-04   3.13804637e-04   3.84559543e-04
   1.60814710e-05   2.11248921e-05   1.13125216e-06   2.56946492e-06
   1.92899556e-06   2.49077550e-07])
fallback 696 to 'Expansion.Conjunction' ([  6.74980947e-06   8.64718369e-01   4.68752529e-02   4.22390919e-02
   1.05140516e-02   1.68332479e-03   9.81351910e-03   1.14466789e-02
   9.18515134e-04   3.83081842e-03   3.06275112e-03   1.14966602e-03
   1.80622899e-03   1.02154713e-04   1.37176876e-03   2.87390195e-04
   1.14402835e-04   3.20804935e-05   1.08184974e-06   6.71783430e-06
   1.20162985e-05   7.36906115e-06])
fallback 569 to 'Expansion.Conjunction' ([  5.12416009e-05   2.63161119e-01   2.61434164e-01   1.77681012e-01
   7.52737512e-02   2.14536820e-02   5.24255142e-02   5.75348168e-02
   1.67686285e-02   2.22892311e-02   1.12233132e-02   1.22270173e-02
   1.26383862e-02   2.27253997e-03   9.76643512e-03   2.75929408e-03
   6.46384890e-04   1.71384510e-04   3.22273695e-05   2.95620189e-05
   9.27630596e-05   6.75319161e-05])
fallback 565 to 'Expansion.Conjunction' ([  2.00883442e-05   5.67598119e-01   1.07497583e-01   7.62607251e-02
   8.33291433e-02   3.35114272e-02   3.09639339e-02   3.68831689e-02
   2.32796321e-02   1.17588391e-02   3.83661790e-03   4.81323258e-03
   7.08523970e-03   2.76160527e-03   5.21534788e-03   3.97455749e-03
   8.79116903e-04   2.40905013e-04   2.98059830e-05   2.52628622e-05
   2.58547304e-05   9.79380754e-06])
fallback 602 to 'Expansion.Conjunction' ([  1.90525625e-05   5.89693475e-01   1.46843967e-01   1.26691726e-01
   2.93588986e-02   6.79079104e-03   3.10490200e-02   3.15541246e-02
   2.97614880e-03   1.04108162e-02   7.66343841e-03   4.61735381e-03
   5.26831009e-03   4.21156866e-04   5.34046338e-03   9.01367847e-04
   2.78294401e-04   5.95149310e-05   6.16697240e-06   1.30501027e-05
   1.78822898e-05   2.49808376e-05])
fallback 87 to 'Expansion.Conjunction' ([  5.18955130e-05   2.81177012e-01   1.79950162e-01   1.36222779e-01
   1.07463560e-01   5.02177473e-02   6.07881914e-02   5.52474405e-02
   3.83616460e-02   2.51533313e-02   8.89331189e-03   1.31912650e-02
   1.57401039e-02   5.92086879e-03   1.15360002e-02   6.86302450e-03
   2.52494587e-03   3.97371678e-04   1.05032908e-04   6.43816306e-05
   8.55453175e-05   4.43835885e-05])
fallback 593 to 'Expansion.Conjunction' ([  2.40707523e-05   5.63805533e-01   1.57028246e-01   1.18805530e-01
   3.95053634e-02   8.56088586e-03   3.13499093e-02   3.50092583e-02
   5.81164252e-03   1.27736910e-02   7.77346192e-03   5.41102339e-03
   6.54518246e-03   7.04463005e-04   5.12053363e-03   1.21813992e-03
   3.61022606e-04   9.41203637e-05   8.31931193e-06   1.74935689e-05
   4.29421607e-05   2.91668063e-05])
fallback 581 to 'Expansion.Conjunction' ([  1.28181291e-05   7.04380319e-01   1.07214061e-01   8.93136244e-02
   2.26781624e-02   4.31154892e-03   2.07556649e-02   2.37427051e-02
   2.46322709e-03   8.15329684e-03   5.63000038e-03   3.15524794e-03
   3.82369493e-03   2.77046429e-04   3.17186716e-03   6.16451014e-04
   2.03300263e-04   5.07840294e-05   3.02972233e-06   9.52147346e-06
   1.74939265e-05   1.61350159e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175457.ba+   1628008K    825144K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175457     rnn-cw-wi+          2                         00:03:57      0:0 

Job 16175457 ("rnn-cw-wikipedia") completed on c13-26 at tor dec 15 13:06:42 CET 2016
