Starting job 16175478 ("rnn-glove-wikipedia") on c31-8 at tor dec 15 13:11:49 CET 2016
Python environment is set up
Copying files to /work/jobs/16175478.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175478.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16175478.d/resources//word_embeddings/precompiled/glove/size=50.embeddings
MODEL_PATH: /work/jobs/16175478.d/models/rnn-glove-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175478.d/resources//word_embeddings/precompiled/glove/size=50.embeddings", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:12] configuration (/work/jobs/16175478.d/models/rnn-glove-wikipedia/)
[2016-12-15 13:12]     config 'epochs': 200 (1000)
[2016-12-15 13:12]     config 'epochs_len': -1 (-1)
[2016-12-15 13:12]     config 'epochs_patience': 10 (20)
[2016-12-15 13:12]     config 'batch_size':  (64)
[2016-12-15 13:12]     config 'snapshot_size':  (2048)
[2016-12-15 13:12]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:12]     config 'words_dim': 20.0 (20)
[2016-12-15 13:12]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:12]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:12]     config 'final_dim': 40.0 (100)
[2016-12-15 13:12]     config 'arg1_len':  (100)
[2016-12-15 13:12]     config 'arg2_len':  (100)
[2016-12-15 13:12]     config 'conn_len':  (10)
[2016-12-15 13:12]     config 'punc_len':  (2)
[2016-12-15 13:12]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:12]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:12]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:12]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:12]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:12]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:12]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:12]     config 'words2vec_bin': None (None)
[2016-12-15 13:12]     config 'words2vec_txt': /work/jobs/16175478.d/resources//word_embeddings/precompiled/glove/size=50.embeddings (None)
[2016-12-15 13:12]   args.lang: en
[2016-12-15 13:12]   args.model_dir: /work/jobs/16175478.d/models/rnn-glove-wikipedia/
[2016-12-15 13:12]   args.dataset_dir: /work/jobs/16175478.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-15 13:12]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll16st-en-03-29-16-test/
[2016-12-15 13:12]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:12]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:12]   filter_types: None
[2016-12-15 13:12]   filter_senses: None
[2016-12-15 13:12]   filter_fn_name: conn_gt_0
[2016-12-15 13:12]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175478.d/resources//word_embeddings/precompiled/glove/size=50.embeddings', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:12] load dataset for prediction (/work/jobs/16175478.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:12] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-15 13:12]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:12] build model
[2016-12-15 13:12]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:12]     config 'optimizer':  (adam)
[2016-12-15 13:12] previous weights (/work/jobs/16175478.d/models/rnn-glove-wikipedia/)
[2016-12-15 13:12] convert from dataset (/work/jobs/16175478.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:12] make predictions
[2016-12-15 13:14] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-conll16st-en-03-29-16-test/)
/work/jobs/16175478.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 37814 to 'Expansion.Conjunction' ([  1.85185570e-06   4.84015643e-01   1.71607301e-01   1.21904850e-01
   4.94701154e-02   1.48717519e-02   7.12225362e-02   4.49960045e-02
   9.49099194e-03   1.08761694e-02   5.09985583e-03   6.75428705e-03
   4.06190101e-03   7.22977100e-04   2.89451331e-03   1.46692037e-03
   4.56792419e-04   3.40333208e-05   7.33495380e-06   2.06673467e-05
   1.46090715e-05   8.89312104e-06])
fallback 37361 to 'Expansion.Conjunction' ([  1.58311991e-07   9.10787280e-01   3.12721504e-02   2.52523440e-02
   7.35319961e-03   1.32772850e-03   1.15109914e-02   7.26122824e-03
   1.09220854e-03   1.53835082e-03   5.11448595e-04   9.28721153e-04
   4.78798376e-04   3.81921598e-05   4.33485574e-04   1.22118435e-04
   7.82732746e-05   6.39148581e-06   8.05638531e-07   3.43821874e-06
   1.63617584e-06   1.05135006e-06])
fallback 37830 to 'Expansion.Conjunction' ([  2.98973305e-06   7.19985912e-01   1.15477936e-01   3.62501671e-02
   3.81723573e-02   1.99637248e-02   1.44124480e-02   1.72622858e-02
   2.26585645e-02   5.91773921e-03   2.35887131e-03   1.04733511e-03
   2.54832212e-03   1.99279998e-04   2.63685713e-03   9.29313259e-04
   1.37469311e-04   6.55121139e-06   6.77839908e-06   1.35183966e-05
   8.26207827e-06   3.31682445e-06])
fallback 38705 to 'Expansion.Conjunction' ([  1.75067930e-06   6.05708523e-01   1.30919900e-01   9.19094657e-02
   3.75833017e-02   1.03562844e-02   5.36576756e-02   3.64368176e-02
   7.32346651e-03   8.20240077e-03   4.48584545e-03   5.65083868e-03
   3.18730754e-03   5.58419720e-04   2.29423534e-03   1.20819496e-03
   4.32734628e-04   3.65155710e-05   6.48846463e-06   2.10198626e-05
   1.10346524e-05   7.77906259e-06])
fallback 38300 to 'Expansion.Conjunction' ([  5.91220239e-10   9.99611078e-01   8.54791577e-05   4.57020405e-06
   1.37330280e-04   4.15463036e-05   2.14388342e-06   2.12897953e-06
   1.12823996e-04   9.97135315e-07   3.92074390e-08   1.36141878e-07
   7.25882727e-07   7.30936661e-08   7.67154403e-07   5.18605354e-08
   1.04580678e-07   7.21386228e-10   2.49378073e-10   1.38900802e-09
   4.20842610e-10   4.12737399e-10])
fallback 38115 to 'Expansion.Conjunction' ([  8.50981849e-07   7.62382665e-01   8.33582930e-02   2.04169596e-02
   4.30289942e-02   2.50863333e-02   8.43713596e-03   1.08610249e-02
   3.81592874e-02   3.41421939e-03   7.19499755e-04   5.47953634e-04
   1.58227231e-03   1.78368961e-04   1.43754152e-03   3.21179416e-04
   5.17777029e-05   2.52715101e-06   1.55887297e-06   6.01778294e-06
   4.37233927e-06   1.16640021e-06])
fallback 38808 to 'Expansion.Conjunction' ([  1.35207301e-06   4.84940712e-01   1.98741900e-01   1.07709863e-01
   5.26567702e-02   1.84811951e-02   5.67844030e-02   3.89568399e-02
   1.38306442e-02   9.91028369e-03   3.83248672e-03   3.52913912e-03
   4.87625184e-03   5.06784480e-04   3.77712169e-03   1.18691801e-03
   2.24389167e-04   1.79675664e-05   6.04483471e-06   1.20327160e-05
   1.02090927e-05   6.69233674e-06])
fallback 37799 to 'Expansion.Conjunction' ([  1.87080559e-07   9.14151975e-01   2.91580933e-02   2.42996609e-02
   7.21432602e-03   1.26064058e-03   1.13034426e-02   7.33400097e-03
   1.04747818e-03   1.51045878e-03   5.54406963e-04   1.03402756e-03
   4.51964185e-04   4.13599632e-05   4.04184805e-04   1.28354587e-04
   9.05872593e-05   7.30935479e-06   8.37915772e-07   3.94321436e-06
   1.68894225e-06   1.07127529e-06])
fallback 38401 to 'Expansion.Conjunction' ([  4.32986952e-10   9.99710776e-01   8.29360924e-05   1.37497697e-04
   1.71692496e-05   1.16551095e-06   2.22084741e-05   2.00613317e-05
   1.06811612e-06   4.47718857e-06   3.93256235e-07   1.16523094e-06
   3.85854511e-07   7.52143753e-09   3.94087087e-07   5.09619713e-08
   1.87900436e-07   4.07801961e-08   2.79332440e-10   1.17565297e-08
   1.31344233e-09   1.06129714e-09])
fallback 38499 to 'Expansion.Conjunction' ([  2.75265869e-11   9.99972921e-01   5.96486950e-06   2.14250373e-07
   1.16530489e-05   2.30569863e-06   1.35089036e-07   9.33796454e-08
   6.56504277e-06   5.28079686e-08   9.60023598e-10   5.68523218e-09
   3.54500813e-08   2.11059122e-09   4.03073585e-08   2.33962290e-09
   7.84082473e-09   3.68821702e-11   6.85060242e-12   4.19647087e-11
   9.43122125e-12   1.84327775e-11])
fallback 37148 to 'Expansion.Conjunction' ([  4.29185937e-10   9.99552907e-01   1.31982743e-04   2.10175553e-04
   2.61861842e-05   1.86501120e-06   3.54167606e-05   2.94271813e-05
   1.51374968e-06   6.54048655e-06   5.84845510e-07   1.80640905e-06
   6.13281203e-07   1.16333148e-08   6.03160857e-07   8.36570423e-08
   2.15920565e-07   4.81566183e-08   3.56696479e-10   1.44555985e-08
   1.53659574e-09   1.19766586e-09])
fallback 37310 to 'Expansion.Conjunction' ([  1.14863866e-07   9.43531314e-01   1.90594118e-02   1.67251673e-02
   4.71300016e-03   7.35766355e-04   7.20282721e-03   4.77303694e-03
   6.32179538e-04   9.54959695e-04   3.21999185e-04   6.60713340e-04
   2.70328129e-04   2.17861557e-05   2.53902539e-04   7.49897865e-05
   5.87746677e-05   4.98583711e-06   4.68951431e-07   2.67284253e-06
   9.87506020e-07   6.13443647e-07])
fallback 38205 to 'Expansion.Conjunction' ([  2.78078983e-06   5.65460077e-01   1.70127762e-01   5.17057731e-02
   6.33555492e-02   3.77219612e-02   2.09767536e-02   2.49348596e-02
   4.49375988e-02   8.42682446e-03   2.55898382e-03   1.41805676e-03
   3.68181750e-03   3.34474078e-04   3.14306719e-03   1.03559716e-03
   1.38222107e-04   5.27050807e-06   5.85251146e-06   1.33177198e-05
   1.20201901e-05   3.38079002e-06])
fallback 38620 to 'Expansion.Conjunction' ([  4.31605649e-08   9.78387363e-01   7.10752705e-03   7.02498951e-03
   1.77520666e-03   2.16490591e-04   2.56450825e-03   1.80470176e-03
   2.02586992e-04   3.41014735e-04   9.88008331e-05   2.46302663e-04
   8.55716432e-05   5.39690249e-06   8.89552473e-05   2.28092196e-05
   2.36544476e-05   2.24046700e-06   1.35247135e-07   1.19694472e-06
   3.16680970e-07   1.88020239e-07])
fallback 38437 to 'Expansion.Conjunction' ([  1.87362753e-06   3.83492293e-01   2.06376122e-01   1.45704568e-01
   5.95792535e-02   1.94192046e-02   8.55136668e-02   5.12385446e-02
   1.14589371e-02   1.30908788e-02   5.46225303e-03   7.30675463e-03
   4.83578400e-03   8.67185595e-04   3.42216345e-03   1.69406448e-03
   4.50513416e-04   3.14953142e-05   7.87602953e-06   1.95877620e-05
   1.72606743e-05   9.71949527e-06])
fallback 38643 to 'Expansion.Conjunction' ([  3.94635038e-07   8.14645505e-01   6.47032540e-02   4.89671663e-02
   1.60732805e-02   3.52839207e-03   2.45797068e-02   1.54554765e-02
   2.68110066e-03   3.39325694e-03   1.24194842e-03   1.97965739e-03
   1.16161114e-03   1.17569889e-04   9.64133274e-04   3.28839311e-04
   1.50249481e-04   1.30212917e-05   1.94896182e-06   7.08297764e-06
   3.82278757e-06   2.58116681e-06])
fallback 38226 to 'Expansion.Conjunction' ([  1.80320612e-07   8.95194625e-01   3.75621495e-02   2.89922162e-02
   8.74988804e-03   1.68791816e-03   1.32285716e-02   8.38330551e-03
   1.39078191e-03   1.80300611e-03   5.84835112e-04   9.96258315e-04
   6.02978381e-04   4.59903082e-05   5.38107575e-04   1.44204456e-04
   8.04908246e-05   6.74673156e-06   9.36508146e-07   3.70277520e-06
   1.87590792e-06   1.23085132e-06])
fallback 38640 to 'Expansion.Conjunction' ([  1.36484744e-06   6.58996646e-01   1.23925977e-01   3.33576167e-02
   5.69480214e-02   3.45862473e-02   1.37761171e-02   1.71000809e-02
   4.80917583e-02   5.50816258e-03   1.27306209e-03   9.00799414e-04
   2.47551269e-03   2.61011564e-04   2.15900109e-03   5.38568714e-04
   7.61868582e-05   3.42985279e-06   2.55392548e-06   8.59029211e-06
   7.45470520e-06   1.83690123e-06])
fallback 38649 to 'Expansion.Conjunction' ([  6.63091582e-10   9.99471438e-01   1.59246645e-04   2.43629768e-04
   3.12310080e-05   2.34403959e-06   4.15310320e-05   3.53538785e-05
   2.00316483e-06   8.07968636e-06   7.62950046e-07   2.19510619e-06
   8.37446133e-07   1.58387527e-08   8.41812504e-07   1.11307679e-07
   2.91313572e-07   6.16540497e-08   5.70836274e-10   1.99101005e-08
   2.41439738e-09   1.87634310e-09])
fallback 38787 to 'Expansion.Conjunction' ([  5.87649929e-11   9.99951704e-01   1.10820427e-05   4.45042097e-07
   2.01709241e-05   4.22434680e-06   2.60088593e-07   1.90989195e-07
   1.16138934e-05   1.05368079e-07   2.21729520e-09   1.23273967e-08
   7.63815878e-08   4.71895226e-09   8.69575757e-08   5.16387813e-09
   1.55529720e-08   7.82239885e-11   1.61690519e-11   9.48429305e-11
   2.34827501e-11   3.99537376e-11])
fallback 37593 to 'Expansion.Conjunction' ([  1.22802324e-09   9.99157510e-01   2.20441381e-04   1.46300803e-05
   2.90952920e-04   8.46333806e-05   7.03434595e-06   6.52290251e-06
   2.09713869e-04   2.95480101e-06   1.40664045e-07   4.01014242e-07
   2.15129585e-06   1.95534572e-07   2.29788093e-06   1.74369934e-07
   2.35709740e-07   2.21502288e-09   6.57120317e-10   3.13177824e-09
   1.15923018e-09   1.05453304e-09])
fallback 38080 to 'Expansion.Conjunction' ([  3.44972409e-06   2.90350351e-01   2.35535684e-01   1.56003864e-01
   7.24840693e-02   2.73481741e-02   9.23672328e-02   6.06691359e-02
   1.55667878e-02   1.60556996e-02   8.23807818e-03   9.18833082e-03
   6.74696413e-03   1.51286986e-03   4.56232955e-03   2.63331041e-03
   6.15135482e-04   4.21953086e-05   1.19844245e-05   2.80816933e-05
   2.29021755e-05   1.33704845e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175478.ba+   1734304K    921020K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175478     rnn-glove+          2                         00:02:31      0:0 

Job 16175478 ("rnn-glove-wikipedia") completed on c31-8 at tor dec 15 13:14:17 CET 2016
