Starting job 16175461 ("rnn-hpca-wikipedia") on c16-31 at tor dec 15 13:03:47 CET 2016
Python environment is set up
Copying files to /work/jobs/16175461.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175461.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
EMBEDDING_PATH: /work/jobs/16175461.d/resources//word_embeddings/precompiled/hpca/size=50.merged
MODEL_PATH: /work/jobs/16175461.d/models/rnn-hpca-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-hpca-wikipedia-conll15st-en-03-29-16-blind-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175461.d/resources//word_embeddings/precompiled/hpca/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:05] configuration (/work/jobs/16175461.d/models/rnn-hpca-wikipedia/)
[2016-12-15 13:05]     config 'epochs': 200 (1000)
[2016-12-15 13:05]     config 'epochs_len': -1 (-1)
[2016-12-15 13:05]     config 'epochs_patience': 10 (20)
[2016-12-15 13:05]     config 'batch_size':  (64)
[2016-12-15 13:05]     config 'snapshot_size':  (2048)
[2016-12-15 13:05]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:05]     config 'words_dim': 20.0 (20)
[2016-12-15 13:05]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:05]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:05]     config 'final_dim': 40.0 (100)
[2016-12-15 13:05]     config 'arg1_len':  (100)
[2016-12-15 13:05]     config 'arg2_len':  (100)
[2016-12-15 13:05]     config 'conn_len':  (10)
[2016-12-15 13:05]     config 'punc_len':  (2)
[2016-12-15 13:05]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:05]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:05]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:05]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:05]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:05]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:05]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:05]     config 'words2vec_bin': None (None)
[2016-12-15 13:05]     config 'words2vec_txt': /work/jobs/16175461.d/resources//word_embeddings/precompiled/hpca/size=50.merged (None)
[2016-12-15 13:05]   args.lang: en
[2016-12-15 13:05]   args.model_dir: /work/jobs/16175461.d/models/rnn-hpca-wikipedia/
[2016-12-15 13:05]   args.dataset_dir: /work/jobs/16175461.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
[2016-12-15 13:05]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-hpca-wikipedia-conll15st-en-03-29-16-blind-test/
[2016-12-15 13:05]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:05]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:05]   filter_types: None
[2016-12-15 13:05]   filter_senses: None
[2016-12-15 13:05]   filter_fn_name: conn_gt_0
[2016-12-15 13:05]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175461.d/resources//word_embeddings/precompiled/hpca/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:05] load dataset for prediction (/work/jobs/16175461.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:05] lang: ?, doc_ids: 71, words: 34621, rel_ids: 625, relation tokens: 25754
[2016-12-15 13:05]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:05] build model
[2016-12-15 13:05]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:06]     config 'optimizer':  (adam)
[2016-12-15 13:06] previous weights (/work/jobs/16175461.d/models/rnn-hpca-wikipedia/)
[2016-12-15 13:06] convert from dataset (/work/jobs/16175461.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:06] make predictions
[2016-12-15 13:07] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-hpca-wikipedia-conll15st-en-03-29-16-blind-test/)
/work/jobs/16175461.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 920 to 'Expansion.Conjunction' ([  3.05702963e-11   9.96814616e-01   1.47482917e-03   9.50590773e-04
   1.52362817e-04   1.81312445e-05   2.50897110e-04   2.78221707e-04
   3.75971106e-06   4.77125381e-06   3.51881466e-05   4.85772220e-06
   1.04826978e-05   2.06437411e-08   8.88703091e-07   2.87505318e-07
   8.74371658e-08   1.59313175e-09   3.13613582e-10   1.67900850e-09
   3.64441896e-10   2.96452110e-09])
fallback 467 to 'Expansion.Conjunction' ([  5.64054801e-07   4.03065294e-01   1.27887934e-01   5.45283853e-02
   1.52317643e-01   7.03426822e-02   1.40613550e-02   3.45047712e-02
   1.20333925e-01   8.65521467e-03   2.76187411e-03   2.69328453e-03
   2.62116780e-03   2.23084143e-03   2.54325266e-03   1.18777552e-03
   1.10775574e-04   3.24436841e-05   1.36029266e-05   6.36316981e-05
   3.10135947e-05   1.25683236e-05])
fallback 354 to 'Expansion.Conjunction' ([  2.51489503e-13   9.99859204e-01   6.44682653e-05   3.45892837e-05
   1.99268777e-05   1.25352675e-06   5.62894315e-06   1.32548447e-05
   6.24335024e-07   1.32491435e-07   4.99921152e-07   9.34404687e-08
   2.94156021e-07   7.18626041e-10   2.07563404e-08   7.63743283e-09
   4.61860740e-10   2.07467288e-11   1.30794081e-11   7.89662425e-11
   1.06459866e-11   5.47930238e-11])
fallback 715 to 'Expansion.Conjunction' ([  7.07183290e-07   3.24385076e-01   1.73983097e-01   7.27415679e-02
   1.46264269e-01   7.37171394e-02   2.16869879e-02   4.24107647e-02
   1.10777698e-01   1.25316418e-02   4.20674680e-03   4.32548391e-03
   4.42493426e-03   2.54995817e-03   3.71846020e-03   1.92097248e-03
   1.70329876e-04   4.03394259e-05   1.55545058e-05   7.99075712e-05
   3.20378421e-05   1.63262920e-05])
fallback 241 to 'Expansion.Conjunction' ([  2.55323243e-07   7.42842180e-01   4.45540053e-02   1.94197404e-02
   8.34499354e-02   2.81600573e-02   3.91739924e-03   1.41858157e-02
   5.70583293e-02   2.45224865e-03   7.99916782e-04   6.35761345e-04
   6.93025924e-04   7.98087606e-04   6.15407058e-04   3.31541574e-04
   2.48259852e-05   1.33683822e-05   5.41371797e-06   2.23125457e-05
   1.61923050e-05   4.18039862e-06])
fallback 602 to 'Expansion.Conjunction' ([  5.81257382e-07   3.08079149e-01   2.82635774e-01   1.74659056e-01
   4.04293643e-02   2.04437223e-02   6.69980710e-02   5.28910711e-02
   5.81685166e-03   1.12755176e-02   1.84268334e-02   6.35279846e-03
   7.35092013e-03   5.27604301e-04   2.55938080e-03   9.49226131e-04
   5.23812654e-04   3.55055412e-05   2.50182548e-06   1.65679828e-05
   6.15192394e-06   1.95386926e-05])
fallback 87 to 'Expansion.Conjunction' ([  3.23333012e-07   8.04090512e-01   4.21439825e-02   1.76514818e-02
   5.78062096e-02   1.99261963e-02   4.42883844e-03   1.13810628e-02
   3.55233295e-02   2.57205036e-03   8.53886608e-04   7.76559009e-04
   9.58286065e-04   6.87149829e-04   6.65702983e-04   4.43105476e-04
   2.26153774e-05   1.36106403e-05   6.39879281e-06   2.69223532e-05
   1.68239788e-05   4.95254160e-06])
fallback 609 to 'Expansion.Conjunction' ([  2.73950707e-09   9.82918980e-01   2.92422390e-03   1.13697979e-03
   7.40250947e-03   1.42170419e-03   1.79930751e-04   8.06571219e-04
   3.00936425e-03   8.15875467e-05   2.76195188e-05   1.80778425e-05
   3.07184419e-05   1.88129052e-05   1.19367651e-05   9.29358796e-06
   2.10304237e-07   1.70096456e-07   1.63126657e-07   7.63981691e-07
   2.86990571e-07   9.23043191e-08])
fallback 707 to 'Expansion.Conjunction' ([  1.01025313e-08   9.36427948e-01   2.86095141e-02   1.75478868e-02
   3.20440367e-03   7.42630390e-04   5.62663793e-03   5.38938258e-03
   1.76340923e-04   3.08206391e-04   1.20485609e-03   2.62163957e-04
   3.78408235e-04   4.08474897e-06   8.02883293e-05   2.21121699e-05
   1.39044550e-05   4.88408658e-07   4.29194456e-08   2.17826183e-07
   8.78512406e-08   3.84520318e-07])
fallback 593 to 'Expansion.Conjunction' ([  1.54563921e-07   3.17364601e-01   2.97146855e-01   1.45472794e-01
   5.96158464e-02   2.52776331e-02   4.91532010e-02   5.55865426e-02
   1.38541431e-02   1.02415187e-02   1.18029657e-02   4.37147261e-03
   6.08193079e-03   3.94834407e-04   2.36790742e-03   9.96432028e-04
   2.26926086e-04   1.64082884e-05   1.97544499e-06   1.44956993e-05
   3.31933095e-06   8.04264978e-06])
fallback 581 to 'Expansion.Conjunction' ([  1.44501882e-07   4.90624931e-01   2.24487810e-01   1.21499575e-01
   3.49025910e-02   1.35733698e-02   4.21073732e-02   4.12630361e-02
   5.06566554e-03   5.75925545e-03   1.09757138e-02   3.17145439e-03
   4.42730446e-03   1.59552232e-04   1.36789120e-03   4.19070388e-04
   1.69799342e-04   1.03034544e-05   1.12432132e-06   6.91176042e-06
   1.82071027e-06   5.30274652e-06])
fallback 311 to 'Expansion.Conjunction' ([  8.20772617e-12   9.99085361e-01   3.75285481e-04   3.09747147e-04
   4.23910021e-05   4.47982254e-06   8.95469197e-05   7.60550534e-05
   5.41086305e-07   1.13354326e-06   1.05852350e-05   1.10118742e-06
   3.53188782e-06   5.84065415e-09   1.50684470e-07   6.24985287e-08
   1.90018435e-08   3.55455441e-10   9.99812241e-11   6.22810633e-10
   1.03464334e-10   1.17806075e-09])
fallback 696 to 'Expansion.Conjunction' ([  1.86602467e-08   8.24227198e-01   8.19233268e-02   4.38563033e-02
   1.07920009e-02   3.10515746e-03   1.36030873e-02   1.50671133e-02
   1.12621531e-03   1.10627662e-03   2.83050834e-03   8.20449363e-04
   1.12478293e-03   1.89082035e-05   2.72943808e-04   8.53351214e-05
   3.71860617e-05   1.17618024e-06   1.36867581e-07   7.80804654e-07
   2.38334389e-07   8.56485241e-07])
fallback 135 to 'Expansion.Conjunction' ([  4.55241400e-09   9.47143022e-01   2.44367552e-02   1.43403076e-02
   2.77561556e-03   6.02423856e-04   4.32779688e-03   4.55666894e-03
   1.63637073e-04   2.24082382e-04   8.67594852e-04   1.90446110e-04
   2.88288605e-04   2.53265831e-06   5.61313466e-05   1.58887506e-05
   8.13877981e-06   2.47036213e-07   2.56883245e-08   1.34122587e-07
   4.66611001e-08   2.11075091e-07])
fallback 24 to 'Expansion.Conjunction' ([  2.24029448e-10   9.94861910e-01   4.81872358e-04   1.64052211e-04
   2.48031646e-03   3.87552954e-04   1.78699885e-05   1.89092157e-04
   1.39675093e-03   9.76163491e-06   2.71431102e-06   1.57588353e-06
   2.33815174e-06   2.21651023e-06   8.76898874e-07   9.44468021e-07
   1.05514949e-08   1.35849253e-08   1.88475690e-08   8.13969201e-08
   2.51049725e-08   5.84210196e-09])
fallback 795 to 'Expansion.Conjunction' ([  3.54997752e-07   5.12921164e-01   1.65496054e-01   6.99616311e-02
   8.73405354e-02   3.80013704e-02   2.01753717e-02   3.65807421e-02
   4.48558153e-02   8.61480941e-03   4.11761839e-03   3.19816132e-03
   3.97828974e-03   9.52435035e-04   2.31089610e-03   1.28906875e-03
   1.20076448e-04   2.31029230e-05   6.47002265e-06   3.43612307e-05
   1.18828095e-05   9.78829139e-06])
fallback 553 to 'Expansion.Conjunction' ([  2.84530177e-10   9.94742793e-01   6.71417382e-04   2.29892142e-04
   2.57674856e-03   4.00019715e-04   2.88256555e-05   2.10622555e-04
   1.10829526e-03   1.44848597e-05   4.19852033e-06   2.52915875e-06
   4.27755723e-06   2.89025269e-06   1.43164968e-06   1.34863999e-06
   1.72333362e-08   1.93428061e-08   2.52411971e-08   1.19765983e-07
   3.27811266e-08   1.01930773e-08])
fallback 740 to 'Expansion.Conjunction' ([  4.59159196e-07   3.70300860e-01   1.13858939e-01   5.02209739e-02
   1.70610667e-01   7.89574834e-02   1.12935650e-02   3.49337758e-02
   1.51219517e-01   7.24025818e-03   2.22351472e-03   2.01175991e-03
   1.91642216e-03   2.19866657e-03   1.82050013e-03   9.57719111e-04
   1.03359395e-04   2.82936963e-05   1.16036509e-05   5.53087886e-05
   2.64295250e-05   9.92407698e-06])
fallback 334 to 'Expansion.Conjunction' ([  1.19684540e-10   9.93770292e-01   2.92105947e-03   1.76584172e-03
   3.33170665e-04   4.48999158e-05   4.71357485e-04   5.54753521e-04
   1.17576082e-05   1.30875950e-05   7.25956190e-05   1.23221952e-05
   2.47943588e-05   7.46768329e-08   2.78642776e-06   9.09796930e-07
   2.72507575e-07   6.64604765e-09   1.07710639e-09   5.71854203e-09
   1.48533429e-09   9.13590351e-09])
fallback 10 to 'Expansion.Conjunction' ([  4.89471681e-08   9.10801311e-01   1.48796219e-02   6.11052210e-03
   3.30371752e-02   8.48468877e-03   1.06869233e-03   4.56400458e-03
   1.94117897e-02   6.39173100e-04   1.99050370e-04   1.54500932e-04
   2.09766052e-04   1.92033015e-04   1.43678600e-04   8.49214430e-05
   3.72310100e-06   2.82223420e-06   1.45266737e-06   6.07979805e-06
   3.94531534e-06   9.98382710e-07])
fallback 404 to 'Expansion.Conjunction' ([  2.01738999e-07   4.03728847e-01   2.60797414e-01   1.38156892e-01
   4.32000351e-02   1.78480932e-02   4.83098333e-02   4.76741497e-02
   7.15579705e-03   7.74791611e-03   1.30742110e-02   3.89107367e-03
   5.50696026e-03   2.39615229e-04   1.82629146e-03   5.87448658e-04
   2.17216513e-04   1.55634245e-05   1.71694320e-06   1.07285624e-05
   2.65312317e-06   7.34257453e-06])
fallback 565 to 'Expansion.Conjunction' ([  4.28769686e-09   9.78318413e-01   3.79894728e-03   1.49200010e-03
   9.11353082e-03   1.84788256e-03   2.43704480e-04   1.05067240e-03
   3.85608276e-03   1.12851436e-04   3.85139327e-05   2.55676337e-05
   4.21483864e-05   2.65729001e-05   1.74833643e-05   1.31978407e-05
   3.26181812e-07   2.57342924e-07   2.30506776e-07   1.05486551e-06
   4.23618056e-07   1.33963343e-07])
fallback 137 to 'Expansion.Conjunction' ([  3.55867280e-11   9.97020689e-01   1.28509527e-03   9.63939496e-04
   1.32154691e-04   1.63159152e-05   2.79355307e-04   2.43325753e-04
   2.14297626e-06   4.47981768e-06   3.59478591e-05   4.70567478e-06
   1.07056279e-05   2.45765370e-08   7.71978555e-07   2.39453392e-07
   9.81507382e-08   1.75513919e-09   3.26372382e-10   2.04280798e-09
   3.77828889e-10   4.38526072e-09])
fallback 694 to 'Expansion.Conjunction' ([  5.23295185e-08   9.06465903e-01   1.53039007e-02   6.29903340e-03
   3.46563762e-02   8.96646749e-03   1.09597681e-03   4.75611871e-03
   2.07446035e-02   6.66977907e-04   2.04597690e-04   1.60814498e-04
   2.15179392e-04   2.05264328e-04   1.49924471e-04   8.85982823e-05
   4.00289498e-06   3.02424205e-06   1.52541955e-06   6.41416465e-06
   4.19659098e-06   1.04836649e-06])
fallback 308 to 'Expansion.Conjunction' ([  4.68630301e-10   9.88677597e-01   4.91856818e-03   3.48047321e-03
   5.35215587e-04   8.70261043e-05   1.07112047e-03   9.27446620e-04
   1.38889906e-05   2.95695510e-05   1.67809597e-04   2.78908367e-05
   5.42007861e-05   2.55439340e-07   6.14823815e-06   1.79095157e-06
   9.13470649e-07   2.31880660e-08   3.00338524e-09   1.78335529e-08
   4.53109006e-09   3.64290491e-08])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175461.ba+   1859956K    863601K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175461     rnn-hpca-+          2                         00:04:10      0:0 

Job 16175461 ("rnn-hpca-wikipedia") completed on c16-31 at tor dec 15 13:07:54 CET 2016
