Starting job 16188383 ("rnn-rsv50-wikipedia") on c17-17 at lör dec 17 13:13:03 CET 2016
Python environment is set up
Copying files to /work/jobs/16188383.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16188383.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
EMBEDDING_PATH: /work/jobs/16188383.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed
MODEL_PATH: /work/jobs/16188383.d/models/rnn-rsv50-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll15st-en-03-29-16-blind-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16188383.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-17 13:14] configuration (/work/jobs/16188383.d/models/rnn-rsv50-wikipedia/)
[2016-12-17 13:14]     config 'epochs': 200 (1000)
[2016-12-17 13:14]     config 'epochs_len': -1 (-1)
[2016-12-17 13:14]     config 'epochs_patience': 10 (20)
[2016-12-17 13:14]     config 'batch_size':  (64)
[2016-12-17 13:14]     config 'snapshot_size':  (2048)
[2016-12-17 13:14]     config 'random_per_sample': 24.0 (32)
[2016-12-17 13:14]     config 'words_dim': 20.0 (20)
[2016-12-17 13:14]     config 'focus_dim': 6.0 (4)
[2016-12-17 13:14]     config 'rnn_dim': 50.0 (20)
[2016-12-17 13:14]     config 'final_dim': 40.0 (100)
[2016-12-17 13:14]     config 'arg1_len':  (100)
[2016-12-17 13:14]     config 'arg2_len':  (100)
[2016-12-17 13:14]     config 'conn_len':  (10)
[2016-12-17 13:14]     config 'punc_len':  (2)
[2016-12-17 13:14]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-17 13:14]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-17 13:14]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-17 13:14]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-17 13:14]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-17 13:14]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-17 13:14]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-17 13:14]     config 'words2vec_bin': None (None)
[2016-12-17 13:14]     config 'words2vec_txt': /work/jobs/16188383.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed (None)
[2016-12-17 13:14]   args.lang: en
[2016-12-17 13:14]   args.model_dir: /work/jobs/16188383.d/models/rnn-rsv50-wikipedia/
[2016-12-17 13:14]   args.dataset_dir: /work/jobs/16188383.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
[2016-12-17 13:14]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll15st-en-03-29-16-blind-test/
[2016-12-17 13:14]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-17 13:14]   os.getenv("THEANO_FLAGS"): None
[2016-12-17 13:14]   filter_types: None
[2016-12-17 13:14]   filter_senses: None
[2016-12-17 13:14]   filter_fn_name: conn_gt_0
[2016-12-17 13:14]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16188383.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-17 13:14] load dataset for prediction (/work/jobs/16188383.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-17 13:14] lang: ?, doc_ids: 71, words: 34621, rel_ids: 625, relation tokens: 25754
[2016-12-17 13:14]   rel_senses2id: 22, words2id: 43918
[2016-12-17 13:14] build model
[2016-12-17 13:14]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-17 13:14]     config 'optimizer':  (adam)
[2016-12-17 13:15] previous weights (/work/jobs/16188383.d/models/rnn-rsv50-wikipedia/)
[2016-12-17 13:15] convert from dataset (/work/jobs/16188383.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-17 13:15] make predictions
[2016-12-17 13:16] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll15st-en-03-29-16-blind-test/)
/work/jobs/16188383.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 609 to 'Expansion.Conjunction' ([  2.95244035e-07   9.43391750e-01   1.16335341e-02   5.60327765e-03
   1.87912920e-02   3.28696383e-03   2.68826497e-03   2.29112387e-03
   1.07722283e-02   8.25000469e-04   7.33108616e-05   1.63065635e-04
   2.20742719e-04   4.18964596e-05   9.24291098e-05   9.72070857e-05
   1.31943108e-05   1.20447259e-05   7.56966195e-08   1.03744868e-06
   6.04759015e-07   6.61015469e-07])
fallback 694 to 'Expansion.Conjunction' ([  1.28873012e-06   8.52542361e-01   2.21767170e-02   1.23364817e-02
   4.74869583e-02   1.07009739e-02   6.18225118e-03   4.89467022e-03
   3.94632193e-02   1.97003088e-03   2.27128743e-04   5.24617570e-04
   5.77753889e-04   1.85494330e-04   2.94917736e-04   3.17215141e-04
   5.08248171e-05   5.69501403e-05   4.12097403e-07   4.89123807e-06
   2.60175768e-06   2.24005958e-06])
fallback 311 to 'Expansion.Conjunction' ([  4.12690281e-12   9.99988025e-01   6.69021760e-06   3.89940444e-06
   7.37014720e-08   3.27362850e-08   2.18293395e-07   8.43642345e-07
   3.61572463e-09   1.37822526e-07   3.98087432e-08   4.98772626e-09
   2.15260966e-08   7.39449547e-11   2.26844456e-09   6.41147894e-09
   2.75159924e-10   9.89262497e-11   2.39117234e-11   2.06608985e-11
   5.41446838e-12   3.34592217e-11])
fallback 553 to 'Expansion.Conjunction' ([  3.66459174e-09   9.98262196e-01   1.18157160e-04   5.71935469e-05
   9.00279058e-04   6.85898505e-05   1.79854401e-05   1.05942821e-05
   5.56397326e-04   4.61403774e-06   2.97800577e-07   1.14999788e-06
   1.30647690e-06   2.72543709e-07   6.22955174e-07   1.80246792e-07
   6.12210957e-08   7.40624223e-08   1.10095658e-09   5.12864432e-09
   1.65882743e-08   1.74404152e-09])
fallback 565 to 'Expansion.Conjunction' ([  3.60562609e-07   9.32503182e-01   1.43123374e-02   6.86747501e-03
   2.17961617e-02   3.95286929e-03   3.29987269e-03   2.87342007e-03
   1.24498375e-02   1.02548338e-03   9.36725210e-05   2.04576387e-04
   2.84362008e-04   5.23933060e-05   1.21176754e-04   1.28441682e-04
   1.66846442e-05   1.46749701e-05   9.89002961e-08   1.30556319e-06
   7.48268193e-07   8.65453859e-07])
fallback 135 to 'Expansion.Conjunction' ([  7.07523355e-08   8.73839439e-01   6.22126461e-02   3.33197341e-02
   4.80422145e-03   2.01631943e-03   7.95339328e-03   8.74872693e-03
   9.66961846e-04   3.58379027e-03   6.32178330e-04   2.65404815e-04
   1.12674106e-03   3.56996643e-05   2.50081270e-04   2.28506906e-04
   9.90521768e-06   3.30065723e-06   1.83458610e-07   5.84338352e-07
   1.33241343e-07   1.97822829e-06])
fallback 740 to 'Expansion.Conjunction' ([  7.19082846e-06   5.49072022e-01   5.63365104e-02   3.63096517e-02
   1.27465366e-01   4.35330938e-02   1.90105548e-02   1.49733283e-02
   1.35927810e-01   6.30969920e-03   1.13299511e-03   2.56917437e-03
   2.22794220e-03   1.25479324e-03   1.39532353e-03   1.80580046e-03
   2.80915233e-04   3.19876327e-04   3.85835252e-06   3.51586019e-05
   1.60733724e-05   1.28626606e-05])
fallback 137 to 'Expansion.Conjunction' ([  1.86492474e-10   9.99597226e-01   2.17600167e-04   1.25713279e-04
   4.19157767e-06   2.08059709e-06   1.12492650e-05   3.17753539e-05
   3.91583332e-07   6.03198198e-06   1.45296482e-06   3.67660041e-07
   1.21608795e-06   1.35604493e-08   1.74417901e-07   4.86070848e-07
   1.75662733e-08   7.20514341e-09   7.61927890e-10   1.34598185e-09
   2.53574349e-10   2.18316093e-09])
fallback 853 to 'Expansion.Conjunction' ([  5.01463091e-06   2.58758994e-01   1.97579117e-01   1.07357085e-01
   1.56385676e-01   5.71139049e-02   5.11102270e-02   3.88201515e-02
   8.69132510e-02   1.83986613e-02   3.83688978e-03   5.37052242e-03
   7.31084035e-03   1.82762813e-03   5.09608308e-03   3.49157911e-03
   4.47952163e-04   1.09827292e-04   4.78980659e-06   1.71718276e-05
   1.36851951e-05   3.09481368e-05])
fallback 696 to 'Expansion.Conjunction' ([  1.99293623e-07   7.25314750e-01   1.34051460e-01   6.68191028e-02
   1.50502252e-02   5.66458992e-03   1.75458755e-02   1.79412424e-02
   3.39307503e-03   7.70071350e-03   1.44075849e-03   7.70244587e-04
   2.84066569e-03   9.61436763e-05   6.86882775e-04   6.43580291e-04
   2.68626359e-05   6.98539875e-06   3.99997909e-07   1.26091939e-06
   4.34493992e-07   4.54764458e-06])
fallback 354 to 'Expansion.Conjunction' ([  5.87125279e-11   9.99846232e-01   8.20016949e-05   4.04647985e-05
   4.76190422e-06   1.24175621e-06   6.33918224e-06   1.37608105e-05
   6.31716439e-07   3.05921075e-06   3.03854794e-07   1.73538384e-07
   7.50982744e-07   4.23965046e-09   5.99914507e-08   2.04895118e-07
   2.79865423e-09   4.58836308e-09   1.43041011e-10   1.19079781e-09
   7.87303148e-11   1.00245380e-09])
fallback 10 to 'Expansion.Conjunction' ([  1.22209326e-06   8.54232496e-01   2.32773145e-02   1.26938718e-02
   4.66334562e-02   1.03947540e-02   6.34073191e-03   5.09493383e-03
   3.70375330e-02   2.02426688e-03   2.29903760e-04   5.22360384e-04
   5.97569514e-04   1.78631877e-04   3.04577554e-04   3.23390270e-04
   5.03149025e-05   5.28861387e-05   3.94559098e-07   4.61945550e-06
   2.49615325e-06   2.27477246e-06])
fallback 87 to 'Expansion.Conjunction' ([  1.35644996e-06   7.55372224e-01   7.11661053e-02   3.23066673e-02
   5.75578993e-02   1.36374756e-02   1.60519462e-02   1.56471580e-02
   2.68673765e-02   5.37092004e-03   6.46955215e-04   1.06428645e-03
   1.91135424e-03   2.60682252e-04   9.51895371e-04   1.03022821e-03
   9.35654677e-05   4.51251215e-05   6.25385665e-07   6.22696641e-06
   3.28751343e-06   6.63947228e-06])
fallback 1024 to 'Expansion.Conjunction' ([  1.18390290e-05   2.58017923e-01   1.17196744e-01   7.61232288e-02
   1.89296317e-01   7.85694927e-02   4.13576096e-02   2.85151521e-02
   1.69430774e-01   1.40526925e-02   3.38805065e-03   5.83077398e-03
   5.27044190e-03   3.24894668e-03   4.42029714e-03   4.09594264e-03
   7.06169450e-04   3.41432774e-04   9.88102674e-06   5.05643938e-05
   3.23181224e-05   3.34088503e-05])
fallback 467 to 'Expansion.Conjunction' ([  4.91405626e-06   5.17808924e-01   9.90996900e-02   5.51671843e-02
   1.24884585e-01   3.84492360e-02   2.86491314e-02   2.18497202e-02
   9.01548283e-02   9.92864202e-03   1.66095866e-03   2.72813305e-03
   3.57489038e-03   1.05183306e-03   2.31985403e-03   2.17286152e-03
   2.91848066e-04   1.50686438e-04   2.81508852e-06   2.09848753e-05
   1.19786666e-05   1.63010230e-05])
fallback 241 to 'Expansion.Conjunction' ([  3.04959985e-06   7.41368948e-01   3.37432324e-02   2.03910283e-02
   7.87810383e-02   2.15185265e-02   1.04273353e-02   8.14910231e-03
   7.74879305e-02   3.39845451e-03   4.76559652e-04   1.11242837e-03
   1.08607427e-03   4.67771547e-04   5.98984187e-04   7.07746715e-04
   1.14315968e-04   1.41725075e-04   1.20888717e-06   1.31772940e-05
   6.32839782e-06   5.03419686e-06])
fallback 24 to 'Expansion.Conjunction' ([  3.67167685e-10   9.99721586e-01   6.59229272e-06   3.27927932e-06
   1.46571358e-04   8.20419427e-06   7.74642160e-07   4.56814035e-07
   1.12130394e-04   2.05194553e-07   1.19731567e-08   6.58287504e-08
   6.09348518e-08   1.33930422e-08   3.01583824e-08   5.95551785e-09
   2.89268342e-09   5.19219689e-09   1.71378564e-10   3.19875126e-10
   2.68471045e-09   6.02882882e-11])
fallback 308 to 'Expansion.Conjunction' ([  1.87813214e-08   9.57462951e-01   2.07728871e-02   1.32563168e-02
   9.28483714e-04   4.39732183e-04   2.32678020e-03   2.87239156e-03
   1.54800667e-04   1.06361728e-03   2.52485533e-04   6.24065205e-05
   2.82449411e-04   8.98631228e-06   5.49844545e-05   5.70747643e-05
   2.09392507e-06   8.93307501e-07   4.28605269e-08   1.76736390e-07
   2.66640696e-08   3.99887647e-07])
fallback 920 to 'Expansion.Conjunction' ([  3.59783904e-11   9.99932054e-01   3.86735848e-05   1.79787622e-05
   7.04285187e-07   2.90581341e-07   1.89194112e-06   6.93808309e-06
   4.81983202e-08   9.23240126e-07   1.41801963e-07   6.65137423e-08
   1.71640622e-07   1.01411568e-09   2.17542927e-08   8.68971813e-08
   4.32050042e-09   1.97296358e-09   1.89094865e-10   2.93320896e-10
   4.88543686e-11   4.81231334e-10])
fallback 922 to 'Expansion.Conjunction' ([  1.00192610e-05   3.34058554e-01   1.07202389e-01   6.78357559e-02
   1.72909842e-01   6.61152530e-02   3.64186803e-02   2.54630708e-02
   1.55030370e-01   1.25370231e-02   2.72199094e-03   4.67232663e-03
   4.65451742e-03   2.41828664e-03   3.57250033e-03   3.41970428e-03
   5.53683788e-04   3.01975787e-04   7.19822950e-06   4.40433179e-05
   2.57181110e-05   2.70968086e-05])
fallback 334 to 'Expansion.Conjunction' ([  6.13824680e-09   9.88412840e-01   5.91899025e-03   3.16424360e-03
   3.13246122e-04   1.27334422e-04   6.33251726e-04   9.22218415e-04
   5.54157477e-05   2.81910844e-04   4.30536158e-05   2.07512781e-05
   6.94486795e-05   1.53824905e-06   1.32040957e-05   2.11493421e-05
   7.64847344e-07   3.91069612e-07   1.56703465e-08   6.80277369e-08
   8.83075109e-09   1.49328213e-07])
fallback 715 to 'Expansion.Conjunction' ([  3.10490054e-06   4.13592164e-01   1.77679570e-01   8.92333695e-02
   1.16146923e-01   3.73707455e-02   4.02719681e-02   3.27913057e-02
   5.83873099e-02   1.48569561e-02   2.63253695e-03   3.52914286e-03
   6.22851408e-03   9.14108832e-04   3.27715141e-03   2.72419353e-03
   2.42843630e-04   7.38840834e-05   2.44675928e-06   1.31211038e-05
   7.84709854e-06   2.07925534e-05])
fallback 707 to 'Expansion.Conjunction' ([  1.01914061e-07   8.19726641e-01   8.74680573e-02   4.83691838e-02
   6.60028910e-03   3.00839565e-03   1.19382003e-02   1.23249552e-02
   1.32582918e-03   5.35128914e-03   1.00358691e-03   3.65772340e-04
   1.73585605e-03   6.39599962e-05   3.90619008e-04   3.03275881e-04
   1.48211283e-05   4.74384930e-06   3.04870921e-07   8.73935955e-07
   1.99983062e-07   3.04358603e-06])
fallback 795 to 'Expansion.Conjunction' ([  1.28762053e-06   4.61366924e-01   2.06470475e-01   9.29485489e-02
   8.18199668e-02   2.54598075e-02   3.69163157e-02   3.40050386e-02
   3.01605110e-02   1.33980858e-02   2.40270771e-03   3.01907376e-03
   6.69897071e-03   4.41769402e-04   2.32752623e-03   2.38865568e-03
   1.12222704e-04   3.52727585e-05   1.32167759e-06   7.02787295e-06
   3.56979537e-06   1.49209746e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16188383.ba+   1629128K    826635K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16188383     rnn-rsv50+          2                         00:03:47      0:0 

Job 16188383 ("rnn-rsv50-wikipedia") completed on c17-17 at lör dec 17 13:16:46 CET 2016
