Starting job 16175469 ("rnn-glove-wikipedia-gigawords") on c18-16 at tor dec 15 13:06:56 CET 2016
Python environment is set up
Copying files to /work/jobs/16175469.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175469.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16175469.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt
MODEL_PATH: /work/jobs/16175469.d/models/rnn-glove-wikipedia-gigawords/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-gigawords-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175469.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:07] configuration (/work/jobs/16175469.d/models/rnn-glove-wikipedia-gigawords/)
[2016-12-15 13:07]     config 'epochs': 200 (1000)
[2016-12-15 13:07]     config 'epochs_len': -1 (-1)
[2016-12-15 13:07]     config 'epochs_patience': 10 (20)
[2016-12-15 13:07]     config 'batch_size':  (64)
[2016-12-15 13:07]     config 'snapshot_size':  (2048)
[2016-12-15 13:07]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:07]     config 'words_dim': 20.0 (20)
[2016-12-15 13:07]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:07]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:07]     config 'final_dim': 40.0 (100)
[2016-12-15 13:07]     config 'arg1_len':  (100)
[2016-12-15 13:07]     config 'arg2_len':  (100)
[2016-12-15 13:07]     config 'conn_len':  (10)
[2016-12-15 13:07]     config 'punc_len':  (2)
[2016-12-15 13:07]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:07]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:07]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:07]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:07]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:07]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:07]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:07]     config 'words2vec_bin': None (None)
[2016-12-15 13:07]     config 'words2vec_txt': /work/jobs/16175469.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt (None)
[2016-12-15 13:07]   args.lang: en
[2016-12-15 13:07]   args.model_dir: /work/jobs/16175469.d/models/rnn-glove-wikipedia-gigawords/
[2016-12-15 13:07]   args.dataset_dir: /work/jobs/16175469.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-15 13:07]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-gigawords-conll16st-en-03-29-16-dev/
[2016-12-15 13:07]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:07]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:07]   filter_types: None
[2016-12-15 13:07]   filter_senses: None
[2016-12-15 13:07]   filter_fn_name: conn_gt_0
[2016-12-15 13:07]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175469.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:07] load dataset for prediction (/work/jobs/16175469.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:07] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-15 13:07]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:07] build model
[2016-12-15 13:08]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:08]     config 'optimizer':  (adam)
[2016-12-15 13:08] previous weights (/work/jobs/16175469.d/models/rnn-glove-wikipedia-gigawords/)
[2016-12-15 13:08] convert from dataset (/work/jobs/16175469.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:08] make predictions
[2016-12-15 13:09] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-gigawords-conll16st-en-03-29-16-dev/)
/work/jobs/16175469.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 36838 to 'Expansion.Conjunction' ([  1.33686292e-04   4.72537244e-01   9.36699350e-02   7.10702233e-02
   1.08384161e-01   7.70793847e-02   3.80985472e-02   3.41394167e-02
   6.36253052e-02   1.43940922e-02   3.46183773e-03   7.39932425e-03
   3.01156260e-03   4.49326210e-03   2.10194846e-03   2.26897371e-03
   1.54210381e-03   1.24478036e-03   5.38348505e-04   1.87642070e-04
   3.59173278e-04   2.59047313e-04])
fallback 37106 to 'Expansion.Conjunction' ([  6.96248098e-05   7.46217626e-01   3.87994172e-02   3.07665829e-02
   6.28449932e-02   3.83340763e-02   1.58148952e-02   1.38158289e-02
   3.60647672e-02   7.05541780e-03   1.30426619e-03   2.86742865e-03
   1.01457469e-03   1.24414780e-03   8.05414767e-04   6.63208966e-04
   8.50971518e-04   7.04431399e-04   2.62147055e-04   1.08993979e-04
   2.08095914e-04   1.83089131e-04])
fallback 36919 to 'Expansion.Conjunction' ([  3.78480240e-06   9.64470096e-01   8.46325333e-03   5.72787416e-03
   9.40132148e-03   3.09047455e-03   1.89779898e-03   1.56196615e-03
   3.43690093e-03   1.01830159e-03   8.45789188e-05   4.23746012e-04
   8.12230216e-05   6.46194972e-05   5.81554163e-05   4.71415227e-05
   8.00823042e-05   5.16941658e-05   7.66302316e-06   2.88534877e-06
   1.44725628e-05   1.19663738e-05])
fallback 36060 to 'Expansion.Conjunction' ([  2.98679861e-05   3.20443751e-01   2.14698912e-01   2.26495565e-01
   3.88602058e-02   2.23287811e-02   9.21700155e-02   4.05999983e-02
   9.48098400e-03   8.16108943e-03   6.11192224e-03   3.81778485e-03
   7.54872853e-03   1.60306635e-03   3.28319871e-03   3.64388341e-03
   4.79659825e-04   9.62027776e-05   3.11952283e-05   1.29121164e-05
   8.99444790e-05   1.23309247e-05])
fallback 36112 to 'Expansion.Conjunction' ([  7.74688597e-05   4.06521267e-01   1.95393118e-01   1.84462848e-01
   4.73010286e-02   2.06345081e-02   5.97220593e-02   3.47650801e-02
   1.24605384e-02   9.91658880e-03   5.70392105e-03   5.40358907e-03
   6.62909178e-03   2.48192883e-03   2.12060244e-03   5.25304496e-03
   6.65635695e-04   2.50078741e-04   5.68759796e-05   2.10184811e-05
   1.39340920e-04   2.03674411e-05])
fallback 35802 to 'Expansion.Conjunction' ([  1.33197245e-04   5.98149667e-01   6.42598431e-02   5.12492963e-02
   9.23180893e-02   5.85656213e-02   2.82936324e-02   2.27953516e-02
   5.28555037e-02   1.15730615e-02   2.44818236e-03   5.37613555e-03
   2.05454583e-03   2.93964944e-03   1.46508534e-03   1.39041271e-03
   1.51668794e-03   1.27176686e-03   5.25792953e-04   1.91597082e-04
   3.34883987e-04   2.91996466e-04])
fallback 36920 to 'Expansion.Conjunction' ([  2.44991338e-06   8.50681119e-01   5.08841979e-02   5.23582096e-02
   5.71272471e-03   1.73140688e-03   2.57336067e-02   7.05518195e-03
   7.97261768e-04   1.79856432e-03   7.14176386e-04   5.92910970e-04
   1.26162776e-03   9.32453032e-05   2.69678448e-04   2.29983268e-04
   5.74823857e-05   8.54025613e-06   3.27335689e-06   6.30276810e-07
   1.24295765e-05   1.29974011e-06])
fallback 37045 to 'Expansion.Conjunction' ([  1.17811753e-04   4.49934985e-01   1.17103903e-01   8.50835509e-02
   1.03858932e-01   7.07892322e-02   4.08089082e-02   3.71241193e-02
   5.39340185e-02   1.37027594e-02   3.72133494e-03   7.96204146e-03
   3.29761507e-03   4.44619726e-03   2.10966145e-03   2.76411811e-03
   1.26461078e-03   9.97483371e-04   3.78724242e-04   1.39303941e-04
   2.88817010e-04   1.71871971e-04])
fallback 36222 to 'Expansion.Conjunction' ([  1.16337685e-06   9.45240758e-01   1.71519801e-02   2.09835382e-02
   2.06086952e-03   4.32425451e-04   1.00612680e-02   2.40096549e-03
   1.72705888e-04   5.44922730e-04   1.91016884e-04   1.98991479e-04
   3.50264986e-04   2.22628265e-05   8.09712384e-05   7.13664357e-05
   2.28642026e-05   2.86870097e-06   1.07209328e-06   1.06380443e-07
   7.04366101e-06   5.73994171e-07])
fallback 36725 to 'Expansion.Conjunction' ([  4.76172390e-05   3.68281596e-01   1.98171537e-01   2.17241999e-01
   3.86985533e-02   1.85255982e-02   7.85759152e-02   3.64313156e-02
   8.94234313e-03   8.53696916e-03   5.74627788e-03   4.35084003e-03
   6.76033680e-03   1.71631944e-03   2.57078414e-03   4.54331786e-03
   5.58096847e-04   1.26460608e-04   3.59233993e-05   1.21339733e-05
   1.10314269e-04   1.57507472e-05])
fallback 36017 to 'Expansion.Conjunction' ([  6.22848688e-07   9.50295409e-01   1.83891341e-02   1.67931974e-02
   1.90365097e-03   4.66626322e-04   8.25281738e-03   2.11482360e-03
   2.34635348e-04   6.17609664e-04   1.86684429e-04   1.90035051e-04
   3.85380504e-04   1.96561782e-05   8.04359023e-05   4.41286148e-05
   1.71974611e-05   2.50354179e-06   8.01371260e-07   1.50715028e-07
   4.14091355e-06   3.58665922e-07])
fallback 35817 to 'Expansion.Conjunction' ([  9.25246422e-05   1.89819472e-01   1.77472459e-01   1.34040208e-01
   1.30953209e-01   9.88513389e-02   5.98687572e-02   6.20830623e-02
   8.35455142e-02   2.10762659e-02   6.05277210e-03   9.70012051e-03
   5.77577441e-03   8.81166019e-03   4.10282476e-03   4.71356003e-03
   1.23548206e-03   8.91721117e-04   3.13647327e-04   1.13795920e-04
   3.48089324e-04   1.37741941e-04])
fallback 36212 to 'Expansion.Conjunction' ([  7.39723964e-06   6.48498762e-01   1.19146129e-01   1.12069866e-01
   1.72263213e-02   7.95876780e-03   5.58548746e-02   2.00316325e-02
   3.51466046e-03   4.69558818e-03   2.52287458e-03   1.76430397e-03
   4.02153928e-03   4.59114576e-04   1.08808044e-03   8.86830951e-04
   1.70078591e-04   2.96664052e-05   1.18138121e-05   3.87756738e-06
   3.36295192e-05   4.19140262e-06])
fallback 35791 to 'Expansion.Conjunction' ([  7.59830364e-05   6.84140698e-01   6.30602106e-02   4.77401178e-02
   7.08610134e-02   3.79099445e-02   2.29732940e-02   1.76159092e-02
   3.35506507e-02   8.65031147e-03   1.77097395e-03   4.25128556e-03
   1.43793694e-03   1.74732033e-03   9.35343931e-04   1.04323824e-03
   9.27830078e-04   6.75178847e-04   2.31634234e-04   8.30016526e-05
   1.84423294e-04   1.33700134e-04])
fallback 36070 to 'Expansion.Conjunction' ([  1.30118497e-04   4.18039716e-01   1.09184192e-01   8.07407883e-02
   1.12827489e-01   8.44314260e-02   4.17425639e-02   3.97173135e-02
   6.73774417e-02   1.54730093e-02   3.88614863e-03   8.38882861e-03
   3.53928312e-03   5.27868428e-03   2.45111695e-03   2.78495187e-03
   1.51294460e-03   1.20158123e-03   5.13849846e-04   1.78078032e-04
   3.63222533e-04   2.37252130e-04])
fallback 36611 to 'Expansion.Conjunction' ([  1.80249299e-05   4.52415648e-01   1.77673371e-01   1.83769838e-01
   2.87160466e-02   1.47688092e-02   7.92464247e-02   3.12774072e-02
   6.39669369e-03   6.74886261e-03   4.39455130e-03   2.89225557e-03
   5.92788778e-03   9.77481955e-04   2.11208408e-03   2.17974397e-03
   3.26066862e-04   6.08603627e-05   2.08629137e-05   7.61002280e-06
   6.13863235e-05   8.08284682e-06])
fallback 36082 to 'Expansion.Conjunction' ([  3.11741169e-05   2.97375949e-01   2.22212167e-01   2.13052885e-01
   4.35268881e-02   2.82849392e-02   9.69212209e-02   4.69621571e-02
   1.11976993e-02   8.91627655e-03   6.97054066e-03   4.35925743e-03
   9.30580874e-03   2.02000585e-03   4.19379214e-03   3.82432996e-03
   5.43865495e-04   1.13874580e-04   4.28693240e-05   1.99047409e-05
   1.08676257e-04   1.57190735e-05])
fallback 35799 to 'Expansion.Conjunction' ([ 0.00018121  0.15934048  0.12861755  0.09763595  0.15103339  0.13702311
  0.05380987  0.06898618  0.12385704  0.02342574  0.00655169  0.01051553
  0.00774904  0.0132464   0.00632378  0.00510384  0.00231073  0.00177571
  0.00089914  0.0003337   0.00086816  0.00041176])
fallback 36213 to 'Expansion.Conjunction' ([  2.20803918e-06   8.48301596e-01   5.22462245e-02   5.21049094e-02
   5.81797682e-03   1.82918507e-03   2.64099969e-02   7.26124137e-03
   8.42701533e-04   1.85438014e-03   7.35990185e-04   5.92999106e-04
   1.32550160e-03   9.62467828e-05   2.76628418e-04   2.20530130e-04
   5.63655162e-05   8.28666822e-06   3.27276009e-06   6.63589622e-07
   1.18536546e-05   1.24212046e-06])
fallback 36080 to 'Expansion.Conjunction' ([  9.74776260e-10   9.99855601e-01   2.94673544e-05   2.05395177e-05
   6.06730515e-05   1.36655757e-05   1.99342849e-06   2.50540853e-06
   1.21310935e-05   2.56930031e-06   2.59329879e-08   4.47408706e-07
   4.28409212e-08   1.74825634e-08   8.50848585e-08   2.09597944e-08
   8.64832990e-08   5.14042012e-08   1.47319549e-09   1.81461039e-09
   1.80245885e-08   5.39013575e-08])
fallback 36362 to 'Expansion.Conjunction' ([  3.87966139e-07   9.87912803e-01   4.27056768e-03   4.52310605e-03
   7.66704988e-04   1.15264538e-04   1.35203874e-03   4.92946958e-04
   9.49131819e-05   2.42142872e-04   4.65533244e-05   8.50239765e-05
   5.73561682e-05   5.44676521e-06   9.20920620e-06   1.54804734e-05
   5.97744219e-06   2.01788413e-06   2.52302279e-07   3.19366516e-08
   1.65066302e-06   1.23643393e-07])
fallback 37110 to 'Expansion.Conjunction' ([  1.67571139e-04   3.32037631e-01   9.94659971e-02   7.63710001e-02
   1.32799806e-01   1.12222658e-01   4.39978359e-02   4.78476626e-02
   9.70276530e-02   1.90164412e-02   4.57411777e-03   9.18299715e-03
   4.72397456e-03   7.80282970e-03   3.55015187e-03   3.19940205e-03
   2.09487395e-03   1.70200855e-03   8.77469322e-04   3.00225980e-04
   6.24998538e-04   4.12694649e-04])
fallback 36499 to 'Expansion.Conjunction' ([  1.35407754e-04   1.62081911e-01   1.38511791e-01   1.06442600e-01
   1.48376703e-01   1.28811553e-01   5.63801748e-02   6.68127161e-02
   1.18360139e-01   2.35668382e-02   6.29760508e-03   1.00729875e-02
   6.89639893e-03   1.18728186e-02   5.54975678e-03   4.65837585e-03
   1.93279934e-03   1.41716573e-03   6.45602643e-04   2.31230499e-04
   6.48058948e-04   2.97366582e-04])
fallback 35809 to 'Expansion.Conjunction' ([  1.03879684e-04   2.68619953e-01   1.81393265e-01   1.30374550e-01
   1.14917181e-01   8.14499701e-02   5.34925048e-02   5.33524749e-02
   6.18588548e-02   1.73639114e-02   5.35351361e-03   9.44802439e-03
   4.96080375e-03   6.66481718e-03   3.20202134e-03   4.69986579e-03
   1.09996599e-03   8.58564507e-04   2.76233679e-04   1.07058716e-04
   2.86454915e-04   1.16131857e-04])
fallback 36464 to 'Expansion.Conjunction' ([  5.71673445e-05   3.95252461e-01   1.93919716e-01   2.00853211e-01
   4.15761801e-02   1.87866294e-02   6.85665599e-02   3.50960154e-02
   1.01081951e-02   8.91565428e-03   5.61119097e-03   4.66878800e-03
   6.61442421e-03   1.95292241e-03   2.28305182e-03   4.79291281e-03
   5.86734496e-04   1.63354691e-04   4.25893590e-05   1.44914073e-05
   1.20817428e-04   1.69322027e-05])
fallback 36214 to 'Expansion.Conjunction' ([  8.82811037e-07   9.63317511e-01   1.12612229e-02   1.44934011e-02
   1.57920841e-03   2.76674050e-04   6.39476066e-03   1.56583520e-03
   1.25342165e-04   4.21945528e-04   1.26223225e-04   1.42193632e-04
   1.72000174e-04   1.28861547e-05   3.95976348e-05   4.77314387e-05
   1.47122827e-05   2.37364087e-06   6.65086245e-07   6.19572942e-08
   4.40884286e-06   3.62574211e-07])
fallback 36194 to 'Expansion.Conjunction' ([  3.11741169e-05   2.97375949e-01   2.22212167e-01   2.13052885e-01
   4.35268881e-02   2.82849392e-02   9.69212209e-02   4.69621571e-02
   1.11976993e-02   8.91627655e-03   6.97054066e-03   4.35925743e-03
   9.30580874e-03   2.02000585e-03   4.19379214e-03   3.82432996e-03
   5.43865495e-04   1.13874580e-04   4.28693240e-05   1.99047409e-05
   1.08676257e-04   1.57190735e-05])
fallback 36502 to 'Expansion.Conjunction' ([  1.61958233e-05   8.67264268e-01   3.98159920e-02   3.17169911e-02
   2.14846264e-02   7.19272250e-03   1.06643177e-02   6.94692878e-03
   6.45165749e-03   3.62332164e-03   7.48705466e-04   1.88816583e-03
   6.93050502e-04   3.71177971e-04   2.50435986e-04   4.29815844e-04
   2.09770179e-04   1.42999022e-04   2.82168820e-05   8.49195018e-06
   3.89924061e-05   1.31567167e-05])
fallback 36262 to 'Expansion.Conjunction' ([  3.53967916e-05   7.73401741e-01   6.16436827e-02   4.81214675e-02
   4.06927021e-02   1.64503158e-02   1.82772354e-02   1.25576677e-02
   1.38062761e-02   5.98366515e-03   1.37026248e-03   3.24380516e-03
   1.19214750e-03   8.83893172e-04   5.30273714e-04   8.53331065e-04
   4.37760262e-04   3.03250972e-04   7.64464134e-05   2.45896136e-05
   8.03948937e-05   3.36946470e-05])
fallback 35756 to 'Expansion.Conjunction' ([  1.15089293e-04   3.24344221e-01   1.40266003e-01   1.02787883e-01
   1.19627984e-01   9.03687337e-02   4.89865211e-02   4.90121772e-02
   7.17337064e-02   1.75295586e-02   4.73962077e-03   9.36665209e-03
   4.43086265e-03   6.50146331e-03   3.01965608e-03   3.67300658e-03
   1.35175315e-03   1.04991255e-03   4.15368126e-04   1.45844549e-04
   3.50054939e-04   1.83928556e-04])
fallback 36245 to 'Expansion.Conjunction' ([  9.14780248e-05   2.61273418e-01   2.35043604e-01   2.33425963e-01
   5.69002227e-02   2.96951928e-02   7.55865287e-02   4.40370224e-02
   1.57963617e-02   1.09400555e-02   7.65100832e-03   6.15318315e-03
   7.95383111e-03   3.27138841e-03   3.46045690e-03   7.33487738e-03
   8.26471032e-04   2.81416612e-04   6.40038425e-05   2.83571721e-05
   1.60401719e-04   2.47573775e-05])
fallback 35923 to 'Expansion.Conjunction' ([  1.07064343e-05   6.32402774e-01   1.21346235e-01   1.27622738e-01
   1.70763637e-02   6.99482761e-03   5.64060804e-02   1.93153526e-02
   3.14923281e-03   4.74474856e-03   2.51273577e-03   1.90749496e-03
   3.61795139e-03   4.67898642e-04   9.94105353e-04   1.14742352e-03
   1.92467792e-04   3.38808202e-05   1.17621275e-05   3.27450901e-06
   3.70719897e-05   4.87414352e-06])
fallback 36788 to 'Expansion.Conjunction' ([  1.53168789e-04   4.72004388e-01   8.05101104e-02   6.38408592e-02
   1.13229045e-01   8.38136904e-02   3.66621766e-02   3.31174995e-02
   7.34947777e-02   1.53970198e-02   3.42022375e-03   7.06842781e-03
   2.99717070e-03   4.82509057e-03   2.21115586e-03   2.11130434e-03
   1.83276985e-03   1.52941003e-03   7.27172249e-04   2.46531129e-04
   4.50277385e-04   3.57731016e-04])
fallback 36904 to 'Expansion.Conjunction' ([  1.09446235e-04   2.19418558e-01   1.54585616e-01   1.15372651e-01
   1.34386839e-01   1.05613091e-01   5.56626586e-02   5.97807137e-02
   9.20770102e-02   2.10470392e-02   5.65797980e-03   9.85174449e-03
   5.56122424e-03   8.79785240e-03   4.09573274e-03   4.23100176e-03
   1.46003686e-03   1.08434377e-03   4.32871344e-04   1.51453134e-04
   4.26526447e-04   1.95610179e-04])
fallback 36284 to 'Expansion.Conjunction' ([  1.98992624e-04   3.84810060e-01   8.29389914e-02   6.85508251e-02
   1.30225524e-01   1.05378866e-01   4.04776223e-02   4.20785360e-02
   9.21285077e-02   1.76372435e-02   4.42619389e-03   7.53892306e-03
   4.30043414e-03   6.55253464e-03   3.24633624e-03   2.83114589e-03
   2.19633407e-03   1.86979805e-03   1.03391206e-03   3.81687801e-04
   7.18399882e-04   4.79131384e-04])
fallback 36254 to 'Expansion.Conjunction' ([  2.52889822e-06   8.38472621e-01   5.91984403e-02   4.99443049e-02
   7.11953374e-03   2.49173311e-03   2.61324221e-02   8.56542790e-03
   1.30016790e-03   2.46232660e-03   9.64003925e-04   7.48056816e-04
   1.73307272e-03   1.25503810e-04   3.78642588e-04   2.63512867e-04
   6.64569829e-05   1.17745915e-05   3.85548045e-06   1.22660029e-06
   1.29025277e-05   1.48472410e-06])
fallback 35749 to 'Expansion.Conjunction' ([  7.05806669e-05   6.94782125e-01   6.28652338e-02   4.76007676e-02
   6.76543998e-02   3.52297084e-02   2.25059684e-02   1.69929002e-02
   3.11009189e-02   8.34350179e-03   1.71531000e-03   4.14882453e-03
   1.39610059e-03   1.63376130e-03   8.82822014e-04   1.01005540e-03
   8.70983799e-04   6.24274474e-04   2.09354501e-04   7.38345539e-05
   1.69740084e-04   1.18834110e-04])
fallback 36651 to 'Expansion.Conjunction' ([  5.65225946e-07   9.91670633e-01   1.87394156e-03   1.20337438e-03
   2.70855410e-03   8.00355066e-04   3.03492307e-04   2.76752172e-04
   8.14689169e-04   2.00536267e-04   9.88238414e-06   6.80158062e-05
   1.03208288e-05   7.13775325e-06   1.17613566e-05   6.44937579e-06
   1.61926204e-05   8.81452819e-06   8.63550007e-07   5.06527568e-07
   3.13857989e-06   4.02355737e-06])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175469.ba+   1945024K    960278K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175469     rnn-glove+          2                         00:03:03      0:0 

Job 16175469 ("rnn-glove-wikipedia-gigawords") completed on c18-16 at tor dec 15 13:09:57 CET 2016
