Starting job 16175481 ("rnn-hpca-wikipedia") on c13-26 at tor dec 15 13:15:44 CET 2016
Python environment is set up
Copying files to /work/jobs/16175481.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175481.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16175481.d/resources//word_embeddings/precompiled/hpca/size=50.merged
MODEL_PATH: /work/jobs/16175481.d/models/rnn-hpca-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-hpca-wikipedia-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175481.d/resources//word_embeddings/precompiled/hpca/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:16] configuration (/work/jobs/16175481.d/models/rnn-hpca-wikipedia/)
[2016-12-15 13:16]     config 'epochs': 200 (1000)
[2016-12-15 13:16]     config 'epochs_len': -1 (-1)
[2016-12-15 13:16]     config 'epochs_patience': 10 (20)
[2016-12-15 13:16]     config 'batch_size':  (64)
[2016-12-15 13:16]     config 'snapshot_size':  (2048)
[2016-12-15 13:16]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:16]     config 'words_dim': 20.0 (20)
[2016-12-15 13:16]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:16]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:16]     config 'final_dim': 40.0 (100)
[2016-12-15 13:16]     config 'arg1_len':  (100)
[2016-12-15 13:16]     config 'arg2_len':  (100)
[2016-12-15 13:16]     config 'conn_len':  (10)
[2016-12-15 13:16]     config 'punc_len':  (2)
[2016-12-15 13:16]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:16]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:16]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:16]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:16]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:16]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:16]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:16]     config 'words2vec_bin': None (None)
[2016-12-15 13:16]     config 'words2vec_txt': /work/jobs/16175481.d/resources//word_embeddings/precompiled/hpca/size=50.merged (None)
[2016-12-15 13:16]   args.lang: en
[2016-12-15 13:16]   args.model_dir: /work/jobs/16175481.d/models/rnn-hpca-wikipedia/
[2016-12-15 13:16]   args.dataset_dir: /work/jobs/16175481.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-15 13:16]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-hpca-wikipedia-conll16st-en-03-29-16-test/
[2016-12-15 13:16]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:16]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:16]   filter_types: None
[2016-12-15 13:16]   filter_senses: None
[2016-12-15 13:16]   filter_fn_name: conn_gt_0
[2016-12-15 13:16]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175481.d/resources//word_embeddings/precompiled/hpca/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:16] load dataset for prediction (/work/jobs/16175481.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:16] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-15 13:16]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:16] build model
[2016-12-15 13:16]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:16]     config 'optimizer':  (adam)
[2016-12-15 13:17] previous weights (/work/jobs/16175481.d/models/rnn-hpca-wikipedia/)
[2016-12-15 13:17] convert from dataset (/work/jobs/16175481.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:17] make predictions
[2016-12-15 13:18] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-hpca-wikipedia-conll16st-en-03-29-16-test/)
/work/jobs/16175481.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 38649 to 'Expansion.Conjunction' ([  5.84760712e-11   9.95559329e-01   2.00543505e-03   1.37048493e-03
   1.94939245e-04   2.50802148e-05   3.78389899e-04   3.75177331e-04
   4.23693425e-06   7.26939556e-06   5.46216903e-05   7.48030693e-06
   1.55570141e-05   3.56424115e-08   1.38315044e-06   3.99769474e-07
   1.68348790e-07   3.01436785e-09   4.91289562e-10   2.75413135e-09
   6.01569901e-10   5.60469578e-09])
fallback 38643 to 'Expansion.Conjunction' ([  2.34267077e-07   4.18655125e-01   2.48782603e-01   1.45846217e-01
   3.50169500e-02   1.51426642e-02   5.23364801e-02   4.60237672e-02
   4.72458309e-03   7.36898272e-03   1.36894294e-02   4.24536455e-03
   5.36796866e-03   2.41570450e-04   1.68922717e-03   5.56142997e-04
   2.75508266e-04   1.56906589e-05   1.32138108e-06   8.71979404e-06
   2.66180971e-06   8.78823443e-06])
fallback 37361 to 'Expansion.Conjunction' ([  1.64581422e-07   6.23786341e-01   1.61549377e-01   9.67192220e-02
   2.15766024e-02   8.20045467e-03   3.52271913e-02   3.04106982e-02
   2.30918084e-03   3.74494081e-03   9.15014853e-03   2.57886834e-03
   3.29982821e-03   1.00508574e-04   9.07197902e-04   2.63870291e-04
   1.56263445e-04   8.07708708e-06   7.40177042e-07   4.19602391e-06
   1.48491895e-06   4.64296781e-06])
fallback 38205 to 'Expansion.Conjunction' ([  5.33161540e-07   5.36086134e-01   1.20578771e-01   5.02686008e-02
   1.07840209e-01   4.66955371e-02   1.39265561e-02   2.96036559e-02
   7.32104394e-02   8.00080678e-03   2.77808071e-03   2.59682672e-03
   3.06359650e-03   1.60006757e-03   2.21997938e-03   1.30964499e-03
   8.87051851e-05   2.98936479e-05   1.11219795e-05   5.44972345e-05
   2.47116710e-05   1.16314039e-05])
fallback 38300 to 'Expansion.Conjunction' ([  3.22029048e-09   9.76247045e-01   2.65748512e-03   1.04218532e-03
   1.06667938e-02   1.99304166e-03   1.35956983e-04   9.57126353e-04
   6.11135672e-03   8.01696710e-05   2.16321581e-05   1.49708735e-05
   2.33600251e-05   2.56566265e-05   1.17925243e-05   9.47700637e-06
   2.04265484e-07   2.28089669e-07   1.86719840e-07   8.28028282e-07
   4.11580646e-07   8.86644830e-08])
fallback 37830 to 'Expansion.Conjunction' ([  3.43483237e-07   5.77276691e-01   1.36694219e-01   5.75627445e-02
   8.25340874e-02   3.46922790e-02   1.62024382e-02   3.08377846e-02
   4.35711394e-02   7.32489702e-03   3.28866826e-03   2.60271916e-03
   3.28182094e-03   9.13636094e-04   1.92123157e-03   1.12007660e-03
   9.21370640e-05   2.14772366e-05   6.51613782e-06   3.37185511e-05
   1.23725446e-05   9.00225744e-06])
fallback 37593 to 'Expansion.Conjunction' ([  2.13986340e-09   9.83089748e-01   2.39349646e-03   9.12863181e-04
   7.74801944e-03   1.36992033e-03   1.28165630e-04   7.15244389e-04
   3.48373713e-03   6.65383270e-05   1.98298040e-05   1.32865762e-05
   2.29323578e-05   1.75611950e-05   9.75950573e-06   7.45998525e-06
   1.57848391e-07   1.53749710e-07   1.35812954e-07   6.47936703e-07
   2.66893580e-07   7.37299574e-08])
fallback 38226 to 'Expansion.Conjunction' ([  1.60212210e-07   6.01145322e-01   1.73591493e-01   9.90847267e-02
   2.48632075e-02   9.35223877e-03   3.56174779e-02   3.21903599e-02
   2.92425065e-03   4.05018354e-03   9.50720992e-03   2.59477271e-03
   3.54032821e-03   1.04752732e-04   9.89786691e-04   2.76611854e-04
   1.46815086e-04   8.50323424e-06   8.90350286e-07   4.92192335e-06
   1.51678897e-06   4.46995906e-06])
fallback 37148 to 'Expansion.Conjunction' ([  5.17973442e-11   9.95956299e-01   1.80593412e-03   1.26554398e-03
   1.75850800e-04   2.23735987e-05   3.53448208e-04   3.38227283e-04
   3.52425603e-06   6.46491706e-06   4.96864448e-05   6.67914945e-06
   1.42263270e-05   3.19649550e-08   1.20034349e-06   3.49150382e-07
   1.49060198e-07   2.63573562e-09   4.38934193e-10   2.51840703e-09
   5.26277132e-10   5.23911713e-09])
fallback 37799 to 'Expansion.Conjunction' ([  3.07755528e-07   6.17887505e-01   1.57489928e-01   1.00808272e-01
   2.08955578e-02   8.37475166e-03   3.88521669e-02   3.05020385e-02
   2.08346386e-03   4.35166207e-03   1.03145094e-02   3.02066239e-03
   3.61328461e-03   1.45825749e-04   1.05671586e-03   3.51956090e-04
   2.20988473e-04   1.33354062e-05   9.92963023e-07   5.67184141e-06
   2.59599282e-06   7.80781658e-06])
fallback 38787 to 'Expansion.Conjunction' ([  1.82192469e-10   9.96075921e-01   5.27748601e-04   1.78560613e-04
   1.94650468e-03   2.92819893e-04   2.26500304e-05   1.59543909e-04
   7.73272821e-04   1.06193774e-05   3.20025013e-06   1.87301269e-06
   3.26002234e-06   1.92749347e-06   9.77793199e-07   9.65596421e-07
   1.11558815e-08   1.21904947e-08   1.77550045e-08   8.56263889e-08
   2.08310363e-08   7.02288001e-09])
fallback 38115 to 'Expansion.Conjunction' ([  4.03331825e-07   7.64816720e-01   4.96925910e-02   2.09986628e-02
   6.91475065e-02   2.42625816e-02   5.11343464e-03   1.38090405e-02
   4.37427025e-02   3.08019862e-03   1.02811495e-03   9.23352571e-04
   1.07293730e-03   8.42959582e-04   8.55841986e-04   4.99822328e-04
   3.08672505e-05   1.78363866e-05   7.32357802e-06   3.01880653e-05
   2.09229661e-05   5.99159799e-06])
fallback 38620 to 'Expansion.Conjunction' ([  7.40081845e-08   8.60652555e-01   5.78034103e-02   3.82766160e-02
   7.77229610e-03   2.36051759e-03   1.45378325e-02   1.11412712e-02
   4.92746295e-04   1.07511574e-03   3.46759097e-03   8.16603239e-04
   1.18225159e-03   2.56907948e-05   2.61124569e-04   7.83054846e-05
   4.88776489e-05   2.83487721e-06   2.70021498e-07   1.42384907e-06
   5.68224258e-07   2.02456065e-06])
fallback 38640 to 'Expansion.Conjunction' ([  4.94288543e-07   6.69014160e-01   7.23557476e-02   3.05338299e-02
   9.06705489e-02   3.53662560e-02   8.06786963e-03   1.93626453e-02
   6.15261387e-02   4.78637454e-03   1.54745009e-03   1.50960464e-03
   1.71287964e-03   1.26492186e-03   1.33185811e-03   7.89396004e-04
   4.89080888e-05   2.24043562e-05   9.96944533e-06   4.43810207e-05
   2.57791927e-05   8.38284910e-06])
fallback 38929 to 'Expansion.Conjunction' ([  8.12881979e-07   2.00948745e-01   1.80254772e-01   7.81665592e-02
   1.74313128e-01   1.01397916e-01   2.27916445e-02   4.56514581e-02
   1.58648908e-01   1.39995068e-02   4.34271804e-03   4.80069079e-03
   4.42045135e-03   3.51655832e-03   4.28390362e-03   2.00263946e-03
   2.38567998e-04   4.61240415e-05   1.95762986e-05   9.61554613e-05
   3.92215697e-05   1.99430742e-05])
fallback 38401 to 'Expansion.Conjunction' ([  4.02293719e-11   9.96459093e-01   1.57817504e-03   1.11431352e-03
   1.52937257e-04   1.89948610e-05   3.10451877e-04   2.95884537e-04
   2.92456101e-06   5.35490577e-06   4.27666866e-05   5.58941307e-06
   1.21047891e-05   2.53649322e-08   9.70399722e-07   2.86206110e-07
   1.18488539e-07   2.01749822e-09   3.54071032e-10   2.03027933e-09
   4.11262563e-10   4.22709345e-09])
fallback 38499 to 'Expansion.Conjunction' ([  1.07337028e-10   9.97059597e-01   3.81534429e-04   1.24438726e-04
   1.47655003e-03   2.14100091e-04   1.53189232e-05   1.17331388e-04
   5.95888887e-04   7.20898025e-06   2.15873982e-06   1.23480597e-06
   2.10758233e-06   1.20072254e-06   6.05851434e-07   6.28068002e-07
   6.25125426e-09   7.16545854e-09   1.14126727e-08   5.47667696e-08
   1.21789096e-08   4.16204943e-09])
fallback 37310 to 'Expansion.Conjunction' ([  1.83343147e-07   7.06719214e-01   1.21525957e-01   7.85049715e-02
   1.60632281e-02   5.85001050e-03   2.99636104e-02   2.35948877e-02
   1.38642382e-03   2.91359748e-03   7.61526677e-03   2.07739112e-03
   2.60977631e-03   8.60386783e-05   7.07586697e-04   2.24279398e-04
   1.38935486e-04   7.89853577e-06   6.27910475e-07   3.57727478e-06
   1.56759732e-06   4.97069000e-06])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175481.ba+   1961656K    982671K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175481     rnn-hpca-+          2                         00:03:10      0:0 

Job 16175481 ("rnn-hpca-wikipedia") completed on c13-26 at tor dec 15 13:18:52 CET 2016
