Starting job 16175467 ("rnn-cw-wikipedia") on c13-26 at tor dec 15 13:06:56 CET 2016
Python environment is set up
Copying files to /work/jobs/16175467.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175467.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16175467.d/resources//word_embeddings/precompiled/c&w/size=50.merged
MODEL_PATH: /work/jobs/16175467.d/models/rnn-cw-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175467.d/resources//word_embeddings/precompiled/c&w/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:07] configuration (/work/jobs/16175467.d/models/rnn-cw-wikipedia/)
[2016-12-15 13:07]     config 'epochs': 200 (1000)
[2016-12-15 13:07]     config 'epochs_len': -1 (-1)
[2016-12-15 13:07]     config 'epochs_patience': 10 (20)
[2016-12-15 13:07]     config 'batch_size':  (64)
[2016-12-15 13:07]     config 'snapshot_size':  (2048)
[2016-12-15 13:07]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:07]     config 'words_dim': 20.0 (20)
[2016-12-15 13:07]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:07]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:07]     config 'final_dim': 40.0 (100)
[2016-12-15 13:07]     config 'arg1_len':  (100)
[2016-12-15 13:07]     config 'arg2_len':  (100)
[2016-12-15 13:07]     config 'conn_len':  (10)
[2016-12-15 13:07]     config 'punc_len':  (2)
[2016-12-15 13:07]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:07]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:07]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:07]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:07]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:07]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:07]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:07]     config 'words2vec_bin': None (None)
[2016-12-15 13:07]     config 'words2vec_txt': /work/jobs/16175467.d/resources//word_embeddings/precompiled/c&w/size=50.merged (None)
[2016-12-15 13:07]   args.lang: en
[2016-12-15 13:07]   args.model_dir: /work/jobs/16175467.d/models/rnn-cw-wikipedia/
[2016-12-15 13:07]   args.dataset_dir: /work/jobs/16175467.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-15 13:07]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll16st-en-03-29-16-dev/
[2016-12-15 13:07]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:07]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:07]   filter_types: None
[2016-12-15 13:07]   filter_senses: None
[2016-12-15 13:07]   filter_fn_name: conn_gt_0
[2016-12-15 13:07]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175467.d/resources//word_embeddings/precompiled/c&w/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:07] load dataset for prediction (/work/jobs/16175467.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:07] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-15 13:07]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:07] build model
[2016-12-15 13:07]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:08]     config 'optimizer':  (adam)
[2016-12-15 13:08] previous weights (/work/jobs/16175467.d/models/rnn-cw-wikipedia/)
[2016-12-15 13:08] convert from dataset (/work/jobs/16175467.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:08] make predictions
[2016-12-15 13:09] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll16st-en-03-29-16-dev/)
/work/jobs/16175467.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 35923 to 'Expansion.Conjunction' ([  1.45726526e-05   6.55129664e-01   1.25985740e-01   1.04921623e-01
   2.56062855e-02   5.13325626e-03   2.42012345e-02   2.71545534e-02
   2.80158428e-03   9.26701900e-03   6.34094134e-03   3.84082967e-03
   4.39743041e-03   3.26056321e-04   3.84667092e-03   7.05336271e-04
   2.23686116e-04   5.36566252e-05   3.77591523e-06   1.02090097e-05
   1.70250712e-05   1.88501233e-05])
fallback 36502 to 'Expansion.Conjunction' ([  5.46127158e-05   3.15412343e-01   1.86554328e-01   1.40538589e-01
   9.32470861e-02   3.53685767e-02   6.14662917e-02   5.30403444e-02
   2.83589979e-02   2.44993102e-02   9.49548932e-03   1.15983319e-02
   1.63666700e-02   4.48609890e-03   1.05921682e-02   6.12365968e-03
   2.11893069e-03   3.72544339e-04   8.71403029e-05   6.24344831e-05
   1.07528970e-04   4.85235579e-05])
fallback 36725 to 'Expansion.Conjunction' ([  2.67775813e-05   2.73095814e-01   2.67485258e-01   1.96919514e-01
   6.50468685e-02   1.70895716e-02   5.19546414e-02   5.53892286e-02
   1.13420653e-02   1.95019448e-02   1.04494159e-02   1.01377311e-02
   9.33054452e-03   1.41372251e-03   8.27626503e-03   1.91178671e-03
   4.25996778e-04   9.38474904e-05   1.46580922e-05   1.44188569e-05
   3.57887507e-05   4.41409898e-05])
fallback 36254 to 'Expansion.Conjunction' ([  6.51776827e-06   8.55166312e-01   4.96146081e-02   4.65250982e-02
   1.03277955e-02   1.96898611e-03   1.17830522e-02   1.19040133e-02
   6.65626369e-04   3.41080593e-03   3.22533281e-03   1.19978014e-03
   1.82092759e-03   1.03575330e-04   1.85457779e-03   2.73026554e-04
   1.08555432e-04   2.10569778e-05   1.69680310e-06   5.55146560e-06
   6.83255663e-06   6.27080905e-06])
fallback 36920 to 'Expansion.Conjunction' ([  3.91241610e-06   9.16002945e-01   2.78370870e-02   2.87838881e-02
   5.65881897e-03   8.29370241e-04   6.30236568e-03   7.49246836e-03
   3.54243128e-04   2.16362420e-03   1.94361425e-03   5.87981263e-04
   9.83837427e-04   3.62951366e-05   7.78331435e-04   1.50303796e-04
   6.06659825e-05   1.68875780e-05   5.61335763e-07   3.78087072e-06
   5.35812988e-06   3.65944363e-06])
fallback 36919 to 'Expansion.Conjunction' ([  2.27547553e-05   5.22172159e-01   1.18675569e-01   8.50753794e-02
   8.94800584e-02   3.70041695e-02   3.49136632e-02   4.00768002e-02
   2.61943772e-02   1.34321341e-02   4.36873646e-03   5.71124868e-03
   8.03738935e-03   3.14920772e-03   5.99012298e-03   4.29857341e-03
   1.03138563e-03   2.61268902e-04   3.51962994e-05   2.82297154e-05
   2.95543981e-05   1.20222095e-05])
fallback 36262 to 'Expansion.Conjunction' ([  6.84111146e-05   2.09459902e-01   2.05288263e-01   1.50332050e-01
   1.11319498e-01   4.96418032e-02   6.86281701e-02   6.02189791e-02
   4.10335365e-02   2.82907618e-02   1.09061627e-02   1.55704525e-02
   1.89025906e-02   6.67431210e-03   1.29649314e-02   7.36588943e-03
   2.51401753e-03   4.12031691e-04   1.36155578e-04   7.25147698e-05
   1.29917521e-04   6.96499124e-05])
fallback 36017 to 'Expansion.Conjunction' ([  1.27249177e-06   9.71498501e-01   8.77169437e-03   1.02430304e-02
   1.90880967e-03   2.28534470e-04   2.29060769e-03   2.83652990e-03
   7.78535623e-05   6.42409207e-04   7.13100142e-04   1.45510627e-04
   3.12792025e-04   8.41558732e-06   2.45631501e-04   4.59389417e-05
   1.98428027e-05   5.38331103e-06   1.69879956e-07   1.43299373e-06
   1.69428110e-06   8.44945486e-07])
fallback 36214 to 'Expansion.Conjunction' ([  1.44416958e-06   9.70454971e-01   8.90510511e-03   1.02479269e-02
   2.18954049e-03   2.56668509e-04   2.28919596e-03   3.07030201e-03
   1.18328416e-04   8.73401394e-04   7.24470053e-04   1.81512452e-04
   3.44924447e-04   1.02109177e-05   2.11686226e-04   7.41558745e-05
   3.12226178e-05   9.01749790e-06   1.61547899e-07   2.02196493e-06
   2.56791913e-06   1.16472788e-06])
fallback 37106 to 'Expansion.Conjunction' ([  4.30600230e-05   1.94847512e-01   1.56082200e-01   1.11775303e-01
   1.63084435e-01   9.70538050e-02   5.46327204e-02   5.47093422e-02
   9.57180351e-02   2.09861922e-02   5.46953137e-03   1.12859515e-02
   1.14292113e-02   6.65505753e-03   1.06357841e-02   3.70431162e-03
   1.37158183e-03   3.80177028e-04   5.38495232e-05   2.37556382e-05
   3.42680365e-05   2.39148907e-05])
fallback 36212 to 'Expansion.Conjunction' ([  1.97172467e-05   5.96465336e-01   1.41917241e-01   1.23802123e-01
   2.95761706e-02   7.02647756e-03   3.25489447e-02   3.12421818e-02
   2.70958355e-03   9.99693830e-03   7.76621589e-03   4.30347947e-03
   5.20485442e-03   4.54510727e-04   5.63687819e-03   9.26082119e-04
   2.80718982e-04   5.87185956e-05   7.23306796e-06   1.44176198e-05
   1.73497698e-05   2.48278115e-05])
fallback 36213 to 'Expansion.Conjunction' ([  3.91570939e-06   9.13286163e-01   2.88058784e-02   2.97330827e-02
   5.80296627e-03   8.72196177e-04   6.58542765e-03   7.65271962e-03
   3.54137044e-04   2.18222247e-03   1.99863318e-03   6.06539260e-04
   1.00621932e-03   3.78016090e-05   8.30735616e-04   1.50878741e-04
   6.12835583e-05   1.61719638e-05   5.99536244e-07   3.71300899e-06
   5.07294324e-06   3.64256135e-06])
fallback 36611 to 'Expansion.Conjunction' ([  1.98671260e-05   3.54552089e-01   2.35339745e-01   1.91552758e-01
   5.15326074e-02   1.24879023e-02   4.77938763e-02   4.92921359e-02
   6.56693753e-03   1.62041969e-02   9.66647358e-03   7.67886078e-03
   7.32147413e-03   8.64443833e-04   7.19183077e-03   1.45743007e-03
   3.33555420e-04   6.82483659e-05   9.26004848e-06   1.23476675e-05
   1.98367215e-05   3.41225058e-05])
fallback 36222 to 'Expansion.Conjunction' ([  1.75269952e-06   9.68621660e-01   9.39983585e-03   1.12616819e-02
   2.12942550e-03   2.49735834e-04   2.40163386e-03   3.30773691e-03
   9.86449293e-05   8.41551334e-04   8.04038826e-04   1.79499982e-04
   3.57384353e-04   8.68373890e-06   2.29669790e-04   6.55440810e-05
   2.64469706e-05   8.43515399e-06   1.89218964e-07   2.10493679e-06
   2.95248239e-06   1.39134623e-06])
fallback 36651 to 'Expansion.Conjunction' ([  1.30899007e-05   6.63974336e-01   7.68835162e-02   5.14379174e-02
   7.93178369e-02   3.19060679e-02   1.99195796e-02   2.92889658e-02
   2.28014753e-02   7.01581957e-03   2.24533162e-03   2.72124420e-03
   4.19796532e-03   1.88223666e-03   3.28838798e-03   2.48322586e-03
   3.92321521e-04   1.87041119e-04   1.37483901e-05   1.28517475e-05
   1.27380370e-05   4.30294034e-06])
fallback 36080 to 'Expansion.Conjunction' ([  1.51868335e-07   9.98541564e-01   1.16086736e-04   4.00918131e-05
   9.67327303e-04   8.93250882e-05   1.04305633e-05   1.31606004e-04
   8.20772524e-05   3.18597213e-06   1.53297192e-06   7.81668723e-07
   4.06197739e-06   2.02037421e-06   1.49605906e-06   7.88762077e-06
   3.67156002e-08   2.19320719e-07   1.09749078e-08   6.37205683e-08
   3.91732608e-08   2.39236157e-09])
fallback 36362 to 'Expansion.Conjunction' ([  3.16926844e-07   9.82551982e-01   5.37610794e-03   5.92029368e-03
   1.44278210e-03   1.72520375e-04   1.53367231e-03   1.54311243e-03
   9.30814267e-05   5.32150671e-04   3.45057833e-04   9.05223633e-05
   1.89877768e-04   7.54510158e-06   1.28772239e-04   4.10906646e-05
   2.54749918e-05   4.26517404e-06   5.31932928e-08   6.60928486e-07
   4.80736726e-07   1.79147561e-07])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175467.ba+   1654096K    851250K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175467     rnn-cw-wi+          2                         00:03:00      0:0 

Job 16175467 ("rnn-cw-wikipedia") completed on c13-26 at tor dec 15 13:09:54 CET 2016
