Starting job 16175490 ("rnn-randomprojection-wikipedia") on c31-28 at tor dec 15 13:18:47 CET 2016
Python environment is set up
Copying files to /work/jobs/16175490.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175490.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/
EMBEDDING_PATH: /work/jobs/16175490.d/resources//word_embeddings/precompiled/random_projection/size=50.merged
MODEL_PATH: /work/jobs/16175490.d/models/rnn-randomprojection-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-trial/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175490.d/resources//word_embeddings/precompiled/random_projection/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:19] configuration (/work/jobs/16175490.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:19]     config 'epochs': 200 (1000)
[2016-12-15 13:19]     config 'epochs_len': -1 (-1)
[2016-12-15 13:19]     config 'epochs_patience': 10 (20)
[2016-12-15 13:19]     config 'batch_size':  (64)
[2016-12-15 13:19]     config 'snapshot_size':  (2048)
[2016-12-15 13:19]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:19]     config 'words_dim': 20.0 (20)
[2016-12-15 13:19]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:19]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:19]     config 'final_dim': 40.0 (100)
[2016-12-15 13:19]     config 'arg1_len':  (100)
[2016-12-15 13:19]     config 'arg2_len':  (100)
[2016-12-15 13:19]     config 'conn_len':  (10)
[2016-12-15 13:19]     config 'punc_len':  (2)
[2016-12-15 13:19]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:19]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:19]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:19]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:19]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:19]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:19]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:19]     config 'words2vec_bin': None (None)
[2016-12-15 13:19]     config 'words2vec_txt': /work/jobs/16175490.d/resources//word_embeddings/precompiled/random_projection/size=50.merged (None)
[2016-12-15 13:19]   args.lang: en
[2016-12-15 13:19]   args.model_dir: /work/jobs/16175490.d/models/rnn-randomprojection-wikipedia/
[2016-12-15 13:19]   args.dataset_dir: /work/jobs/16175490.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/
[2016-12-15 13:19]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-trial/
[2016-12-15 13:19]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:19]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:19]   filter_types: None
[2016-12-15 13:19]   filter_senses: None
[2016-12-15 13:19]   filter_fn_name: conn_gt_0
[2016-12-15 13:19]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175490.d/resources//word_embeddings/precompiled/random_projection/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:19] load dataset for prediction (/work/jobs/16175490.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/)
[2016-12-15 13:19] lang: ?, doc_ids: 1, words: 896, rel_ids: 16, relation tokens: 760
[2016-12-15 13:19]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:19] build model
[2016-12-15 13:19]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:19]     config 'optimizer':  (adam)
[2016-12-15 13:19] previous weights (/work/jobs/16175490.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:19] convert from dataset (/work/jobs/16175490.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/)
[2016-12-15 13:19] make predictions
[2016-12-15 13:21] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-trial/)
/work/jobs/16175490.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 14898 to 'Expansion.Conjunction' ([  7.43299422e-09   9.99433273e-01   1.06007377e-04   7.42321277e-05
   9.02807655e-05   3.50356893e-05   1.67713805e-05   4.36989064e-05
   1.87872588e-04   4.82321636e-06   1.51209837e-06   1.53737141e-06
   2.42468035e-06   3.41515578e-08   1.39551275e-06   1.75526209e-07
   6.55281095e-07   7.56039778e-08   6.92765130e-09   1.04347108e-07
   4.52734239e-08   3.05062427e-08])
fallback 14902 to 'Expansion.Conjunction' ([  5.69054919e-06   8.08799911e-01   6.48632115e-02   4.95520488e-02
   1.48060022e-02   1.07935554e-02   1.14809720e-02   1.39817864e-02
   6.42448282e-03   9.81862923e-03   2.78103045e-03   1.74181126e-03
   1.22638965e-03   3.79392406e-04   2.60630386e-03   4.27058921e-04
   7.29826924e-05   8.57755137e-05   4.30793328e-05   3.04500386e-05
   6.05839333e-05   1.88517476e-05])
fallback 14882 to 'Expansion.Conjunction' ([  7.00952251e-06   5.89601952e-01   1.28743071e-01   1.16874117e-01
   2.82467519e-02   1.77343977e-02   3.04559218e-02   3.54635018e-02
   8.80975116e-03   2.10067468e-02   6.30273875e-03   6.85628058e-03
   3.54056700e-03   1.08217719e-03   3.56676743e-03   1.15322255e-03
   1.98243425e-04   1.04639238e-04   4.58985901e-05   8.43572295e-05
   1.08123549e-04   1.37637466e-05])
fallback 14891 to 'Expansion.Conjunction' ([  3.21470361e-05   4.62332391e-01   1.39832867e-01   7.37166245e-02
   7.39265297e-02   8.66172599e-02   2.73225415e-02   3.67321627e-02
   7.08808665e-02   7.92488631e-03   4.51515236e-03   2.24879078e-03
   3.08909100e-03   2.23578393e-03   6.75866836e-03   1.06855038e-03
   2.14418873e-04   2.60959172e-04   1.08894519e-04   5.74272336e-05
   9.35977937e-05   3.03891861e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175490.ba+   1509392K    696019K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175490     rnn-rando+          2                         00:02:26      0:0 

Job 16175490 ("rnn-randomprojection-wikipedia") completed on c31-28 at tor dec 15 13:21:11 CET 2016
