Starting job 16175470 ("rnn-randomprojection-wikipedia") on c31-33 at tor dec 15 13:07:57 CET 2016
Python environment is set up
Copying files to /work/jobs/16175470.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175470.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16175470.d/resources//word_embeddings/precompiled/random_projection/size=50.merged
MODEL_PATH: /work/jobs/16175470.d/models/rnn-randomprojection-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175470.d/resources//word_embeddings/precompiled/random_projection/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:08] configuration (/work/jobs/16175470.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:08]     config 'epochs': 200 (1000)
[2016-12-15 13:08]     config 'epochs_len': -1 (-1)
[2016-12-15 13:08]     config 'epochs_patience': 10 (20)
[2016-12-15 13:08]     config 'batch_size':  (64)
[2016-12-15 13:08]     config 'snapshot_size':  (2048)
[2016-12-15 13:08]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:08]     config 'words_dim': 20.0 (20)
[2016-12-15 13:08]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:08]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:08]     config 'final_dim': 40.0 (100)
[2016-12-15 13:08]     config 'arg1_len':  (100)
[2016-12-15 13:08]     config 'arg2_len':  (100)
[2016-12-15 13:08]     config 'conn_len':  (10)
[2016-12-15 13:08]     config 'punc_len':  (2)
[2016-12-15 13:08]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:08]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:08]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:08]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:08]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:08]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:08]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:08]     config 'words2vec_bin': None (None)
[2016-12-15 13:08]     config 'words2vec_txt': /work/jobs/16175470.d/resources//word_embeddings/precompiled/random_projection/size=50.merged (None)
[2016-12-15 13:08]   args.lang: en
[2016-12-15 13:08]   args.model_dir: /work/jobs/16175470.d/models/rnn-randomprojection-wikipedia/
[2016-12-15 13:08]   args.dataset_dir: /work/jobs/16175470.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-15 13:08]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-dev/
[2016-12-15 13:08]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:08]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:08]   filter_types: None
[2016-12-15 13:08]   filter_senses: None
[2016-12-15 13:08]   filter_fn_name: conn_gt_0
[2016-12-15 13:08]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175470.d/resources//word_embeddings/precompiled/random_projection/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:08] load dataset for prediction (/work/jobs/16175470.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:08] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-15 13:08]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:08] build model
[2016-12-15 13:08]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:08]     config 'optimizer':  (adam)
[2016-12-15 13:09] previous weights (/work/jobs/16175470.d/models/rnn-randomprojection-wikipedia/)
[2016-12-15 13:09] convert from dataset (/work/jobs/16175470.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:09] make predictions
[2016-12-15 13:10] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-randomprojection-wikipedia-conll16st-en-03-29-16-dev/)
/work/jobs/16175470.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 35816 to 'Expansion.Conjunction' ([  3.36210360e-05   2.76798988e-01   1.94104056e-01   1.85521152e-01
   6.09272035e-02   4.29129070e-02   6.49756254e-02   6.35757731e-02
   1.97051722e-02   3.98139647e-02   1.37813582e-02   1.30094669e-02
   8.38995894e-03   4.40711426e-03   6.89137899e-03   3.45125880e-03
   6.11359183e-04   3.03293805e-04   1.52302946e-04   2.30138549e-04
   3.60099620e-04   4.38070519e-05])
fallback 36082 to 'Expansion.Conjunction' ([  1.18694652e-05   4.15430895e-01   1.77790415e-01   1.61363882e-01
   4.22215491e-02   2.84735275e-02   4.67196060e-02   5.04584302e-02
   1.36355429e-02   3.02822956e-02   9.00878367e-03   9.40850172e-03
   5.26882511e-03   2.09871117e-03   5.16492398e-03   1.85176412e-03
   2.92165024e-04   1.51669182e-04   7.19658914e-05   1.09909377e-04
   1.66301219e-04   1.84670094e-05])
fallback 36194 to 'Expansion.Conjunction' ([  1.18694652e-05   4.15430895e-01   1.77790415e-01   1.61363882e-01
   4.22215491e-02   2.84735275e-02   4.67196060e-02   5.04584302e-02
   1.36355429e-02   3.02822956e-02   9.00878367e-03   9.40850172e-03
   5.26882511e-03   2.09871117e-03   5.16492398e-03   1.85176412e-03
   2.92165024e-04   1.51669182e-04   7.19658914e-05   1.09909377e-04
   1.66301219e-04   1.84670094e-05])
fallback 36838 to 'Expansion.Conjunction' ([  2.46876007e-05   2.59216816e-01   1.91722021e-01   1.14990600e-01
   9.72368197e-02   1.10662170e-01   4.92641740e-02   5.75021804e-02
   7.81531782e-02   1.24944896e-02   6.47964050e-03   3.15394952e-03
   4.71407781e-03   3.84075428e-03   8.09594804e-03   1.69618125e-03
   2.25016615e-04   2.47340271e-04   1.11530448e-04   5.82295180e-05
   8.65128751e-05   2.36830402e-05])
fallback 36788 to 'Expansion.Conjunction' ([  2.40187765e-05   2.79026391e-01   1.81550534e-01   1.03018240e-01
   9.97269831e-02   1.19713061e-01   4.33127175e-02   5.39303649e-02
   8.18208015e-02   1.06234831e-02   5.79982395e-03   2.99155412e-03
   4.22445408e-03   3.67800242e-03   8.33376037e-03   1.49485086e-03
   2.20187810e-04   2.55847730e-04   1.02063518e-04   5.39411780e-05
   7.84535738e-05   2.04651534e-05])
fallback 36254 to 'Expansion.Conjunction' ([  7.03304750e-07   9.49197653e-01   1.67961438e-02   1.56846606e-02
   3.23209331e-03   1.49882387e-03   3.06204777e-03   4.12805799e-03
   8.07291947e-04   2.74734503e-03   7.79264726e-04   9.47218974e-04
   4.52031703e-04   4.43053433e-05   4.29289999e-04   1.04204315e-04
   2.87525764e-05   1.70907934e-05   5.79649033e-06   1.97536320e-05
   1.40329867e-05   3.43752778e-06])
fallback 36502 to 'Expansion.Conjunction' ([  4.01824473e-05   7.90916998e-01   5.94294458e-02   4.08220897e-02
   2.13583620e-02   2.00258871e-02   1.30655228e-02   1.61029290e-02
   1.78770353e-02   7.33093934e-03   3.41052360e-03   1.37910401e-03
   1.94576236e-03   8.13106734e-04   3.96076599e-03   6.75244680e-04
   1.90114898e-04   1.90531825e-04   1.38097490e-04   6.62906256e-05
   1.39101921e-04   1.21964799e-04])
fallback 36284 to 'Expansion.Conjunction' ([  2.26508619e-05   2.76855619e-01   1.74659685e-01   9.71762097e-02
   1.07075275e-01   1.33096740e-01   3.83448976e-02   5.25662828e-02
   8.19794019e-02   9.86435829e-03   5.64114101e-03   3.14952109e-03
   4.04187853e-03   3.60238228e-03   9.73222224e-03   1.43392199e-03
   2.27515092e-04   2.92589482e-04   9.50379623e-05   4.87529654e-05
   7.81300046e-05   1.57863434e-05])
fallback 36919 to 'Expansion.Conjunction' ([  2.58550517e-05   7.70117332e-01   6.47631502e-02   3.72520307e-02
   2.72935383e-02   2.78137918e-02   1.16503349e-02   1.58118827e-02
   3.11353016e-02   4.61569003e-03   2.49641618e-03   1.09041120e-03
   1.43842816e-03   6.38996242e-04   2.90677041e-03   4.48871805e-04
   1.34545173e-04   1.39817506e-04   6.84250690e-05   4.10443312e-05
   7.77313606e-05   3.96354329e-05])
fallback 35818 to 'Expansion.Conjunction' ([  8.28525117e-06   3.05931863e-01   2.07733808e-01   2.02939106e-01
   4.86403363e-02   3.71017228e-02   5.82035252e-02   5.50934740e-02
   1.58744099e-02   3.50381914e-02   9.48964235e-03   8.61971163e-03
   5.07881067e-03   2.42278256e-03   5.46346273e-03   1.77824158e-03
   2.13624834e-04   1.20917508e-04   5.82713794e-05   6.29015478e-05
   1.16123511e-04   1.07890345e-05])
fallback 36725 to 'Expansion.Conjunction' ([  5.06130300e-06   5.39109360e-01   1.51262376e-01   1.31157475e-01
   3.22095646e-02   2.41000657e-02   3.34013148e-02   3.40339585e-02
   1.13986938e-02   2.35214108e-02   5.89738425e-03   4.53411331e-03
   2.71859212e-03   1.14847710e-03   4.19653634e-03   9.36549292e-04
   1.12060285e-04   9.51734710e-05   4.48175969e-05   3.69162924e-05
   7.00538089e-05   1.00458194e-05])
fallback 36212 to 'Expansion.Conjunction' ([  1.94465997e-06   8.22494782e-01   5.77589593e-02   5.49967721e-02
   1.07785647e-02   6.18610979e-03   1.17090919e-02   1.49651771e-02
   3.05485740e-03   8.84603777e-03   2.66904237e-03   2.92397352e-03
   1.37352532e-03   2.51276615e-04   1.42296935e-03   3.63267279e-04
   6.83098314e-05   3.98844593e-05   1.57576574e-05   3.74227046e-05
   3.66172161e-05   5.65733656e-06])
fallback 37106 to 'Expansion.Conjunction' ([  2.61823643e-05   4.73894866e-01   1.38212860e-01   7.21665027e-02
   7.28270786e-02   8.44341966e-02   2.55128481e-02   3.51544359e-02
   7.10342826e-02   7.58278325e-03   4.21835157e-03   2.15128763e-03
   2.92550145e-03   1.89935312e-03   6.35679859e-03   9.38420943e-04
   1.90041480e-04   2.26935183e-04   9.21625399e-05   4.94112356e-05
   8.29677667e-05   2.27329093e-05])
fallback 36611 to 'Expansion.Conjunction' ([  3.04844025e-06   6.40754442e-01   1.20970566e-01   1.05666768e-01
   2.30721228e-02   1.51196211e-02   2.44887333e-02   2.76687528e-02
   7.10344945e-03   1.89477777e-02   4.44884305e-03   4.82516162e-03
   2.38942674e-03   7.18072908e-04   2.84471354e-03   7.03131584e-04
   9.37617777e-05   6.28446122e-05   2.60258868e-05   3.39952374e-05
   5.22960019e-05   6.44584659e-06])
fallback 35802 to 'Expansion.Conjunction' ([  2.95738719e-05   3.58702864e-01   1.65121762e-01   9.21466937e-02
   8.67765239e-02   1.03772878e-01   3.70375100e-02   4.65438287e-02
   7.52953507e-02   9.70777300e-03   5.38537832e-03   2.67877241e-03
   3.76217948e-03   3.12397789e-03   7.77510964e-03   1.35993362e-03
   2.27016773e-04   2.64341649e-04   1.12278502e-04   5.87677926e-05
   8.93773458e-05   2.81086320e-05])
fallback 35923 to 'Expansion.Conjunction' ([  1.24744747e-06   8.16999139e-01   6.41688259e-02   5.57053463e-02
   1.08188866e-02   6.69128263e-03   1.13191027e-02   1.36699584e-02
   3.18363007e-03   9.68873131e-03   2.20022374e-03   2.36480497e-03
   1.12042867e-03   2.41117945e-04   1.41601020e-03   2.79812958e-04
   4.03984705e-05   3.22641500e-05   1.26210562e-05   1.84594701e-05
   2.39971524e-05   3.71058355e-06])
fallback 37110 to 'Expansion.Conjunction' ([  2.04576245e-05   1.95131181e-01   1.91289706e-01   1.13566509e-01
   1.16035513e-01   1.41076444e-01   4.99541867e-02   6.05545672e-02
   9.04227115e-02   1.13496873e-02   6.25137467e-03   3.53414911e-03
   4.51103268e-03   4.53276928e-03   9.32295053e-03   1.72645888e-03
   2.34502220e-04   2.60715371e-04   8.99453800e-05   5.12418296e-05
   6.88600406e-05   1.50362065e-05])
fallback 36245 to 'Expansion.Conjunction' ([  1.22045012e-05   3.26012878e-01   2.01540454e-01   1.84030145e-01
   5.34678733e-02   4.57249021e-02   5.49519730e-02   5.20838273e-02
   2.00635138e-02   3.11953703e-02   9.45287659e-03   5.89386232e-03
   4.23907673e-03   2.50601698e-03   6.53031698e-03   1.67124531e-03
   1.82394068e-04   1.57872403e-04   8.87331331e-05   5.76738819e-05
   1.19187105e-04   1.76029297e-05])
fallback 36214 to 'Expansion.Conjunction' ([  2.79562329e-07   9.68214763e-01   1.22618938e-02   9.80700100e-03
   1.54491726e-03   8.75786250e-04   1.61932958e-03   2.02189808e-03
   4.90057231e-04   1.87857440e-03   3.54504072e-04   4.17311856e-04
   1.67528286e-04   2.31217822e-05   2.58794029e-04   3.04469981e-05
   6.95082427e-06   8.97919666e-06   3.30878247e-06   6.60335818e-06
   6.10321248e-06   1.84698470e-06])
fallback 36262 to 'Expansion.Conjunction' ([  6.51711453e-05   6.30131674e-01   1.03808614e-01   6.97184889e-02
   4.01054331e-02   3.93886499e-02   2.36551226e-02   2.79311376e-02
   3.28697233e-02   1.09996518e-02   5.40929159e-03   2.15972429e-03
   3.25544744e-03   1.70959757e-03   6.23219380e-03   1.29786358e-03
   2.91834446e-04   3.07442277e-04   2.19789382e-04   9.52152132e-05
   2.10615359e-04   1.37318467e-04])
fallback 36017 to 'Expansion.Conjunction' ([  1.15720326e-07   9.85975578e-01   4.86525295e-03   4.63208377e-03
   7.69392890e-04   3.19288583e-04   8.24984757e-04   1.02975885e-03
   1.74684438e-04   7.50613410e-04   1.74985896e-04   2.27259199e-04
   1.05472087e-04   5.98889855e-06   1.06032219e-04   1.65029508e-05
   6.22887055e-06   4.24779734e-06   1.33180506e-06   6.30715849e-06
   2.93767293e-06   9.51862731e-07])
fallback 36051 to 'Expansion.Conjunction' ([  9.19046579e-06   3.41791810e-01   1.98377417e-01   1.89420224e-01
   4.63719557e-02   3.39033009e-02   5.42767609e-02   5.39826865e-02
   1.50609911e-02   3.33307164e-02   9.27486648e-03   8.94609471e-03
   5.17948347e-03   2.28600345e-03   5.34849896e-03   1.79613511e-03
   2.36857218e-04   1.28281434e-04   6.13470550e-05   7.51993142e-05
   1.29539768e-04   1.26400865e-05])
fallback 36060 to 'Expansion.Conjunction' ([  5.00331680e-06   4.75847337e-01   1.70661227e-01   1.51459621e-01
   3.54640971e-02   2.51398852e-02   3.86307056e-02   3.99408306e-02
   1.14344089e-02   2.76591500e-02   6.58517988e-03   6.53977511e-03
   3.47982792e-03   1.39194064e-03   4.22008572e-03   1.14312862e-03
   1.37526281e-04   9.08240261e-05   4.03074885e-05   4.31357151e-05
   7.75293016e-05   8.47368944e-06])
fallback 35791 to 'Expansion.Conjunction' ([  4.01557627e-05   4.35107976e-01   1.51913896e-01   8.83792117e-02
   7.16418922e-02   8.01818594e-02   3.38056721e-02   4.12183068e-02
   6.31641224e-02   1.03895245e-02   5.61963953e-03   2.54049315e-03
   3.69597366e-03   2.69010290e-03   7.27812666e-03   1.41087884e-03
   2.51201825e-04   2.85197078e-04   1.43932426e-04   7.11654065e-05
   1.22558515e-04   4.81131173e-05])
fallback 36222 to 'Expansion.Conjunction' ([  1.25627636e-07   9.72888044e-01   9.65898010e-03   9.46868110e-03
   1.19106587e-03   6.40090957e-04   1.47208559e-03   1.83726531e-03
   3.16427698e-04   1.47348944e-03   2.99408622e-04   3.78186346e-04
   1.52242412e-04   1.37602436e-05   1.67263743e-04   2.22307442e-05
   5.25913079e-06   4.79976412e-06   1.61690967e-06   4.83145227e-06
   3.34672538e-06   7.97929197e-07])
fallback 36464 to 'Expansion.Conjunction' ([  6.56889870e-06   5.21046384e-01   1.52429755e-01   1.34796720e-01
   3.51711985e-02   2.76295963e-02   3.55506678e-02   3.59510210e-02
   1.29929237e-02   2.34287225e-02   6.50926334e-03   4.24368247e-03
   2.83451463e-03   1.27908386e-03   4.67822966e-03   1.02546401e-03
   1.22918045e-04   1.13386410e-04   5.65267384e-05   4.07811773e-05
   7.95971331e-05   1.29953347e-05])
fallback 37045 to 'Expansion.Conjunction' ([  2.68418898e-05   2.51449765e-01   1.98707462e-01   1.27950103e-01
   9.22089224e-02   9.98767471e-02   5.45707981e-02   5.98890598e-02
   6.97460178e-02   1.49377036e-02   7.33879492e-03   3.40954775e-03
   5.15813802e-03   3.83729141e-03   8.18466772e-03   1.90126257e-03
   2.39702889e-04   2.44488999e-04   1.26064465e-04   6.41442606e-05
   1.03119012e-04   2.93568011e-05])
fallback 36080 to 'Expansion.Conjunction' ([  3.39228257e-10   9.99931343e-01   1.16775055e-05   8.10171702e-06
   1.14402575e-05   3.01642810e-06   1.41495174e-06   4.96065881e-06
   2.67451926e-05   4.91952736e-07   1.21561002e-07   1.93525752e-07
   3.08883701e-07   1.39973112e-09   7.78048280e-08   1.07617356e-08
   7.11933344e-08   5.82597574e-09   3.04897082e-10   1.17364253e-08
   3.52837273e-09   1.69995319e-09])
fallback 36362 to 'Expansion.Conjunction' ([  1.67515751e-07   9.91562108e-01   3.60226507e-03   1.96528501e-03
   5.43677877e-04   3.24310583e-04   3.57266625e-04   5.75494301e-04
   2.95490079e-04   4.18092640e-04   8.58229233e-05   9.19033245e-05
   4.39034730e-05   6.89112480e-06   1.05396013e-04   7.91457462e-06
   2.71865628e-06   4.23295833e-06   1.34203478e-06   2.03919554e-06
   2.15471932e-06   1.52319225e-06])
fallback 36651 to 'Expansion.Conjunction' ([  1.33169697e-05   8.16662438e-01   4.83258222e-02   2.72307082e-02
   2.29104331e-02   2.45887621e-02   7.87739462e-03   1.16366112e-02
   3.22523641e-02   2.66461472e-03   1.54283737e-03   7.76049338e-04
   8.39697029e-04   3.37085166e-04   1.83295821e-03   2.35366026e-04
   8.81971289e-05   8.00575733e-05   2.73409134e-05   2.44565201e-05
   3.80615423e-05   1.54284918e-05])
fallback 36213 to 'Expansion.Conjunction' ([  2.93336740e-07   9.49659148e-01   1.74094491e-02   1.70867812e-02
   2.47692055e-03   1.34385572e-03   2.83280428e-03   3.77994581e-03
   6.47510853e-04   2.57491291e-03   6.34109413e-04   7.60921027e-04
   3.20048414e-04   3.34282333e-05   3.40352060e-04   5.78415480e-05
   1.19567400e-05   9.17250943e-06   3.19869871e-06   8.91958260e-06
   7.03060080e-06   1.39985306e-06])
fallback 36112 to 'Expansion.Conjunction' ([  1.14135019e-05   4.65713773e-01   1.64394589e-01   1.42255933e-01
   4.30418108e-02   3.56523994e-02   4.02277227e-02   4.14484370e-02
   1.70691872e-02   2.50667224e-02   7.67657866e-03   4.59434189e-03
   3.36458583e-03   1.75710839e-03   5.82517083e-03   1.31546265e-03
   1.61700825e-04   1.55200179e-04   8.40217697e-05   5.32596719e-05
   1.09754678e-04   2.08265375e-05])
fallback 35749 to 'Expansion.Conjunction' ([  4.23276651e-05   4.49584997e-01   1.48893492e-01   8.73303574e-02
   6.90633291e-02   7.65113319e-02   3.30912438e-02   4.02013069e-02
   6.07799300e-02   1.04715015e-02   5.64491291e-03   2.51217586e-03
   3.67297307e-03   2.61631123e-03   7.21697659e-03   1.41507587e-03
   2.55707626e-04   2.90032480e-04   1.50418348e-04   7.33337957e-05
   1.29526963e-04   5.27377422e-05])
fallback 36070 to 'Expansion.Conjunction' ([  2.31422036e-05   2.20278475e-01   2.00621950e-01   1.25477196e-01
   1.00963735e-01   1.12537587e-01   5.52950807e-02   6.16139480e-02
   7.91431303e-02   1.37262328e-02   6.93370970e-03   3.39789577e-03
   5.06894344e-03   4.14593197e-03   8.16795148e-03   1.86526196e-03
   2.27004627e-04   2.38040305e-04   1.08901289e-04   5.87019939e-05
   8.49352011e-05   2.22446927e-05])
fallback 36920 to 'Expansion.Conjunction' ([  2.83747710e-07   9.47129231e-01   1.85710654e-02   1.77917067e-02
   2.58160028e-03   1.42642562e-03   2.95281637e-03   3.87528438e-03
   6.74646102e-04   2.78737251e-03   6.34446204e-04   7.61738498e-04
   3.27966781e-04   3.56420053e-05   3.52454190e-04   5.72106426e-05
   1.11491806e-05   9.33288247e-06   3.28397908e-06   8.09346677e-06
   6.89778549e-06   1.35241496e-06])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175470.ba+   1663416K    849949K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175470     rnn-rando+          2                         00:02:20      0:0 

Job 16175470 ("rnn-randomprojection-wikipedia") completed on c31-33 at tor dec 15 13:10:15 CET 2016
