Starting job 16188518 ("rnn-rsv100-wikipedia") on c16-13 at lör dec 17 14:27:06 CET 2016
Python environment is set up
Copying files to /work/jobs/16188518.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16188518.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/
EMBEDDING_PATH: /work/jobs/16188518.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed
MODEL_PATH: /work/jobs/16188518.d/models/rnn-rsv100-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-rsv100-wikipedia-conll16st-en-03-29-16-trial/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16188518.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-17 14:27] configuration (/work/jobs/16188518.d/models/rnn-rsv100-wikipedia/)
[2016-12-17 14:27]     config 'epochs': 200 (1000)
[2016-12-17 14:27]     config 'epochs_len': -1 (-1)
[2016-12-17 14:27]     config 'epochs_patience': 10 (20)
[2016-12-17 14:27]     config 'batch_size':  (64)
[2016-12-17 14:27]     config 'snapshot_size':  (2048)
[2016-12-17 14:27]     config 'random_per_sample': 24.0 (32)
[2016-12-17 14:27]     config 'words_dim': 20.0 (20)
[2016-12-17 14:27]     config 'focus_dim': 6.0 (4)
[2016-12-17 14:27]     config 'rnn_dim': 50.0 (20)
[2016-12-17 14:27]     config 'final_dim': 40.0 (100)
[2016-12-17 14:27]     config 'arg1_len':  (100)
[2016-12-17 14:27]     config 'arg2_len':  (100)
[2016-12-17 14:27]     config 'conn_len':  (10)
[2016-12-17 14:27]     config 'punc_len':  (2)
[2016-12-17 14:27]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-17 14:27]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-17 14:27]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-17 14:27]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-17 14:27]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-17 14:27]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-17 14:27]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-17 14:27]     config 'words2vec_bin': None (None)
[2016-12-17 14:27]     config 'words2vec_txt': /work/jobs/16188518.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed (None)
[2016-12-17 14:27]   args.lang: en
[2016-12-17 14:27]   args.model_dir: /work/jobs/16188518.d/models/rnn-rsv100-wikipedia/
[2016-12-17 14:27]   args.dataset_dir: /work/jobs/16188518.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/
[2016-12-17 14:27]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-rsv100-wikipedia-conll16st-en-03-29-16-trial/
[2016-12-17 14:27]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-17 14:27]   os.getenv("THEANO_FLAGS"): None
[2016-12-17 14:27]   filter_types: None
[2016-12-17 14:27]   filter_senses: None
[2016-12-17 14:27]   filter_fn_name: conn_gt_0
[2016-12-17 14:27]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16188518.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-17 14:27] load dataset for prediction (/work/jobs/16188518.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/)
[2016-12-17 14:27] lang: ?, doc_ids: 1, words: 896, rel_ids: 16, relation tokens: 760
[2016-12-17 14:27]   rel_senses2id: 22, words2id: 43918
[2016-12-17 14:27] build model
[2016-12-17 14:27]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-17 14:27]     config 'optimizer':  (adam)
[2016-12-17 14:28] previous weights (/work/jobs/16188518.d/models/rnn-rsv100-wikipedia/)
[2016-12-17 14:28] convert from dataset (/work/jobs/16188518.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/)
[2016-12-17 14:28] make predictions
[2016-12-17 14:29] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-rsv100-wikipedia-conll16st-en-03-29-16-trial/)
/work/jobs/16188518.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 14891 to 'Expansion.Conjunction' ([  7.32397093e-05   2.64297906e-01   1.43390374e-01   9.38798203e-02
   1.30875127e-01   1.28950657e-01   3.03563387e-02   3.80207678e-02
   8.80230305e-02   2.75292456e-02   5.63986933e-03   6.21021408e-03
   5.06852714e-03   8.86377332e-03   1.32925913e-02   1.31655291e-02
   9.87118939e-04   1.64526051e-04   2.51109075e-04   1.28863789e-04
   4.69948055e-04   3.61421733e-04])
fallback 14902 to 'Expansion.Conjunction' ([  3.42937274e-05   5.92073678e-01   1.25309199e-01   1.21856980e-01
   2.61321384e-02   2.78110317e-02   2.95977629e-02   2.45859213e-02
   4.39624767e-03   1.40697621e-02   9.86226274e-03   2.88908323e-03
   7.97321832e-03   1.95555621e-03   6.30951998e-03   3.47516895e-03
   1.10104994e-03   4.73376239e-05   4.36905065e-05   9.21311583e-05
   2.77059298e-04   1.06907559e-04])
fallback 14898 to 'Expansion.Conjunction' ([  7.76970580e-07   9.14468276e-01   1.54974198e-02   6.20417801e-03
   1.87757721e-02   2.20250708e-02   1.36129836e-03   2.40010346e-03
   1.29323945e-02   3.09420769e-03   2.13872551e-04   1.96968304e-04
   2.69728243e-04   1.86624789e-04   1.26812419e-03   1.01992265e-03
   3.06780308e-05   3.24072012e-06   4.68445517e-06   2.05391640e-06
   2.77065697e-05   1.68979166e-05])
fallback 14882 to 'Expansion.Conjunction' ([  5.86375718e-05   3.80205985e-01   2.30081764e-01   1.62146775e-01
   3.38845994e-02   4.39734380e-02   4.11708090e-02   4.09758794e-02
   7.48770908e-03   1.52181385e-02   1.40351186e-02   3.56511069e-03
   1.01533438e-02   2.75958466e-03   7.69750579e-03   4.69284453e-03
   1.15488561e-03   1.31424471e-04   4.14996789e-05   7.17893264e-05
   3.79604894e-04   1.13553024e-04])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16188518.ba+   1498820K    678115K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16188518     rnn-rsv10+          2                         00:02:43      0:0 

Job 16188518 ("rnn-rsv100-wikipedia") completed on c16-13 at lör dec 17 14:29:44 CET 2016
