Starting job 16175477 ("rnn-cw-wikipedia") on c16-33 at tor dec 15 13:10:52 CET 2016
Python environment is set up
Copying files to /work/jobs/16175477.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175477.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16175477.d/resources//word_embeddings/precompiled/c&w/size=50.merged
MODEL_PATH: /work/jobs/16175477.d/models/rnn-cw-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175477.d/resources//word_embeddings/precompiled/c&w/size=50.merged", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:11] configuration (/work/jobs/16175477.d/models/rnn-cw-wikipedia/)
[2016-12-15 13:11]     config 'epochs': 200 (1000)
[2016-12-15 13:11]     config 'epochs_len': -1 (-1)
[2016-12-15 13:11]     config 'epochs_patience': 10 (20)
[2016-12-15 13:11]     config 'batch_size':  (64)
[2016-12-15 13:11]     config 'snapshot_size':  (2048)
[2016-12-15 13:11]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:11]     config 'words_dim': 20.0 (20)
[2016-12-15 13:11]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:11]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:11]     config 'final_dim': 40.0 (100)
[2016-12-15 13:11]     config 'arg1_len':  (100)
[2016-12-15 13:11]     config 'arg2_len':  (100)
[2016-12-15 13:11]     config 'conn_len':  (10)
[2016-12-15 13:11]     config 'punc_len':  (2)
[2016-12-15 13:11]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:11]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:11]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:11]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:11]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:11]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:11]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:11]     config 'words2vec_bin': None (None)
[2016-12-15 13:11]     config 'words2vec_txt': /work/jobs/16175477.d/resources//word_embeddings/precompiled/c&w/size=50.merged (None)
[2016-12-15 13:11]   args.lang: en
[2016-12-15 13:11]   args.model_dir: /work/jobs/16175477.d/models/rnn-cw-wikipedia/
[2016-12-15 13:11]   args.dataset_dir: /work/jobs/16175477.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-15 13:11]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll16st-en-03-29-16-test/
[2016-12-15 13:11]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:11]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:11]   filter_types: None
[2016-12-15 13:11]   filter_senses: None
[2016-12-15 13:11]   filter_fn_name: conn_gt_0
[2016-12-15 13:11]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175477.d/resources//word_embeddings/precompiled/c&w/size=50.merged', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:11] load dataset for prediction (/work/jobs/16175477.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:11] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-15 13:11]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:11] build model
[2016-12-15 13:11]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:12]     config 'optimizer':  (adam)
[2016-12-15 13:12] previous weights (/work/jobs/16175477.d/models/rnn-cw-wikipedia/)
[2016-12-15 13:12] convert from dataset (/work/jobs/16175477.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-15 13:12] make predictions
[2016-12-15 13:14] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-cw-wikipedia-conll16st-en-03-29-16-test/)
/work/jobs/16175477.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 38620 to 'Expansion.Conjunction' ([  4.69757060e-06   8.93925259e-01   3.56945697e-02   3.58735103e-02
   7.12673141e-03   1.15678996e-03   8.17865329e-03   9.08787000e-03
   4.45445975e-04   2.61531191e-03   2.41071338e-03   7.84640500e-04
   1.24435186e-03   5.23351888e-05   1.10685419e-03   1.84593753e-04
   7.45500592e-05   1.79320889e-05   8.29504993e-07   4.25630019e-06
   5.58250446e-06   4.52105774e-06])
fallback 37197 to 'Expansion.Conjunction' ([  2.96799590e-05   2.86018556e-01   2.62743597e-01   1.90083209e-01
   6.47095007e-02   1.70630089e-02   5.06636137e-02   5.44509227e-02
   1.17274534e-02   1.96176417e-02   1.04840791e-02   1.02450794e-02
   9.69622116e-03   1.46344039e-03   8.38202812e-03   1.94878857e-03
   4.49482011e-04   1.03700159e-04   1.59570375e-05   1.61079009e-05
   4.19438410e-05   4.59891789e-05])
fallback 38638 to 'Expansion.Conjunction' ([  3.14874887e-05   2.94823762e-01   2.59448942e-01   1.85984043e-01
   6.43023840e-02   1.69775689e-02   4.98512902e-02   5.38138032e-02
   1.18758081e-02   1.96405628e-02   1.04923228e-02   1.02798276e-02
   9.89314528e-03   1.48541618e-03   8.43431603e-03   1.96596186e-03
   4.62942518e-04   1.09674844e-04   1.67262440e-05   1.72068410e-05
   4.57778254e-05   4.70303706e-05])
fallback 37310 to 'Expansion.Conjunction' ([  7.88925718e-06   8.24961797e-01   6.05242338e-02   5.72422232e-02
   1.19606147e-02   2.21035098e-03   1.33424329e-02   1.42681229e-02
   8.85636854e-04   4.43550534e-03   3.83196546e-03   1.52873949e-03
   2.15647630e-03   1.13987781e-04   2.02065757e-03   3.28554342e-04
   1.26249305e-04   2.85856810e-05   1.64248255e-06   6.64700077e-06
   8.81581053e-06   8.87144796e-06])
fallback 38643 to 'Expansion.Conjunction' ([  1.47044511e-05   6.75300733e-01   1.16981800e-01   1.00700917e-01
   2.32780693e-02   4.77434007e-03   2.34669955e-02   2.55075625e-02
   2.34691827e-03   8.60342683e-03   6.23837314e-03   3.52086973e-03
   4.16274099e-03   2.91166601e-04   3.81666477e-03   6.72696814e-04
   2.21054846e-04   5.18079226e-05   3.74775672e-06   1.06397013e-05
   1.59926771e-05   1.87782284e-05])
fallback 37830 to 'Expansion.Conjunction' ([  5.07195691e-05   3.88125056e-01   1.77812693e-01   1.34515596e-01
   7.70457078e-02   2.53121477e-02   5.51344185e-02   4.77724068e-02
   1.97484285e-02   2.17809003e-02   9.31126238e-03   9.33349771e-03
   1.42356751e-02   3.26398429e-03   9.50267524e-03   4.86522207e-03
   1.61350190e-03   3.08631245e-04   5.70824623e-05   5.64896246e-05
   1.09963969e-04   4.39391108e-05])
fallback 38401 to 'Expansion.Conjunction' ([  4.39808900e-07   9.94542924e-01   1.00188251e-03   1.83038640e-03
   6.55507920e-04   3.61789726e-05   4.66594311e-04   1.14246787e-03
   8.65400240e-06   6.68946687e-05   1.03071277e-04   2.11163957e-05
   5.17872737e-05   1.11217392e-06   2.06832198e-05   3.92859922e-05
   4.58552416e-06   2.40870788e-06   1.33115552e-07   3.41074438e-06
   3.37043085e-07   1.38025588e-07])
fallback 38705 to 'Expansion.Conjunction' ([  2.33970368e-05   4.98597763e-01   1.74133998e-01   1.49769006e-01
   3.94335010e-02   9.91318639e-03   4.28846546e-02   3.90652561e-02
   3.62960756e-03   1.22225534e-02   9.08761085e-03   5.29123136e-03
   6.28734976e-03   7.11940684e-04   7.19377480e-03   1.27416090e-03
   3.32711027e-04   6.78786372e-05   1.13769318e-05   1.78476782e-05
   1.97312744e-05   3.14624226e-05])
fallback 38499 to 'Expansion.Conjunction' ([  3.06012510e-07   9.98033069e-01   2.86271802e-04   9.29685505e-05
   1.12610173e-03   9.10649780e-05   2.49652936e-05   2.26240959e-04
   6.77556105e-05   7.51451460e-06   5.38121879e-06   1.88985250e-06
   9.23490572e-06   4.38823427e-06   4.42294696e-06   1.75907593e-05
   8.57207018e-08   3.13428053e-07   2.78974094e-08   2.03347686e-07
   1.93955434e-07   9.55255007e-09])
fallback 38787 to 'Expansion.Conjunction' ([  1.48250660e-06   9.69462956e-01   6.58223562e-03   3.08748226e-03
   1.17950619e-02   2.26895889e-03   1.04607621e-03   3.04155083e-03
   1.44651524e-03   2.95463870e-04   1.32981167e-04   7.76657636e-05
   2.21340312e-04   1.12590688e-04   1.70702046e-04   2.35329679e-04
   7.45320013e-06   1.02689794e-05   6.18650590e-07   1.81660953e-06
   1.30940444e-06   1.40283621e-07])
fallback 38640 to 'Expansion.Conjunction' ([  5.70051561e-05   2.12396875e-01   1.95167452e-01   1.45289883e-01
   1.17929734e-01   5.78871072e-02   6.58542515e-02   5.90247997e-02
   4.74586711e-02   2.73472332e-02   9.66430736e-03   1.54765984e-02
   1.69021506e-02   6.79891511e-03   1.28472913e-02   6.70583780e-03
   2.47782865e-03   3.95607611e-04   1.14884504e-04   6.05118258e-05
   8.94852421e-05   5.35681939e-05])
fallback 38300 to 'Expansion.Conjunction' ([  8.89768398e-06   7.25048467e-01   5.07083226e-02   3.32903669e-02
   7.82776011e-02   3.48172814e-02   1.37388079e-02   2.26600817e-02
   2.63167726e-02   4.50184419e-03   1.21775686e-03   1.53929213e-03
   2.50546117e-03   1.39258275e-03   2.08551455e-03   1.47613018e-03
   2.21409917e-04   1.73198114e-04   6.54282062e-06   6.17033161e-06
   5.61689273e-06   1.88138945e-06])
fallback 38915 to 'Expansion.Conjunction' ([  2.80739896e-05   2.78542974e-01   2.65487619e-01   1.93850583e-01
   6.49741014e-02   1.71077387e-02   5.13903887e-02   5.49886281e-02
   1.15484860e-02   1.95667116e-02   1.04696512e-02   1.01923061e-02
   9.50544170e-03   1.43912497e-03   8.32821920e-03   1.93062361e-03
   4.37006629e-04   9.83364764e-05   1.52535808e-05   1.51609806e-05
   3.85819342e-05   4.49891900e-05])
fallback 38808 to 'Expansion.Conjunction' ([  2.78945863e-05   4.68114217e-01   1.94125917e-01   1.42967951e-01
   4.77674668e-02   1.10859738e-02   3.76544215e-02   4.18857774e-02
   7.65697829e-03   1.54225385e-02   8.91771708e-03   7.16853919e-03
   7.85302168e-03   9.33881190e-04   6.33413658e-03   1.46709705e-03
   4.04016310e-04   1.02646974e-04   1.10092376e-05   1.79128561e-05
   4.48789569e-05   3.60065816e-05])
fallback 38115 to 'Expansion.Conjunction' ([  4.96037610e-05   2.29570226e-01   1.88125075e-01   1.41361044e-01
   1.19524763e-01   5.93196307e-02   6.31766324e-02   5.74842584e-02
   4.86621152e-02   2.60913001e-02   8.75677268e-03   1.46020326e-02
   1.55301691e-02   6.36720429e-03   1.23501207e-02   6.08060234e-03
   2.30671490e-03   3.78727275e-04   9.55810253e-05   5.27000524e-05
   7.11052931e-05   4.36209378e-05])
fallback 38649 to 'Expansion.Conjunction' ([  1.03533262e-06   9.87080513e-01   3.20527027e-03   4.54701343e-03
   1.06132077e-03   9.39489763e-05   1.03514956e-03   1.88214390e-03
   3.02039243e-05   3.69054236e-04   3.16494144e-04   7.56034495e-05
   1.36859424e-04   3.21585775e-06   6.78715804e-05   6.76156777e-05
   1.64439989e-05   5.22263598e-06   1.32777458e-07   2.37379299e-06
   1.68155588e-06   8.31802025e-07])
fallback 38205 to 'Expansion.Conjunction' ([  6.52489325e-05   2.30892833e-01   2.02186924e-01   1.48966459e-01
   1.07531590e-01   4.61638860e-02   6.73754203e-02   5.88263226e-02
   3.78890999e-02   2.75354306e-02   1.06216555e-02   1.46366318e-02
   1.84039489e-02   6.12567820e-03   1.24530250e-02   7.11013457e-03
   2.42801402e-03   4.04087761e-04   1.23797623e-04   7.04602777e-05
   1.24979660e-04   6.43724986e-05])
fallback 37814 to 'Expansion.Conjunction' ([  2.22269300e-05   4.03853085e-01   2.09410114e-01   1.79329662e-01
   4.69848994e-02   1.18084009e-02   4.93895929e-02   4.62215092e-02
   4.70145415e-03   1.47029970e-02   9.78163248e-03   6.48767821e-03
   6.83742476e-03   8.16979264e-04   7.67663999e-03   1.48141522e-03
   3.43725955e-04   6.76416306e-05   1.14273870e-05   1.64496031e-05
   1.90004465e-05   3.60435839e-05])
fallback 37593 to 'Expansion.Conjunction' ([  1.30899007e-05   6.63974336e-01   7.68835162e-02   5.14379174e-02
   7.93178369e-02   3.19060679e-02   1.99195796e-02   2.92889658e-02
   2.28014753e-02   7.01581957e-03   2.24533162e-03   2.72124420e-03
   4.19796532e-03   1.88223666e-03   3.28838798e-03   2.48322586e-03
   3.92321521e-04   1.87041119e-04   1.37483901e-05   1.28517475e-05
   1.27380370e-05   4.30294034e-06])
fallback 38080 to 'Expansion.Conjunction' ([  2.78626885e-05   2.93172658e-01   2.43054867e-01   2.02491180e-01
   6.17423767e-02   1.70793552e-02   6.31145390e-02   5.50801048e-02
   6.47544537e-03   1.70099419e-02   1.09507423e-02   7.74439752e-03
   8.14736543e-03   1.41534582e-03   9.82604178e-03   2.06609932e-03
   4.10379348e-04   8.02545257e-05   2.04605986e-05   2.12146315e-05
   2.30061851e-05   4.63615980e-05])
fallback 37361 to 'Expansion.Conjunction' ([  1.04439159e-05   7.80709741e-01   7.69746227e-02   7.01998768e-02
   1.52892461e-02   2.89777130e-03   1.62277594e-02   1.76130849e-02
   1.31263362e-03   5.81973230e-03   4.68096089e-03   2.09171674e-03
   2.80161248e-03   1.64023658e-04   2.52707255e-03   4.41783194e-04
   1.62845957e-04   3.94044035e-05   2.13716952e-06   8.58779455e-06
   1.22900719e-05   1.26531294e-05])
fallback 37148 to 'Expansion.Conjunction' ([  8.66711503e-07   9.88886461e-01   2.69897721e-03   3.97480087e-03
   9.15040598e-04   7.34624253e-05   8.56503366e-04   1.71820305e-03
   2.24707052e-05   2.88054867e-04   2.61507663e-04   6.22417710e-05
   1.11975378e-04   2.44790245e-06   5.36580657e-05   5.33777630e-05
   1.17669531e-05   4.19110114e-06   1.06054627e-07   2.09983656e-06
   1.14918337e-06   6.37544522e-07])
fallback 38437 to 'Expansion.Conjunction' ([  2.16588414e-05   3.40284882e-01   2.33985512e-01   1.98313190e-01
   5.23859260e-02   1.31719736e-02   5.31058830e-02   5.08652662e-02
   5.71869823e-03   1.64234172e-02   1.01245678e-02   7.39549003e-03
   7.25226752e-03   9.10124212e-04   7.91369840e-03   1.62409350e-03
   3.49449312e-04   6.89712175e-05   1.14581880e-05   1.54701701e-05
   1.89760066e-05   3.90260900e-05])
fallback 38226 to 'Expansion.Conjunction' ([  1.04273040e-05   7.64910870e-01   8.39022465e-02   7.39408129e-02
   1.69596894e-02   3.12682518e-03   1.68405435e-02   1.88867765e-02
   1.58436758e-03   6.30671200e-03   4.78476794e-03   2.29929781e-03
   2.98443434e-03   1.85223280e-04   2.56979440e-03   4.64818087e-04
   1.65028132e-04   4.11896104e-05   2.14872010e-06   8.31941445e-06
   1.30115258e-05   1.26955409e-05])
fallback 37799 to 'Expansion.Conjunction' ([  9.96660492e-06   7.82836084e-01   7.58583252e-02   6.98936213e-02
   1.49582988e-02   2.94984390e-03   1.65464246e-02   1.73202344e-02
   1.18902757e-03   5.53645662e-03   4.66679970e-03   2.04013336e-03
   2.73924741e-03   1.61228819e-04   2.64420269e-03   4.23822758e-04
   1.58577896e-04   3.48054893e-05   2.28043156e-06   8.08120880e-06
   1.06868156e-05   1.18508734e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175477.ba+   1723712K    921172K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175477     rnn-cw-wi+          2                         00:03:28      0:0 

Job 16175477 ("rnn-cw-wikipedia") completed on c16-33 at tor dec 15 13:14:17 CET 2016
