Starting job 16175489 ("rnn-glove-wikipedia-gigawords") on c16-31 at tor dec 15 13:17:48 CET 2016
Python environment is set up
Copying files to /work/jobs/16175489.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175489.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/
EMBEDDING_PATH: /work/jobs/16175489.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt
MODEL_PATH: /work/jobs/16175489.d/models/rnn-glove-wikipedia-gigawords/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-gigawords-conll16st-en-03-29-16-trial/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175489.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:18] configuration (/work/jobs/16175489.d/models/rnn-glove-wikipedia-gigawords/)
[2016-12-15 13:18]     config 'epochs': 200 (1000)
[2016-12-15 13:18]     config 'epochs_len': -1 (-1)
[2016-12-15 13:18]     config 'epochs_patience': 10 (20)
[2016-12-15 13:18]     config 'batch_size':  (64)
[2016-12-15 13:18]     config 'snapshot_size':  (2048)
[2016-12-15 13:18]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:18]     config 'words_dim': 20.0 (20)
[2016-12-15 13:18]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:18]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:18]     config 'final_dim': 40.0 (100)
[2016-12-15 13:18]     config 'arg1_len':  (100)
[2016-12-15 13:18]     config 'arg2_len':  (100)
[2016-12-15 13:18]     config 'conn_len':  (10)
[2016-12-15 13:18]     config 'punc_len':  (2)
[2016-12-15 13:18]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:18]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:18]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:18]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:18]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:18]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:18]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:18]     config 'words2vec_bin': None (None)
[2016-12-15 13:18]     config 'words2vec_txt': /work/jobs/16175489.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt (None)
[2016-12-15 13:18]   args.lang: en
[2016-12-15 13:18]   args.model_dir: /work/jobs/16175489.d/models/rnn-glove-wikipedia-gigawords/
[2016-12-15 13:18]   args.dataset_dir: /work/jobs/16175489.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/
[2016-12-15 13:18]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-gigawords-conll16st-en-03-29-16-trial/
[2016-12-15 13:18]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:18]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:18]   filter_types: None
[2016-12-15 13:18]   filter_senses: None
[2016-12-15 13:18]   filter_fn_name: conn_gt_0
[2016-12-15 13:18]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175489.d/resources//word_embeddings/precompiled/glove/glove.6B.50d.txt', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:18] load dataset for prediction (/work/jobs/16175489.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/)
[2016-12-15 13:18] lang: ?, doc_ids: 1, words: 896, rel_ids: 16, relation tokens: 760
[2016-12-15 13:18]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:18] build model
[2016-12-15 13:18]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:18]     config 'optimizer':  (adam)
[2016-12-15 13:19] previous weights (/work/jobs/16175489.d/models/rnn-glove-wikipedia-gigawords/)
[2016-12-15 13:19] convert from dataset (/work/jobs/16175489.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-trial/)
[2016-12-15 13:19] make predictions
[2016-12-15 13:20] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-glove-wikipedia-gigawords-conll16st-en-03-29-16-trial/)
/work/jobs/16175489.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 14882 to 'Expansion.Conjunction' ([  1.88745398e-05   4.33062739e-01   1.83855060e-01   1.75559568e-01
   3.24961548e-02   1.86140242e-02   8.30509005e-02   3.59697757e-02
   7.69569923e-03   7.44882238e-03   5.06510314e-03   3.30098957e-03
   7.16337759e-03   1.21224860e-03   2.63860919e-03   2.28909896e-03
   3.64161510e-04   7.17597880e-05   2.78961456e-05   1.14359729e-05
   7.35914521e-05   1.01093976e-05])
fallback 14898 to 'Expansion.Conjunction' ([  5.65984726e-09   9.99648241e-01   8.17839049e-05   5.09768957e-05
   1.43311980e-04   2.65629649e-05   6.59689040e-06   6.81207821e-06
   2.53801088e-05   7.20136606e-06   1.03162466e-07   1.62548047e-06
   1.42838278e-07   7.44083926e-08   2.61807664e-07   8.90623279e-08
   3.63672920e-07   1.87573581e-07   6.90219367e-09   6.51002159e-09
   7.62555124e-08   1.89876237e-07])
fallback 14902 to 'Expansion.Conjunction' ([  2.55322302e-05   7.21125384e-01   9.57819026e-02   8.99766782e-02
   2.08709264e-02   6.59525086e-03   2.93333706e-02   1.53140253e-02
   4.69583192e-03   5.39128916e-03   2.19175994e-03   2.50286290e-03
   2.84233767e-03   7.42693801e-04   5.85904943e-04   1.57537094e-03
   2.63004804e-04   9.50949932e-05   2.02796678e-05   5.20188055e-06
   5.81080182e-05   7.18953034e-06])
fallback 14891 to 'Expansion.Conjunction' ([  7.10212407e-05   7.35968809e-01   4.18669422e-02   3.27602616e-02
   6.49255572e-02   3.83176980e-02   1.67006771e-02   1.43130874e-02
   3.66364783e-02   7.52367386e-03   1.32105729e-03   3.16292971e-03
   1.07316426e-03   1.40490763e-03   8.26577809e-04   7.06011644e-04
   9.07253101e-04   7.47213878e-04   2.64934374e-04   1.04818934e-04
   2.09188811e-04   1.87736276e-04])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175489.ba+   1498828K    680151K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175489     rnn-glove+          2                         00:02:53      0:0 

Job 16175489 ("rnn-glove-wikipedia-gigawords") completed on c16-31 at tor dec 15 13:20:36 CET 2016
