Starting job 16188516 ("rnn-rsv100-wikipedia") on c16-5 at lör dec 17 14:27:06 CET 2016
Python environment is set up
Copying files to /work/jobs/16188516.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16188516.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16188516.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed
MODEL_PATH: /work/jobs/16188516.d/models/rnn-rsv100-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-rsv100-wikipedia-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16188516.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-17 14:27] configuration (/work/jobs/16188516.d/models/rnn-rsv100-wikipedia/)
[2016-12-17 14:27]     config 'epochs': 200 (1000)
[2016-12-17 14:27]     config 'epochs_len': -1 (-1)
[2016-12-17 14:27]     config 'epochs_patience': 10 (20)
[2016-12-17 14:27]     config 'batch_size':  (64)
[2016-12-17 14:27]     config 'snapshot_size':  (2048)
[2016-12-17 14:27]     config 'random_per_sample': 24.0 (32)
[2016-12-17 14:27]     config 'words_dim': 20.0 (20)
[2016-12-17 14:27]     config 'focus_dim': 6.0 (4)
[2016-12-17 14:27]     config 'rnn_dim': 50.0 (20)
[2016-12-17 14:27]     config 'final_dim': 40.0 (100)
[2016-12-17 14:27]     config 'arg1_len':  (100)
[2016-12-17 14:27]     config 'arg2_len':  (100)
[2016-12-17 14:27]     config 'conn_len':  (10)
[2016-12-17 14:27]     config 'punc_len':  (2)
[2016-12-17 14:27]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-17 14:27]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-17 14:27]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-17 14:27]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-17 14:27]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-17 14:27]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-17 14:27]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-17 14:27]     config 'words2vec_bin': None (None)
[2016-12-17 14:27]     config 'words2vec_txt': /work/jobs/16188516.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed (None)
[2016-12-17 14:27]   args.lang: en
[2016-12-17 14:27]   args.model_dir: /work/jobs/16188516.d/models/rnn-rsv100-wikipedia/
[2016-12-17 14:27]   args.dataset_dir: /work/jobs/16188516.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-17 14:27]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-rsv100-wikipedia-conll16st-en-03-29-16-dev/
[2016-12-17 14:27]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-17 14:27]   os.getenv("THEANO_FLAGS"): None
[2016-12-17 14:27]   filter_types: None
[2016-12-17 14:27]   filter_senses: None
[2016-12-17 14:27]   filter_fn_name: conn_gt_0
[2016-12-17 14:27]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16188516.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d100_w1_ncntx10000.wembed', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-17 14:27] load dataset for prediction (/work/jobs/16188516.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-17 14:27] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-17 14:27]   rel_senses2id: 22, words2id: 43918
[2016-12-17 14:27] build model
[2016-12-17 14:28]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-17 14:28]     config 'optimizer':  (adam)
[2016-12-17 14:28] previous weights (/work/jobs/16188516.d/models/rnn-rsv100-wikipedia/)
[2016-12-17 14:28] convert from dataset (/work/jobs/16188516.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-17 14:28] make predictions
[2016-12-17 14:30] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-rsv100-wikipedia-conll16st-en-03-29-16-dev/)
/work/jobs/16188516.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 35749 to 'Expansion.Conjunction' ([  1.16996838e-04   2.05618247e-01   1.78990140e-01   1.30336866e-01
   1.15680426e-01   1.27990916e-01   3.37304659e-02   3.92776652e-02
   5.83252198e-02   3.62891629e-02   1.03072524e-02   1.15534197e-02
   7.02061410e-03   9.95087529e-03   1.49177015e-02   1.66304558e-02
   1.61778624e-03   1.86852310e-04   2.61246430e-04   1.82400152e-04
   5.26659132e-04   4.88631194e-04])
fallback 36060 to 'Expansion.Conjunction' ([  6.23141314e-05   2.99774825e-01   2.44722291e-01   1.90334647e-01
   3.83031516e-02   5.30122629e-02   4.61409687e-02   4.78292740e-02
   8.56431199e-03   1.88538450e-02   1.59511063e-02   3.93853429e-03
   1.09172426e-02   4.11358242e-03   9.61325688e-03   5.45135511e-03
   1.54707755e-03   1.27770879e-04   5.47750313e-05   9.09298685e-05
   4.47060795e-04   1.49416708e-04])
fallback 36214 to 'Expansion.Conjunction' ([  1.79809767e-08   9.95830233e-01   1.71606870e-03   1.58529658e-03
   9.15012056e-05   5.64274848e-05   2.39976855e-04   3.15062438e-04
   4.69956738e-06   3.57376774e-05   3.65109698e-05   5.24239156e-06
   5.15345489e-05   6.80928505e-07   2.58446870e-05   4.42552935e-06
   4.35473877e-07   4.24364826e-08   3.85516772e-09   3.25030028e-08
   1.97729746e-07   2.72391886e-08])
fallback 37106 to 'Expansion.Conjunction' ([  6.65571060e-05   2.81882910e-01   1.33271768e-01   8.47445050e-02
   1.34842574e-01   1.29500165e-01   2.88831310e-02   3.63233050e-02
   9.47102525e-02   2.53848245e-02   4.87599751e-03   5.19872826e-03
   4.57906859e-03   8.40965559e-03   1.27970585e-02   1.23360035e-02
   8.62777634e-04   1.58884561e-04   2.62639774e-04   1.19449468e-04
   4.68463255e-04   3.21282421e-04])
fallback 35791 to 'Expansion.Conjunction' ([  1.09417357e-04   1.99972036e-01   1.79376381e-01   1.29212709e-01
   1.17825934e-01   1.28969805e-01   3.39108151e-02   4.00069361e-02
   6.18053869e-02   3.62196867e-02   9.94068024e-03   1.12203445e-02
   6.88279894e-03   1.00687268e-02   1.49338685e-02   1.64220149e-02
   1.54370933e-03   1.80211226e-04   2.46733605e-04   1.67549037e-04
   5.05968585e-04   4.78287262e-04])
fallback 36920 to 'Expansion.Conjunction' ([  9.19748516e-07   9.66567000e-01   1.40194365e-02   1.03594318e-02
   1.20711120e-03   9.91522122e-04   2.19430057e-03   2.31313338e-03
   1.59982290e-04   5.25586726e-04   5.56317403e-04   9.09700994e-05
   5.10615075e-04   2.12384498e-05   3.46158115e-04   1.02818305e-04
   1.61746415e-05   3.08767614e-06   3.50460518e-07   1.57535616e-06
   1.05858419e-05   1.68409955e-06])
fallback 36080 to 'Expansion.Conjunction' ([  1.67052832e-07   9.50493688e-01   7.58532058e-03   2.63368337e-03
   1.27317281e-02   1.39398621e-02   6.34611639e-04   1.18811544e-03
   8.50949152e-03   1.15732231e-03   5.46575753e-05   4.81458407e-05
   1.05083396e-04   8.62398223e-05   4.95945857e-04   3.10522182e-04
   9.04026450e-06   7.84135802e-07   1.75588615e-06   4.40217062e-07
   8.66369459e-06   4.73147563e-06])
fallback 36254 to 'Expansion.Conjunction' ([  4.11435849e-06   9.03807413e-01   3.89437941e-02   2.77499393e-02
   4.35618317e-03   3.92784183e-03   6.91082989e-03   6.40390077e-03
   7.06467321e-04   1.72625647e-03   1.89483541e-03   3.89468337e-04
   1.57184773e-03   1.04057648e-04   9.23188124e-04   4.41588351e-04
   7.19075406e-05   1.25089375e-05   1.99532363e-06   5.22982561e-06
   3.91027502e-05   7.52940387e-06])
fallback 36464 to 'Expansion.Conjunction' ([  5.82663561e-05   3.29848883e-01   2.06431581e-01   1.92301331e-01
   4.22857587e-02   5.05511720e-02   4.80520163e-02   4.39694669e-02
   8.63731460e-03   2.25866752e-02   1.62434819e-02   4.73658318e-03
   1.12744094e-02   4.59735977e-03   9.42319904e-03   6.29688794e-03
   1.82265647e-03   8.73056408e-05   7.18797959e-05   1.19670657e-04
   4.30634242e-04   1.73466643e-04])
fallback 36919 to 'Expansion.Conjunction' ([  5.10559985e-05   5.76666307e-01   9.67133064e-02   5.66642519e-02
   6.67065916e-02   7.02116652e-02   1.52862820e-02   1.67145956e-02
   4.07089636e-02   2.07043890e-02   5.24747754e-03   5.33128261e-03
   3.82698567e-03   2.61813361e-03   1.01529129e-02   1.06038816e-02
   7.44131466e-04   1.11387943e-04   1.26878253e-04   1.27595634e-04
   4.03811464e-04   2.78113415e-04])
fallback 36502 to 'Expansion.Conjunction' ([  9.56732620e-05   4.85322733e-01   1.37404260e-01   1.15576689e-01
   5.65982002e-02   5.81976386e-02   2.95617947e-02   2.53243292e-02
   1.77001707e-02   2.11457587e-02   1.09308863e-02   7.71133166e-03
   7.77253492e-03   4.00817199e-03   1.16299193e-02   8.17025901e-03
   1.54501022e-03   1.34183600e-04   1.67112459e-04   2.37978509e-04
   4.75725149e-04   2.89639161e-04])
fallback 36212 to 'Expansion.Conjunction' ([  2.26216580e-05   6.86978684e-01   1.19878275e-01   8.87517688e-02
   1.56460308e-02   1.80503480e-02   2.12152969e-02   2.05382589e-02
   2.90172402e-03   6.23505690e-03   6.29521475e-03   1.43690975e-03
   5.25053673e-03   7.19446034e-04   3.64831455e-03   1.72841778e-03
   3.97089279e-04   5.64209575e-05   1.29142861e-05   2.65205685e-05
   1.70323718e-04   3.98266303e-05])
fallback 36112 to 'Expansion.Conjunction' ([  7.48504972e-05   2.53216863e-01   2.15207458e-01   2.09416405e-01
   5.27312198e-02   5.83734849e-02   5.51433192e-02   4.98820880e-02
   1.09916823e-02   2.80535333e-02   1.87881366e-02   6.52280172e-03
   1.26382476e-02   6.48725593e-03   1.05234850e-02   8.62009360e-03
   2.26183981e-03   9.90509800e-05   1.03989718e-04   1.56761933e-04
   4.90669802e-04   2.16763249e-04])
fallback 36611 to 'Expansion.Conjunction' ([  4.44319703e-05   4.57782186e-01   1.97569195e-01   1.51810425e-01
   2.76954197e-02   3.82840528e-02   3.44722761e-02   3.60808415e-02
   5.51582555e-03   1.28871316e-02   1.15803454e-02   2.60319309e-03
   8.92216633e-03   2.21400153e-03   7.49546860e-03   3.40887886e-03
   1.01460786e-03   9.59836704e-05   3.36486087e-05   6.30565565e-05
   3.29228851e-04   9.76358730e-05])
fallback 36262 to 'Expansion.Conjunction' ([  1.39070893e-04   3.11802327e-01   1.73405289e-01   1.41603768e-01
   8.35557951e-02   8.77125410e-02   3.63149270e-02   3.43982130e-02
   3.00316288e-02   2.79966182e-02   1.36224264e-02   1.17937373e-02
   9.04632824e-03   7.14703136e-03   1.50690656e-02   1.26654571e-02
   1.99899077e-03   1.91082421e-04   2.53634323e-04   2.71943223e-04
   5.85441709e-04   3.94683738e-04])
fallback 36362 to 'Expansion.Conjunction' ([  8.10126153e-08   9.93147608e-01   2.51256045e-03   2.64818267e-03
   2.44494760e-04   1.53203596e-04   4.52065257e-04   4.41791372e-04
   1.40678375e-05   1.07185536e-04   8.16307799e-05   1.53928885e-05
   1.04371494e-04   2.30122054e-06   5.83937615e-05   1.32031509e-05
   2.20927267e-06   1.13199085e-07   3.17060013e-08   1.69541834e-07
   7.81014816e-07   1.61101155e-07])
fallback 36222 to 'Expansion.Conjunction' ([  1.48749741e-08   9.95771509e-01   1.84879833e-03   1.55977273e-03
   9.16302798e-05   5.66977458e-05   2.33755253e-04   2.85020384e-04
   5.52774135e-06   3.10015924e-05   3.75556039e-05   4.97842975e-06
   4.41917683e-05   6.19228547e-07   2.41647281e-05   4.10320892e-06
   3.49140827e-07   5.35988275e-08   3.21688936e-09   2.39991968e-08
   2.04252654e-07   2.53160705e-08])
fallback 36017 to 'Expansion.Conjunction' ([  9.08144386e-08   9.90570311e-01   4.23283830e-03   2.97037932e-03
   2.76049134e-04   1.87058730e-04   5.81422183e-04   6.90940130e-04
   3.06532348e-05   1.05436994e-04   1.29574881e-04   2.12492615e-05
   1.19312609e-04   2.64338747e-06   5.71389794e-05   2.13619060e-05
   1.71598072e-06   3.01125114e-07   2.74090582e-08   1.31070678e-07
   1.18284675e-06   1.81035632e-07])
fallback 35802 to 'Expansion.Conjunction' ([  7.25624777e-05   1.76988291e-01   1.71550023e-01   1.17683323e-01
   1.36898027e-01   1.36449428e-01   3.64521411e-02   4.51990632e-02
   8.70164345e-02   3.06314178e-02   6.94730373e-03   7.57646988e-03
   5.83332923e-03   1.11722053e-02   1.40527731e-02   1.31607383e-02
   1.08449744e-03   1.49288435e-04   2.15941519e-04   1.04909247e-04
   4.14388492e-04   3.47445170e-04])
fallback 36213 to 'Expansion.Conjunction' ([  1.06222342e-06   9.61666575e-01   1.61785966e-02   1.17102348e-02
   1.42153235e-03   1.18162587e-03   2.52254794e-03   2.60666453e-03
   1.96046398e-04   6.02388458e-04   6.49130141e-04   1.09808155e-04
   5.79636481e-04   2.59005299e-05   3.87257107e-04   1.21589218e-04
   1.92017540e-05   3.67587355e-06   4.16578498e-07   1.72777673e-06
   1.23855042e-05   1.99632994e-06])
fallback 36725 to 'Expansion.Conjunction' ([  5.10890204e-05   3.68817358e-01   2.05948352e-01   1.81375741e-01
   3.68410906e-02   4.65041062e-02   4.33159730e-02   4.17568235e-02
   7.39608097e-03   1.91330276e-02   1.46495345e-02   3.88192570e-03
   1.04152606e-02   3.69527678e-03   8.78519189e-03   5.13999628e-03
   1.52296828e-03   8.62784069e-05   5.45916335e-05   9.56858272e-05
   3.90656989e-04   1.42991208e-04])
fallback 36651 to 'Expansion.Conjunction' ([  1.52661869e-05   6.96835576e-01   5.94253017e-02   3.03389653e-02
   5.80179056e-02   6.39615057e-02   7.89426172e-03   1.07710678e-02
   3.99939342e-02   1.30620543e-02   1.85328605e-03   1.97152979e-03
   1.71831378e-03   1.49186619e-03   5.87883217e-03   6.00930348e-03
   2.92199517e-04   4.21123585e-05   5.86322747e-05   3.61174024e-05
   1.97349276e-04   1.34619666e-04])
fallback 35923 to 'Expansion.Conjunction' ([  1.74621655e-05   7.42880947e-01   9.41644469e-02   7.82851882e-02
   1.22080540e-02   1.48103546e-02   1.67824423e-02   1.72897318e-02
   1.96695795e-03   5.29345735e-03   4.88763819e-03   9.90164126e-04
   4.52490714e-03   5.82154031e-04   3.48285240e-03   1.23839990e-03
   3.48689503e-04   3.75566418e-05   1.10410748e-05   2.52795874e-05
   1.37575787e-04   3.46992277e-05])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16188516.ba+   1651456K    848452K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16188516     rnn-rsv10+          2                         00:03:19      0:0 

Job 16188516 ("rnn-rsv100-wikipedia") completed on c16-5 at lör dec 17 14:30:20 CET 2016
