Starting job 16188387 ("rnn-rsv50-wikipedia") on c31-9 at lör dec 17 13:14:09 CET 2016
Python environment is set up
Copying files to /work/jobs/16188387.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16188387.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
EMBEDDING_PATH: /work/jobs/16188387.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed
MODEL_PATH: /work/jobs/16188387.d/models/rnn-rsv50-wikipedia/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll16st-en-03-29-16-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16188387.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-17 13:14] configuration (/work/jobs/16188387.d/models/rnn-rsv50-wikipedia/)
[2016-12-17 13:14]     config 'epochs': 200 (1000)
[2016-12-17 13:14]     config 'epochs_len': -1 (-1)
[2016-12-17 13:14]     config 'epochs_patience': 10 (20)
[2016-12-17 13:14]     config 'batch_size':  (64)
[2016-12-17 13:14]     config 'snapshot_size':  (2048)
[2016-12-17 13:14]     config 'random_per_sample': 24.0 (32)
[2016-12-17 13:14]     config 'words_dim': 20.0 (20)
[2016-12-17 13:14]     config 'focus_dim': 6.0 (4)
[2016-12-17 13:14]     config 'rnn_dim': 50.0 (20)
[2016-12-17 13:14]     config 'final_dim': 40.0 (100)
[2016-12-17 13:14]     config 'arg1_len':  (100)
[2016-12-17 13:14]     config 'arg2_len':  (100)
[2016-12-17 13:14]     config 'conn_len':  (10)
[2016-12-17 13:14]     config 'punc_len':  (2)
[2016-12-17 13:14]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-17 13:14]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-17 13:14]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-17 13:14]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-17 13:14]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-17 13:14]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-17 13:14]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-17 13:14]     config 'words2vec_bin': None (None)
[2016-12-17 13:14]     config 'words2vec_txt': /work/jobs/16188387.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed (None)
[2016-12-17 13:14]   args.lang: en
[2016-12-17 13:14]   args.model_dir: /work/jobs/16188387.d/models/rnn-rsv50-wikipedia/
[2016-12-17 13:14]   args.dataset_dir: /work/jobs/16188387.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/
[2016-12-17 13:14]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll16st-en-03-29-16-test/
[2016-12-17 13:14]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-17 13:14]   os.getenv("THEANO_FLAGS"): None
[2016-12-17 13:14]   filter_types: None
[2016-12-17 13:14]   filter_senses: None
[2016-12-17 13:14]   filter_fn_name: conn_gt_0
[2016-12-17 13:14]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16188387.d/resources//word_embeddings/precompiled/rsv/wiki_2008_d50_w1_ncntx100000.wembed', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-17 13:14] load dataset for prediction (/work/jobs/16188387.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-17 13:14] lang: ?, doc_ids: 91, words: 55453, rel_ids: 986, relation tokens: 38208
[2016-12-17 13:14]   rel_senses2id: 22, words2id: 43918
[2016-12-17 13:14] build model
[2016-12-17 13:15]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-17 13:15]     config 'optimizer':  (adam)
[2016-12-17 13:15] previous weights (/work/jobs/16188387.d/models/rnn-rsv50-wikipedia/)
[2016-12-17 13:15] convert from dataset (/work/jobs/16188387.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-test/)
[2016-12-17 13:15] make predictions
[2016-12-17 13:16] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-rsv50-wikipedia-conll16st-en-03-29-16-test/)
/work/jobs/16188387.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 38401 to 'Expansion.Conjunction' ([  5.18689952e-11   9.99882509e-01   6.57898047e-05   3.38691749e-05
   1.08764674e-06   4.80573983e-07   3.08794799e-06   1.06415654e-05
   7.38559428e-08   1.58255578e-06   3.25774490e-07   9.21497251e-08
   2.83615972e-07   1.88045821e-09   3.93506344e-08   1.25989642e-07
   5.54153118e-09   2.17582239e-09   2.42272949e-10   3.32107394e-10
   6.83337477e-11   6.05244515e-10])
fallback 37593 to 'Expansion.Conjunction' ([  2.54425828e-07   9.58933148e-01   5.33610335e-03   2.88777790e-03
   1.53568644e-02   2.56012583e-03   1.38031792e-03   9.89763970e-04
   1.17799646e-02   4.06668452e-04   3.69016151e-05   9.59794826e-05
   9.83983819e-05   3.11697250e-05   4.42716361e-05   4.16454666e-05
   8.34025354e-06   1.06637669e-05   5.58557274e-08   7.64784638e-07
   5.09015408e-07   3.11017592e-07])
fallback 38300 to 'Expansion.Conjunction' ([  2.18656382e-07   9.67036346e-01   2.45894323e-03   1.48554539e-03
   1.25966991e-02   2.13836618e-03   6.44586035e-04   4.68805888e-04
   1.27646585e-02   1.90995906e-04   1.84992419e-05   6.18095642e-05
   5.25486710e-05   2.20556389e-05   2.23820148e-05   2.12777190e-05
   4.46941103e-06   1.03737882e-05   6.29557974e-08   6.92153079e-07
   5.03791217e-07   1.60395739e-07])
fallback 37361 to 'Expansion.Conjunction' ([  4.08969584e-07   3.47213179e-01   3.10006499e-01   1.64255574e-01
   3.40506397e-02   1.54520795e-02   4.64790612e-02   3.97651940e-02
   7.10784271e-03   1.87900904e-02   4.15874552e-03   1.62180723e-03
   7.45708728e-03   3.99533717e-04   1.95176422e-03   1.19778537e-03
   6.59880825e-05   1.23696673e-05   1.24129588e-06   2.24351402e-06
   1.16954993e-06   9.69579377e-06])
fallback 38649 to 'Expansion.Conjunction' ([  4.93830477e-10   9.99050965e-01   5.09652712e-04   2.79978119e-04
   1.27989268e-05   6.31156439e-06   3.19152311e-05   8.12851932e-05
   1.45532486e-06   1.58673918e-05   2.96306686e-06   1.21865922e-06
   3.43424855e-06   5.29311381e-08   5.06607245e-07   1.49976289e-06
   5.44642655e-08   2.56794441e-08   2.02283077e-09   4.48066158e-09
   6.79439998e-10   7.25807274e-09])
fallback 38205 to 'Expansion.Conjunction' ([  1.77338052e-06   5.78650397e-01   1.37310441e-01   6.42218049e-02
   8.25868745e-02   2.34446910e-02   2.85375743e-02   2.61169813e-02
   3.65635555e-02   1.01866831e-02   1.54830569e-03   2.20813619e-03
   4.25776966e-03   4.60839816e-04   1.86345430e-03   1.83129631e-03
   1.32513374e-04   5.04123767e-05   1.23626463e-06   8.37491072e-06
   4.44535394e-06   1.24392751e-05])
fallback 38245 to 'Expansion.Conjunction' ([  8.98520102e-06   2.33916328e-01   1.50045410e-01   9.02937356e-02
   1.86828912e-01   7.34100642e-02   4.99078782e-02   3.47367713e-02
   1.34069086e-01   1.68316011e-02   3.93110515e-03   6.07638482e-03
   6.18130017e-03   2.95677200e-03   5.44522099e-03   4.30597134e-03
   7.15185134e-04   2.32884632e-04   8.42470493e-06   3.44232359e-05
   2.74197429e-05   3.61364656e-05])
fallback 38640 to 'Expansion.Conjunction' ([  2.07836047e-06   6.69801280e-01   9.29271037e-02   4.40172357e-02
   7.66728578e-02   1.98176015e-02   2.21500224e-02   2.02872432e-02
   3.77648129e-02   7.56766863e-03   1.01823416e-03   1.57985914e-03
   2.74049834e-03   4.33163883e-04   1.48479986e-03   1.50020627e-03
   1.46837145e-04   6.27083777e-05   1.07008802e-06   9.34806101e-06
   5.13858356e-06   1.02317079e-05])
fallback 37830 to 'Expansion.Conjunction' ([  1.22391725e-06   5.30458644e-01   1.76220780e-01   7.87585400e-02
   7.55812696e-02   2.23575669e-02   3.20269623e-02   3.03786983e-02
   2.82217011e-02   1.15387666e-02   1.91438099e-03   2.49963610e-03
   5.52719288e-03   3.78744513e-04   1.92475895e-03   2.05140869e-03
   1.00582171e-04   3.53342048e-05   1.11146315e-06   6.68441744e-06
   3.29369377e-06   1.27195748e-05])
fallback 38226 to 'Expansion.Conjunction' ([  4.22053716e-07   3.61671656e-01   3.04353565e-01   1.56735673e-01
   3.63986603e-02   1.55357607e-02   4.43138964e-02   3.87202575e-02
   7.77691416e-03   1.78922843e-02   3.92270134e-03   1.73721369e-03
   7.26120080e-03   3.62269347e-04   1.93740520e-03   1.28708628e-03
   6.68032298e-05   1.21779576e-05   1.14431498e-06   2.17978208e-06
   1.20783431e-06   9.52086974e-06])
fallback 38115 to 'Expansion.Conjunction' ([  1.85799126e-06   7.22524452e-01   7.13885862e-02   3.45092596e-02
   7.00901214e-02   1.74971779e-02   1.71847713e-02   1.56064608e-02
   3.86398764e-02   5.78095568e-03   7.34799238e-04   1.27515369e-03
   2.02389850e-03   3.56855564e-04   1.07865010e-03   1.10513133e-03
   1.18143578e-04   6.30912535e-05   8.63758586e-07   8.00968688e-06
   4.38514728e-06   7.49865182e-06])
fallback 37310 to 'Expansion.Conjunction' ([  3.91770214e-07   3.65079222e-01   2.98714964e-01   1.65349930e-01
   2.90523412e-02   1.43508286e-02   4.68395574e-02   3.92257607e-02
   5.94165313e-03   1.90485361e-02   4.28735835e-03   1.40046013e-03
   7.30238060e-03   4.28241530e-04   1.84707261e-03   1.04120827e-03
   6.26038670e-05   1.28557567e-05   1.34954848e-06   2.44374199e-06
   1.08679773e-06   9.75381131e-06])
fallback 37148 to 'Expansion.Conjunction' ([  3.06911802e-10   9.99380397e-01   3.35370885e-04   1.84440532e-04
   7.52122960e-06   3.66608965e-06   1.94002002e-05   5.26389297e-05
   7.65325344e-07   9.84555105e-06   1.96895414e-06   6.86447484e-07
   2.03840293e-06   2.62017569e-08   2.98737486e-07   8.79327036e-07
   3.27022281e-08   1.45242909e-08   1.27470077e-09   2.49107265e-09
   4.17340657e-10   4.18304319e-09])
fallback 38787 to 'Expansion.Conjunction' ([  1.94976857e-09   9.98892712e-01   8.35932286e-05   3.77990613e-05
   6.03123269e-04   4.05595524e-05   1.14692092e-05   6.85126125e-06
   3.18633970e-04   2.88423731e-06   1.71678037e-07   6.74325057e-07
   8.26700831e-07   1.38156237e-07   3.79430186e-07   1.00486835e-07
   3.35422352e-08   3.45100193e-08   5.77180019e-10   2.48993312e-09
   9.60981060e-09   9.65835288e-10])
fallback 38499 to 'Expansion.Conjunction' ([  1.90531882e-10   9.99818099e-01   9.09515450e-06   3.70901471e-06
   1.09111826e-04   5.00656649e-06   9.41217434e-07   5.38216973e-07
   5.30866607e-05   2.36811306e-07   1.12240734e-08   5.08721676e-08
   6.18460029e-08   8.20754141e-09   3.19383208e-08   5.23956707e-09
   2.49296720e-09   2.02487452e-09   5.61079662e-11   1.38386262e-10
   1.24872703e-09   5.54470955e-11])
fallback 38929 to 'Expansion.Conjunction' ([  7.33342858e-06   3.32319140e-01   1.46187663e-01   8.31862538e-02
   1.58944219e-01   5.67353926e-02   4.47750017e-02   3.23319100e-02
   1.05332047e-01   1.55156804e-02   3.18553904e-03   4.61523048e-03
   5.80450426e-03   2.00370233e-03   4.48572821e-03   3.77041800e-03
   5.32652775e-04   1.81226496e-04   5.58876581e-06   3.06118127e-05
   2.03556810e-05   2.98013692e-05])
fallback 38620 to 'Expansion.Conjunction' ([  2.46930142e-07   5.64547949e-01   2.05453751e-01   1.19646615e-01
   1.66047940e-02   8.21310923e-03   3.11629377e-02   2.77009528e-02
   3.25994073e-03   1.28981907e-02   2.99580624e-03   8.56468559e-04
   4.62096411e-03   2.35713768e-04   1.07904103e-03   6.68263753e-04
   3.64812144e-05   9.26219570e-06   7.94952815e-07   1.87480768e-06
   5.98599107e-07   6.24437954e-06])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16188387.ba+   1734136K    920855K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16188387     rnn-rsv50+          2                         00:02:28      0:0 

Job 16188387 ("rnn-rsv50-wikipedia") completed on c31-9 at lör dec 17 13:16:33 CET 2016
