Starting job 16175474 ("rnn-random-vectors") on c16-31 at tor dec 15 13:08:58 CET 2016
Python environment is set up
Copying files to /work/jobs/16175474.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175474.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
EMBEDDING_PATH: /work/jobs/16175474.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt
MODEL_PATH: /work/jobs/16175474.d/models/rnn-random-vectors/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-random-vectors-conll16st-en-03-29-16-dev/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175474.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:09] configuration (/work/jobs/16175474.d/models/rnn-random-vectors/)
[2016-12-15 13:09]     config 'epochs': 200 (1000)
[2016-12-15 13:09]     config 'epochs_len': -1 (-1)
[2016-12-15 13:09]     config 'epochs_patience': 10 (20)
[2016-12-15 13:09]     config 'batch_size':  (64)
[2016-12-15 13:09]     config 'snapshot_size':  (2048)
[2016-12-15 13:09]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:09]     config 'words_dim': 20.0 (20)
[2016-12-15 13:09]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:09]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:09]     config 'final_dim': 40.0 (100)
[2016-12-15 13:09]     config 'arg1_len':  (100)
[2016-12-15 13:09]     config 'arg2_len':  (100)
[2016-12-15 13:09]     config 'conn_len':  (10)
[2016-12-15 13:09]     config 'punc_len':  (2)
[2016-12-15 13:09]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:09]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:09]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:09]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:09]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:09]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:09]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:09]     config 'words2vec_bin': None (None)
[2016-12-15 13:09]     config 'words2vec_txt': /work/jobs/16175474.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt (None)
[2016-12-15 13:09]   args.lang: en
[2016-12-15 13:09]   args.model_dir: /work/jobs/16175474.d/models/rnn-random-vectors/
[2016-12-15 13:09]   args.dataset_dir: /work/jobs/16175474.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/
[2016-12-15 13:09]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-random-vectors-conll16st-en-03-29-16-dev/
[2016-12-15 13:09]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:09]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:09]   filter_types: None
[2016-12-15 13:09]   filter_senses: None
[2016-12-15 13:09]   filter_fn_name: conn_gt_0
[2016-12-15 13:09]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175474.d/resources//word_embeddings/precompiled/random_vectors/random_vectors.50d.txt', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:09] load dataset for prediction (/work/jobs/16175474.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:09] lang: ?, doc_ids: 79, words: 39712, rel_ids: 737, relation tokens: 28745
[2016-12-15 13:09]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:09] build model
[2016-12-15 13:09]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:10]     config 'optimizer':  (adam)
[2016-12-15 13:10] previous weights (/work/jobs/16175474.d/models/rnn-random-vectors/)
[2016-12-15 13:10] convert from dataset (/work/jobs/16175474.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll16st-en-03-29-16-dev/)
[2016-12-15 13:10] make predictions
[2016-12-15 13:11] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-random-vectors-conll16st-en-03-29-16-dev/)
/work/jobs/16175474.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 37045 to 'Expansion.Conjunction' ([  4.61608179e-05   1.88045038e-01   1.85571058e-01   1.03802837e-01
   1.34230762e-01   1.62910669e-01   3.58189081e-02   4.94492087e-02
   9.46739085e-02   1.71375311e-02   8.43949702e-03   3.42576133e-03
   5.91439423e-03   4.12904235e-03   4.42829724e-03   1.07715243e-03
   6.80696796e-04   2.67073735e-05   5.38669915e-05   5.15163006e-05
   5.26077197e-05   3.43798926e-05])
fallback 36920 to 'Expansion.Conjunction' ([  3.02671128e-06   9.53264955e-01   2.62006448e-02   6.95016936e-03
   1.36811229e-03   6.76496481e-04   7.15505940e-03   1.83292013e-03
   9.71739068e-05   1.29258947e-03   6.38461965e-04   6.31798250e-05
   2.61026348e-04   1.16680949e-05   1.59243137e-04   1.63772020e-05
   7.70414866e-06   1.50808987e-07   8.21196014e-07   7.57186459e-08
   3.74510735e-08   1.06072151e-07])
fallback 36214 to 'Expansion.Conjunction' ([  2.72517525e-07   9.89718778e-01   6.71354437e-03   1.22654669e-03
   2.38905671e-04   1.01863405e-04   1.11544806e-03   3.60391097e-04
   1.53874514e-05   3.31394311e-04   9.45982594e-05   6.88250691e-06
   5.02377325e-05   9.65653709e-07   2.22339873e-05   1.70941004e-06
   7.61902969e-07   7.36032422e-09   5.87194958e-08   5.12805389e-09
   1.61208788e-09   6.21517938e-09])
fallback 36017 to 'Expansion.Conjunction' ([  1.32068988e-06   9.75174587e-01   1.46344134e-02   3.48818156e-03
   5.86524303e-04   2.66264624e-04   3.67582931e-03   8.98073002e-04
   3.20095926e-05   6.74249999e-04   2.87320605e-04   2.01477156e-05
   1.75411431e-04   5.29658144e-06   6.93263851e-05   7.37297782e-06
   3.16162953e-06   5.00981220e-08   3.78319377e-07   2.47656255e-08
   9.54918526e-09   4.67509506e-08])
fallback 36245 to 'Expansion.Conjunction' ([  4.06962754e-05   3.28986973e-01   3.24286193e-01   7.50165508e-02
   5.60758487e-02   3.64555307e-02   8.12856556e-02   3.91595849e-02
   1.19088553e-02   2.54493952e-02   7.18600956e-03   3.98820919e-03
   4.36333428e-03   1.22053619e-03   3.63113196e-03   5.84401191e-04
   2.81627232e-04   1.75802870e-05   2.73332917e-05   9.63022650e-06
   1.57688519e-05   9.15391594e-06])
fallback 36725 to 'Expansion.Conjunction' ([  3.24667562e-05   4.08553124e-01   3.11280757e-01   6.30932152e-02
   3.70309502e-02   2.36849394e-02   8.31100345e-02   2.79718805e-02
   6.85730437e-03   2.13489439e-02   6.30174810e-03   2.83561880e-03
   3.49663338e-03   7.66780752e-04   2.90423702e-03   4.77196445e-04
   1.98126480e-04   1.34527236e-05   2.24305422e-05   5.22272512e-06
   8.68729694e-06   6.24996756e-06])
fallback 36082 to 'Expansion.Conjunction' ([  7.88888938e-05   3.16859071e-01   2.94108544e-01   9.77351977e-02
   4.39946471e-02   3.56105347e-02   1.18246393e-01   3.61154718e-02
   8.22866999e-03   2.11364574e-02   1.00077802e-02   4.49297350e-03
   5.58647335e-03   1.70886845e-03   4.49037977e-03   9.70796637e-04
   4.58730013e-04   3.49656953e-05   7.54403019e-05   1.36598012e-05
   2.38684446e-05   2.21887788e-05])
fallback 35749 to 'Expansion.Conjunction' ([  2.12926334e-05   3.45522643e-01   1.42160461e-01   7.94003979e-02
   9.99946521e-02   1.56261057e-01   2.35813968e-02   3.22105624e-02
   8.74697120e-02   1.43006426e-02   5.54842223e-03   2.21520313e-03
   4.51151468e-03   2.55324063e-03   2.90926057e-03   7.35740760e-04
   4.79714946e-04   1.18383250e-05   3.33345306e-05   3.07327682e-05
   2.64463979e-05   2.17346569e-05])
fallback 36254 to 'Expansion.Conjunction' ([  1.17569780e-05   8.23416673e-01   1.00029792e-01   2.08457174e-02
   6.52768853e-03   3.03947794e-03   2.94599522e-02   6.38880970e-03
   5.07389093e-04   5.23882373e-03   1.96191348e-03   2.98395732e-04
   1.39244661e-03   1.33398531e-04   5.94162980e-04   1.03704671e-04
   3.97856358e-05   1.54877993e-06   6.24994044e-06   5.93381190e-07
   4.73076126e-07   1.24739089e-06])
fallback 36262 to 'Expansion.Conjunction' ([  1.18067846e-05   5.76544162e-01   1.50621011e-01   6.16799738e-02
   4.93683030e-02   6.17196296e-02   2.24158595e-02   2.35759764e-02
   2.78004574e-02   1.41500504e-02   4.26354303e-03   1.61992210e-03
   2.99410567e-03   9.69242532e-04   1.60271452e-03   3.66001388e-04
   2.48093535e-04   5.07471256e-06   1.68486366e-05   1.11692524e-05
   8.78223449e-06   7.27231050e-06])
fallback 36919 to 'Expansion.Conjunction' ([  2.79163714e-06   7.93140129e-01   5.00955256e-02   2.39921236e-02
   2.39989315e-02   5.56917947e-02   6.55830898e-03   8.35707335e-03
   2.84754863e-02   4.75633666e-03   1.45757364e-03   4.86474785e-04
   1.45271656e-03   3.75830721e-04   8.46769911e-04   1.82140680e-04
   1.12950688e-04   1.05698805e-06   6.78447091e-06   4.06486251e-06
   2.44921107e-06   2.68575633e-06])
fallback 36222 to 'Expansion.Conjunction' ([  6.32340857e-07   9.85267305e-01   8.87810460e-03   2.17869324e-03
   3.08164403e-04   1.44055437e-04   1.97480787e-03   5.23865410e-04
   1.88168547e-05   3.95421530e-04   1.76867925e-04   1.20887683e-05
   7.47237227e-05   1.70508444e-06   3.99797182e-05   3.05112538e-06
   1.53852151e-06   1.76168258e-08   1.34639027e-07   9.41156864e-09
   3.33212199e-09   1.34328072e-08])
fallback 36112 to 'Expansion.Conjunction' ([  2.98251452e-05   4.22528599e-01   2.80823532e-01   6.37476600e-02
   4.79994459e-02   3.17537415e-02   6.85354627e-02   3.26751027e-02
   1.02082613e-02   2.40990764e-02   6.18446858e-03   3.15707180e-03
   3.83685929e-03   9.38432243e-04   2.74406656e-03   4.40104753e-04
   2.41858713e-04   1.18464160e-05   2.06187690e-05   7.06901672e-06
   1.01779379e-05   6.71923597e-06])
fallback 35923 to 'Expansion.Conjunction' ([  1.58201674e-05   7.55644081e-01   1.35881453e-01   3.15257049e-02
   1.00856404e-02   5.73987699e-03   3.66676188e-02   9.84553059e-03
   1.19723414e-03   7.00354016e-03   3.07852332e-03   6.31000321e-04
   1.31083768e-03   1.50560474e-04   1.00491766e-03   1.46958773e-04
   5.77748577e-05   2.43788326e-06   7.10757693e-06   1.04184835e-06
   1.02026854e-06   1.31862953e-06])
fallback 36212 to 'Expansion.Conjunction' ([  3.13123674e-05   5.57925593e-01   2.39293222e-01   4.94707981e-02
   2.10073911e-02   1.11255732e-02   7.60921031e-02   1.70320164e-02
   2.40226956e-03   1.32916172e-02   4.80445251e-03   1.37973463e-03
   3.13259784e-03   5.69264823e-04   1.87437100e-03   3.94813782e-04
   1.26122689e-04   9.00663343e-06   2.48913680e-05   2.90211829e-06
   3.97493848e-06   5.97201335e-06])
fallback 35791 to 'Expansion.Conjunction' ([  2.28914414e-05   3.21300180e-01   1.39957920e-01   8.00532925e-02
   1.05707124e-01   1.66875706e-01   2.36611404e-02   3.31193694e-02
   9.52441100e-02   1.41520789e-02   5.68592038e-03   2.27536052e-03
   4.66474939e-03   2.76782248e-03   3.08450941e-03   7.85724088e-04
   5.06679064e-04   1.28843495e-05   3.56008569e-05   3.37961757e-05
   2.92531787e-05   2.38867925e-05])
fallback 36080 to 'Expansion.Conjunction' ([  5.17575538e-09   9.97992108e-01   4.11571590e-04   1.03359017e-04
   2.58402145e-04   6.09944813e-04   2.69056839e-05   5.81894316e-05
   4.60051674e-04   3.51545681e-05   5.15966854e-06   7.93708588e-07
   2.51021140e-05   7.88765370e-07   1.11068567e-05   8.48929582e-07
   4.89854590e-07   3.60858180e-10   6.30259229e-09   7.94409879e-09
   1.16006639e-09   2.15284859e-09])
fallback 36502 to 'Expansion.Conjunction' ([  6.07071615e-06   7.28440540e-01   1.11579294e-01   4.01108311e-02
   2.56334474e-02   3.24346654e-02   1.56081425e-02   1.46340983e-02
   1.35601594e-02   1.04337318e-02   2.85293657e-03   1.03214874e-03
   1.91971699e-03   4.30210096e-04   9.55159914e-04   2.05987647e-04
   1.39781306e-04   2.23298076e-06   9.25982679e-06   4.96606583e-06
   3.52267770e-06   3.09691866e-06])
fallback 36362 to 'Expansion.Conjunction' ([  1.08961316e-07   9.91664964e-01   5.78670913e-03   7.78011526e-04
   2.42044062e-04   1.11733136e-04   6.58191287e-04   2.86202738e-04
   2.09877693e-05   3.30652087e-04   5.35524024e-05   3.87832058e-06
   4.84746424e-05   9.02941695e-07   1.16331605e-05   1.40840407e-06
   4.94440551e-07   4.30331423e-09   3.47900133e-08   5.05435081e-09
   1.30773395e-09   5.22498721e-09])
fallback 36651 to 'Expansion.Conjunction' ([  1.84736848e-06   8.21250881e-01   3.00072944e-02   1.48448939e-02
   2.03378076e-02   6.29201849e-02   3.78829741e-03   5.74856781e-03
   3.44477269e-02   2.87348786e-03   8.98513272e-04   2.94273932e-04
   1.20240046e-03   2.89851867e-04   8.32748567e-04   1.61065972e-04
   8.78567980e-05   6.06703300e-07   4.87860022e-06   3.12953590e-06
   1.70447930e-06   1.98033132e-06])
fallback 36213 to 'Expansion.Conjunction' ([  3.61828688e-06   9.46578448e-01   2.97628457e-02   7.86202126e-03
   1.59560319e-03   7.83029075e-04   8.40552342e-03   2.08608388e-03
   1.12052971e-04   1.46479999e-03   7.27154202e-04   7.37524392e-05
   3.15022220e-04   1.52515669e-05   1.83711397e-04   2.03395231e-05
   9.19706241e-06   1.95878245e-07   1.06319329e-06   9.48176014e-08
   4.89356221e-08   1.42683306e-07])
fallback 36611 to 'Expansion.Conjunction' ([  3.94915987e-05   4.20636959e-01   3.11336344e-01   6.41731780e-02
   2.99394043e-02   1.79361537e-02   9.33185385e-02   2.29717963e-02
   4.86247762e-03   1.78006052e-02   6.37618650e-03   2.60166898e-03
   3.37423972e-03   7.97709289e-04   3.00739525e-03   5.74974004e-04
   1.81822619e-04   1.52239439e-05   3.43592298e-05   4.83393305e-06
   8.49399309e-06   8.14410592e-06])
fallback 37106 to 'Expansion.Conjunction' ([  2.98902778e-05   2.59830503e-01   1.11948802e-01   6.44882391e-02
   1.18317380e-01   2.02104582e-01   2.11656986e-02   2.95437814e-02
   1.59366204e-01   1.20021905e-02   4.97594938e-03   2.33097629e-03
   4.96364987e-03   3.04180521e-03   4.14699965e-03   1.05553841e-03
   5.11223214e-04   1.52742376e-05   3.92542640e-05   4.95321616e-05
   4.30878787e-05   2.94387171e-05])
fallback 36194 to 'Expansion.Conjunction' ([  7.88888938e-05   3.16859071e-01   2.94108544e-01   9.77351977e-02
   4.39946471e-02   3.56105347e-02   1.18246393e-01   3.61154718e-02
   8.22866999e-03   2.11364574e-02   1.00077802e-02   4.49297350e-03
   5.58647335e-03   1.70886845e-03   4.49037977e-03   9.70796637e-04
   4.58730013e-04   3.49656953e-05   7.54403019e-05   1.36598012e-05
   2.38684446e-05   2.21887788e-05])
fallback 35802 to 'Expansion.Conjunction' ([  3.83639381e-05   2.10206808e-01   1.34880752e-01   7.91536427e-02
   1.31522359e-01   1.98049592e-01   2.66652556e-02   3.73442027e-02
   1.44025014e-01   1.34444117e-02   6.21160358e-03   2.73989888e-03
   5.53301400e-03   3.69424166e-03   4.55883428e-03   1.12565352e-03
   5.97589188e-04   2.09470947e-05   4.75921665e-05   5.53707546e-05
   5.13296149e-05   3.35236512e-05])
fallback 36464 to 'Expansion.Conjunction' ([  2.98209834e-05   4.27787607e-01   2.90351991e-01   6.20274775e-02
   4.03965381e-02   2.70901121e-02   7.54443640e-02   3.00458189e-02
   8.04822343e-03   2.20941569e-02   6.08413348e-03   2.88250906e-03
   3.56330424e-03   7.75297590e-04   2.67923184e-03   4.39245405e-04
   2.08296321e-04   1.19972266e-05   1.94954430e-05   5.74614667e-06
   8.80459004e-06   5.82868650e-06])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175474.ba+   1652604K    833155K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175474     rnn-rando+          2                         00:02:57      0:0 

Job 16175474 ("rnn-random-vectors") completed on c16-31 at tor dec 15 13:11:51 CET 2016
