Starting job 16175455 ("rnn-cbow-googlenews") on c31-33 at tor dec 15 13:01:50 CET 2016
Python environment is set up
Copying files to /work/jobs/16175455.d...
We are now in conll16st-v34-focused-rnns
CONFIG:
INPUT_PATH: /work/jobs/16175455.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
EMBEDDING_PATH: /work/jobs/16175455.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt
MODEL_PATH: /work/jobs/16175455.d/models/rnn-cbow-googlenews/
OUTPUT_PATH: /usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll15st-en-03-29-16-blind-test/
CONFIG: --config={"words2vec_bin": null, "words_dim": 20.0, "filter_fn_name": "conn_gt_0", "focus_dim": 6.0, "random_per_sample": 24.0, "final_dropout": 0.01608656108471007, "epochs": 200, "words2vec_txt": "/work/jobs/16175455.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt", "focus_dropout_W": 0.4850461135349744, "rnn_dim": 50.0, "focus_dropout_U": 0.18210894621865603, "epochs_len": -1, "final_dim": 40.0, "epochs_patience": 10, "rnn_dropout_W": 0.16649459724958682, "words_dropout": 0.3543889040084549, "rnn_dropout_U": 0.4899141021546136}
=========================
Using Theano backend.
[2016-12-15 13:03] configuration (/work/jobs/16175455.d/models/rnn-cbow-googlenews/)
[2016-12-15 13:03]     config 'epochs': 200 (1000)
[2016-12-15 13:03]     config 'epochs_len': -1 (-1)
[2016-12-15 13:03]     config 'epochs_patience': 10 (20)
[2016-12-15 13:03]     config 'batch_size':  (64)
[2016-12-15 13:03]     config 'snapshot_size':  (2048)
[2016-12-15 13:03]     config 'random_per_sample': 24.0 (32)
[2016-12-15 13:03]     config 'words_dim': 20.0 (20)
[2016-12-15 13:03]     config 'focus_dim': 6.0 (4)
[2016-12-15 13:03]     config 'rnn_dim': 50.0 (20)
[2016-12-15 13:03]     config 'final_dim': 40.0 (100)
[2016-12-15 13:03]     config 'arg1_len':  (100)
[2016-12-15 13:03]     config 'arg2_len':  (100)
[2016-12-15 13:03]     config 'conn_len':  (10)
[2016-12-15 13:03]     config 'punc_len':  (2)
[2016-12-15 13:03]     config 'words_dropout': 0.354388904008 (0.1)
[2016-12-15 13:03]     config 'focus_dropout_W': 0.485046113535 (0.33)
[2016-12-15 13:03]     config 'focus_dropout_U': 0.182108946219 (0.66)
[2016-12-15 13:03]     config 'rnn_dropout_W': 0.16649459725 (0.33)
[2016-12-15 13:03]     config 'rnn_dropout_U': 0.489914102155 (0.33)
[2016-12-15 13:03]     config 'final_dropout': 0.0160865610847 (0.5)
[2016-12-15 13:03]     config 'filter_fn_name': conn_gt_0 (conn_eq_0)
[2016-12-15 13:03]     config 'words2vec_bin': None (None)
[2016-12-15 13:03]     config 'words2vec_txt': /work/jobs/16175455.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt (None)
[2016-12-15 13:03]   args.lang: en
[2016-12-15 13:03]   args.model_dir: /work/jobs/16175455.d/models/rnn-cbow-googlenews/
[2016-12-15 13:03]   args.dataset_dir: /work/jobs/16175455.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/
[2016-12-15 13:03]   args.output_dir: /usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll15st-en-03-29-16-blind-test/
[2016-12-15 13:03]   K._config: {u'image_dim_ordering': u'tf', u'backend': u'theano', u'floatx': u'float32', u'epsilon': 1e-07}
[2016-12-15 13:03]   os.getenv("THEANO_FLAGS"): None
[2016-12-15 13:03]   filter_types: None
[2016-12-15 13:03]   filter_senses: None
[2016-12-15 13:03]   filter_fn_name: conn_gt_0
[2016-12-15 13:03]   config: {u'words_dim': 20.0, u'random_per_sample': 24.0, u'focus_dim': 6.0, u'filter_fn_name': u'conn_gt_0', u'final_dropout': 0.01608656108471007, u'rnn_dropout_W': 0.16649459724958682, u'epochs': 200, u'epochs_len': -1, u'focus_dropout_W': 0.4850461135349744, u'words2vec_txt': u'/work/jobs/16175455.d/resources//word_embeddings/precompiled/cbow/GoogleNews-vectors-negative300.txt', u'words2vec_bin': None, u'final_dim': 40.0, u'rnn_dropout_U': 0.4899141021546136, u'focus_dropout_U': 0.18210894621865603, u'rnn_dim': 50.0, u'words_dropout': 0.3543889040084549, u'epochs_patience': 10}
[2016-12-15 13:03] load dataset for prediction (/work/jobs/16175455.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:03] lang: ?, doc_ids: 71, words: 34621, rel_ids: 625, relation tokens: 25754
[2016-12-15 13:03]   rel_senses2id: 22, words2id: 43918
[2016-12-15 13:03] build model
[2016-12-15 13:04]     config 'rsenses_loss':  (categorical_crossentropy)
[2016-12-15 13:04]     config 'optimizer':  (adam)
[2016-12-15 13:04] previous weights (/work/jobs/16175455.d/models/rnn-cbow-googlenews/)
[2016-12-15 13:04] convert from dataset (/work/jobs/16175455.d/resources/conll16st-en-zh-dev-train-test_LDC2016E50/conll15st-en-03-29-16-blind-test/)
[2016-12-15 13:04] make predictions
[2016-12-15 13:05] convert predictions (/usit/abel/u1/jimmycallin//outputs/rnn-cbow-googlenews-conll15st-en-03-29-16-blind-test/)
/work/jobs/16175455.d/conll16st-v34-focused-rnns/v34/data_utils.py:208: VisibleDeprecationWarning: using a boolean instead of an integer will result in an error in the future
  totals[y_sum == 0.] = y_np[y_sum == 0.]  # prevent NaN
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 100)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            878360      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 100, 6)      486         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 10, 6)       486         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 2, 6)        486         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 100, 6)      486         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 10, 20)      0           gru_15[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_21 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_22 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_23 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_24 (TimeDistributed(None, 2, 20)       0           gru_22[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 100, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 100, 20)     0           gru_8[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_21[0][0]         
____________________________________________________________________________________________________
merge_22 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_22[0][0]         
____________________________________________________________________________________________________
merge_23 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_23[0][0]         
____________________________________________________________________________________________________
merge_24 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_24[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 100, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 100, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 50)          10650       merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 50)          10650       merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 50)          10650       merge_10[0][0]                   
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 50)          10650       merge_11[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 50)          10650       merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 50)          10650       merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 50)          10650       merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 50)          10650       merge_15[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 50)          10650       merge_16[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 50)          10650       merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 50)          10650       merge_17[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 50)          10650       merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 50)          10650       merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 50)          10650       merge_20[0][0]                   
____________________________________________________________________________________________________
gru_25 (GRU)                       (None, 50)          10650       merge_21[0][0]                   
____________________________________________________________________________________________________
gru_26 (GRU)                       (None, 50)          10650       merge_22[0][0]                   
____________________________________________________________________________________________________
gru_27 (GRU)                       (None, 50)          10650       merge_23[0][0]                   
____________________________________________________________________________________________________
gru_28 (GRU)                       (None, 50)          10650       merge_24[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 50)          10650       merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 50)          10650       merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 50)          10650       merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 50)          10650       merge_5[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 50)          10650       merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 50)          10650       merge_7[0][0]                    
____________________________________________________________________________________________________
merge_25 (Merge)                   (None, 1200)        0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
                                                                   gru_25[0][0]                     
                                                                   gru_26[0][0]                     
                                                                   gru_27[0][0]                     
                                                                   gru_28[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 40)          48040       merge_25[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 40)          160         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 40)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 22)          902         dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 22)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1185006
____________________________________________________________________________________________________
fallback 740 to 'Expansion.Conjunction' ([  2.22222639e-06   5.63622940e-01   5.82562449e-02   4.23615380e-02
   1.07511794e-01   6.61231414e-02   1.41463621e-02   4.41822959e-02
   7.98597394e-02   8.42945819e-03   1.65512945e-03   1.70313191e-03
   2.75928964e-03   4.92891519e-03   1.59808548e-03   2.38095964e-03
   2.71193154e-04   6.13896833e-05   2.66239653e-05   2.00526534e-05
   6.63388405e-05   3.31547919e-05])
fallback 1066 to 'Expansion.Conjunction' ([  3.51941139e-06   2.07521899e-01   1.05929813e-01   7.84623988e-02
   1.82868002e-01   1.28288819e-01   3.23714984e-02   7.40559467e-02
   1.43755315e-01   1.51285360e-02   3.50150277e-03   3.23729866e-03
   5.08603868e-03   1.11214713e-02   3.76347379e-03   4.09857599e-03
   5.42042889e-04   9.53862100e-05   3.20958567e-05   2.94615454e-05
   6.40491338e-05   4.28548916e-05])
fallback 241 to 'Expansion.Conjunction' ([  1.33513106e-06   7.10692811e-01   4.22671579e-02   2.95364945e-02
   7.29882109e-02   4.03408737e-02   8.82408101e-03   3.02441339e-02
   4.86703693e-02   6.43488102e-03   1.04621051e-03   1.22154397e-03
   1.92494920e-03   3.00388196e-03   8.74321719e-04   1.63954389e-03
   1.39851572e-04   4.14998278e-05   1.87815128e-05   1.24954811e-05
   5.19559790e-05   2.46159412e-05])
fallback 715 to 'Expansion.Conjunction' ([  1.05361494e-06   2.82136739e-01   2.04364553e-01   1.14218913e-01
   1.24679618e-01   6.73126579e-02   3.68276798e-02   6.70724884e-02
   5.23886458e-02   2.82599218e-02   2.94721010e-03   3.67893698e-03
   5.36227692e-03   3.42139835e-03   4.01465455e-03   3.08260206e-03
   1.61062868e-04   2.48717061e-05   6.39422661e-06   9.89782985e-06
   1.36652070e-05   1.47591618e-05])
fallback 593 to 'Expansion.Conjunction' ([  8.79760307e-07   7.24608977e-01   1.26979354e-01   9.12535737e-02
   1.07631276e-02   9.37031049e-03   5.42317439e-03   1.65575077e-02
   1.33253673e-03   1.00189618e-02   9.23556708e-04   3.30580000e-04
   1.15703317e-03   1.33310565e-04   6.15750107e-04   4.47057520e-04
   7.17829190e-05   9.70929640e-06   3.01926243e-07   1.31664607e-06
   7.50584454e-07   4.46459053e-07])
fallback 1024 to 'Expansion.Conjunction' ([  2.80492895e-06   2.78920028e-01   1.14839957e-01   8.03984263e-02
   1.61331581e-01   1.00037591e-01   3.06387100e-02   7.44039052e-02
   1.12031074e-01   1.82684476e-02   3.22275379e-03   3.47494687e-03
   5.29112672e-03   8.72709611e-03   3.63647569e-03   4.13512862e-03
   4.04265859e-04   7.45351580e-05   2.96910751e-05   2.71192205e-05
   5.99582897e-05   4.43784743e-05])
fallback 590 to 'Expansion.Conjunction' ([  1.38525274e-06   3.67410987e-01   2.90203630e-01   2.02311128e-01
   2.40001194e-02   2.32269503e-02   1.77936870e-02   3.94806079e-02
   3.69914970e-03   2.20357347e-02   2.57197162e-03   1.08090555e-03
   2.81196320e-03   4.45942889e-04   1.60739582e-03   1.16104551e-03
   1.34853937e-04   1.67070047e-05   6.04722685e-07   2.83849931e-06
   1.23937570e-06   1.15198418e-06])
fallback 404 to 'Expansion.Conjunction' ([  1.83576469e-06   7.78772839e-01   1.02395729e-01   7.88946830e-02
   6.71950734e-03   5.62863989e-03   4.53999131e-03   1.13031176e-02
   5.45391178e-04   8.22818753e-03   9.23940630e-04   2.17418189e-04
   9.16061350e-04   7.67275350e-05   4.16572792e-04   3.29724662e-04
   7.50734842e-05   1.19821344e-05   2.70403493e-07   1.26823626e-06
   6.88822872e-07   3.50056585e-07])
fallback 565 to 'Expansion.Conjunction' ([  3.69286425e-07   8.81643896e-01   2.71968508e-02   1.58984010e-02
   3.06361375e-02   1.27951103e-02   3.36001024e-03   1.01973499e-02
   1.19318488e-02   3.13351678e-03   3.76898565e-04   3.98424544e-04
   7.26344126e-04   7.38081468e-04   2.78348454e-04   6.21256131e-04
   3.33346508e-05   1.17612709e-05   3.11637611e-06   3.08199676e-06
   1.06249582e-05   5.23650763e-06])
fallback 308 to 'Expansion.Conjunction' ([  3.27641025e-08   9.97721596e-01   9.39492412e-04   1.13278276e-03
   2.62231966e-05   2.11828734e-05   2.98108566e-05   8.55887106e-05
   2.03000195e-07   3.29863137e-05   5.28497222e-06   3.94599476e-07
   1.72360703e-06   2.65972253e-08   2.54850075e-07   2.03551641e-06
   3.48879377e-07   2.73198810e-08   7.95384079e-10   2.02710578e-09
   1.40850773e-09   1.16821217e-10])
fallback 137 to 'Expansion.Conjunction' ([  3.65847130e-09   9.99755376e-01   8.94230101e-05   1.42042379e-04
   1.71657995e-06   1.20151991e-06   1.95281653e-06   5.80099455e-06
   4.61265467e-09   1.85309965e-06   3.73222631e-07   1.33555361e-08
   9.00692350e-08   5.77987043e-10   6.14979219e-09   1.15310427e-07
   2.50060735e-08   1.37820310e-09   3.93163902e-11   9.20154502e-11
   8.34134908e-11   2.49857642e-12])
fallback 354 to 'Expansion.Conjunction' ([  1.18126633e-10   9.99989111e-01   3.60420092e-06   6.45840567e-06
   2.37022182e-07   1.41467370e-07   2.89770044e-08   2.93031638e-07
   1.63815098e-09   9.28621748e-08   1.07945521e-08   3.09763054e-10
   8.86152235e-09   8.74088596e-11   3.66986531e-10   6.64566325e-09
   3.83488271e-09   3.70359000e-10   2.78510250e-12   6.20620884e-12
   3.62947526e-11   4.97247489e-13])
fallback 311 to 'Expansion.Conjunction' ([  3.42397916e-10   9.99961941e-01   1.28017922e-05   2.37651573e-05
   2.36838609e-07   1.59111058e-07   2.68013942e-07   6.38745082e-07
   2.42987332e-10   1.38266945e-07   3.21768115e-08   9.57677631e-10
   5.05933132e-09   2.56224996e-11   2.86233156e-10   9.84776288e-09
   2.14477375e-09   6.65947177e-11   1.91288527e-12   4.27230659e-12
   4.90767857e-12   9.89380521e-14])
fallback 553 to 'Expansion.Conjunction' ([  4.30336566e-09   9.97384599e-01   3.22857491e-04   1.90753881e-04
   1.16961728e-03   3.91845792e-04   3.03858612e-05   1.76535801e-04
   2.87345492e-04   1.45023604e-05   3.66128480e-06   2.10487427e-06
   6.00599873e-06   1.11280241e-05   5.82812044e-07   7.07988687e-06
   2.68717938e-07   4.06761668e-07   3.91129508e-08   2.42866134e-08
   1.81326725e-07   6.94602272e-08])
fallback 1196 to 'Expansion.Conjunction' ([  2.45407045e-06   2.05580891e-01   1.29552350e-01   8.98779338e-02
   1.74354346e-01   1.12849348e-01   3.64391471e-02   8.16878458e-02
   1.17905759e-01   2.00477151e-02   3.71929191e-03   3.80005341e-03
   5.68417743e-03   9.51887394e-03   4.07623921e-03   4.31262332e-03
   3.91973505e-04   6.56210909e-05   2.37075693e-05   2.37254136e-05
   4.46357156e-05   4.12871525e-05])
fallback 334 to 'Expansion.Conjunction' ([  1.39907561e-08   9.99119549e-01   3.56723536e-04   4.51283193e-04
   1.08671787e-05   7.79018978e-06   6.31204575e-06   2.97988690e-05
   1.21170292e-07   1.34820161e-05   1.76407780e-06   9.51437641e-08
   1.07184443e-06   1.16108744e-08   9.90463846e-08   7.74506497e-07
   2.18064108e-07   2.19247400e-08   3.45971872e-10   1.01747880e-09
   1.09931156e-09   5.09076719e-11])
fallback 920 to 'Expansion.Conjunction' ([  2.79391377e-09   9.99856176e-01   5.47567689e-05   8.13533408e-05
   1.00015075e-06   6.05198922e-07   7.34373431e-07   3.60896321e-06
   4.22762048e-09   1.33867866e-06   2.04208917e-07   6.45138166e-09
   9.90640319e-08   3.91166794e-10   4.93669195e-09   7.75310058e-08
   2.49392383e-08   1.66370151e-09   3.35590445e-11   1.03672217e-10
   1.00215940e-10   1.81439402e-12])
fallback 10 to 'Expansion.Conjunction' ([  6.98969359e-07   8.01185292e-01   3.47945645e-02   2.25350591e-02
   5.20611431e-02   2.50443513e-02   5.92746479e-03   1.95100098e-02
   2.81372716e-02   4.75817443e-03   6.76135110e-04   7.47808355e-04
   1.21768701e-03   1.66249050e-03   5.05903492e-04   1.08900827e-03
   7.10059233e-05   2.23263664e-05   8.52973043e-06   6.55849575e-06
   2.59082293e-05   1.26088541e-05])
fallback 696 to 'Expansion.Conjunction' ([  3.88637943e-07   9.56441175e-01   1.98368935e-02   1.75465739e-02
   9.94418992e-04   8.03614510e-04   5.61244792e-04   2.06960531e-03
   4.81708636e-05   1.31545962e-03   1.23081017e-04   2.28807988e-05
   1.19287384e-04   4.99028471e-06   4.19089670e-05   5.50760567e-05
   1.33267796e-05   1.61854361e-06   3.28715938e-08   1.33036296e-07
   9.59613556e-08   2.28124793e-08])
fallback 795 to 'Expansion.Conjunction' ([  6.34687922e-07   6.84958241e-01   1.23197634e-01   7.56537714e-02
   3.09915310e-02   1.93098175e-02   9.20263613e-03   2.79840277e-02
   7.83102704e-03   1.41439517e-02   1.04283661e-03   9.28683759e-04
   1.94729184e-03   5.01987889e-04   1.32617521e-03   8.80943114e-04
   7.87811538e-05   8.79435292e-06   1.62213035e-06   3.68065696e-06
   3.47488423e-06   2.45692361e-06])
fallback 87 to 'Expansion.Conjunction' ([  1.06918378e-06   5.50785139e-01   1.23314876e-01   6.80013392e-02
   8.79087398e-02   4.29607269e-02   1.80634638e-02   4.12118036e-02
   3.73088094e-02   1.58490021e-02   1.66179151e-03   2.21506978e-03
   3.71577927e-03   2.32460356e-03   2.35651230e-03   2.11003964e-03
   1.37295097e-04   2.55207695e-05   6.93772309e-06   9.94021802e-06
   1.81925393e-05   1.33485650e-05])
fallback 707 to 'Expansion.Conjunction' ([  2.01788282e-07   9.82070869e-01   7.95942550e-03   7.76038557e-03
   2.87905745e-04   2.46726618e-04   2.57735899e-04   8.34578595e-04
   7.60091784e-06   4.50881375e-04   4.94538657e-05   6.18392373e-06
   3.14880783e-05   8.32253255e-07   8.48019595e-06   2.25857113e-05
   4.20556310e-06   3.96401705e-07   9.95523226e-09   3.06232375e-08
   1.85981116e-08   3.46720121e-09])
fallback 609 to 'Expansion.Conjunction' ([  3.00283375e-07   9.05759293e-01   2.12989305e-02   1.24636062e-02
   2.52455925e-02   1.03260094e-02   2.54685530e-03   7.99011920e-03
   9.51591059e-03   2.38061841e-03   2.90901901e-04   3.00324237e-04
   5.54816226e-04   5.84374834e-04   1.98725688e-04   4.89815264e-04
   2.54825323e-05   1.00868512e-05   2.52710543e-06   2.45261713e-06
   9.00092818e-06   4.25687366e-06])
fallback 467 to 'Expansion.Conjunction' ([  1.70416820e-06   3.93506350e-01   1.21854827e-01   7.64768127e-02
   1.32797331e-01   7.05293420e-02   2.55275258e-02   6.16575519e-02
   7.71506581e-02   1.85180940e-02   2.52734731e-03   2.98595569e-03
   4.54260830e-03   5.24811216e-03   2.97254209e-03   3.31618755e-03
   2.42442985e-04   4.33029529e-05   1.68791340e-05   1.79261079e-05
   3.77580547e-05   2.87408421e-05])
fallback 581 to 'Expansion.Conjunction' ([  1.57820352e-06   8.33323017e-01   7.67613589e-02   6.11342650e-02
   4.69680139e-03   3.80686933e-03   3.23831156e-03   8.39312390e-03
   3.22687271e-04   6.23006105e-03   6.82548690e-04   1.47282760e-04
   6.45218545e-04   4.64340273e-05   2.68083653e-04   2.36354278e-04
   5.54514782e-05   8.78118242e-06   1.95256522e-07   8.71798720e-07
   4.88729833e-07   2.16246154e-07])
fallback 922 to 'Expansion.Conjunction' ([  2.69101088e-06   3.30198740e-01   1.10331723e-01   7.59834585e-02
   1.50637823e-01   8.86225566e-02   2.72939023e-02   6.99807789e-02
   1.01551825e-01   1.80337357e-02   2.93070129e-03   3.35838744e-03
   5.15059483e-03   7.99713390e-03   3.36098118e-03   3.95377499e-03
   3.73553578e-04   7.10626057e-05   3.07063715e-05   2.71535086e-05
   6.34960826e-05   4.52197499e-05])
fallback 24 to 'Expansion.Conjunction' ([  7.64495134e-11   9.99682431e-01   1.89348940e-05   1.29601695e-05
   1.72407018e-04   6.64507100e-05   1.71170928e-06   1.32513761e-05
   3.02452956e-05   3.77999102e-07   1.63328338e-07   6.04852775e-08
   1.99252896e-07   4.54337967e-07   1.57595484e-08   2.93558146e-07
   1.73524751e-08   1.85107628e-08   5.42234538e-10   2.49855804e-10
   4.26279325e-09   1.61262216e-09])
fallback 694 to 'Expansion.Conjunction' ([  6.87779504e-07   8.10794412e-01   3.13994698e-02   2.06689611e-02
   5.02147413e-02   2.45695188e-02   5.50551665e-03   1.87873970e-02
   2.79969293e-02   4.33225882e-03   6.32668786e-04   7.07115511e-04
   1.14032859e-03   1.62081571e-03   4.61135932e-04   1.02155830e-03
   6.85319027e-05   2.25677831e-05   8.83309529e-06   6.48467447e-06
   2.72724573e-05   1.27951753e-05])
fallback 135 to 'Expansion.Conjunction' ([  1.45073329e-07   9.87038959e-01   5.77924161e-03   5.66263677e-03
   2.07410876e-04   1.73180158e-04   1.56933746e-04   5.81694120e-04
   5.56342859e-06   3.09255698e-04   3.22114753e-05   4.02753808e-06
   2.27926173e-05   5.47837936e-07   5.94885471e-06   1.58240544e-05
   3.28293273e-06   2.97016381e-07   7.11531492e-09   2.30758823e-08
   1.51144357e-08   2.33470796e-09])
fallback 602 to 'Expansion.Conjunction' ([  3.85303656e-06   6.57178977e-01   1.51507835e-01   1.20634291e-01
   1.09172069e-02   8.87672203e-03   1.01612738e-02   1.97473851e-02
   8.17684897e-04   1.45376255e-02   1.96525472e-03   4.84487230e-04
   1.56353654e-03   1.54457298e-04   7.24828663e-04   5.76103670e-04
   1.23125555e-04   2.01182186e-05   6.36607333e-07   2.57150933e-06
   1.22294189e-06   8.02486258e-07])
fallback 840 to 'Expansion.Conjunction' ([  2.62927279e-06   5.98783480e-01   1.81791212e-01   1.39676911e-01
   1.27698050e-02   1.12616566e-02   1.07049549e-02   2.25264891e-02
   1.18009976e-03   1.52507673e-02   1.93682774e-03   5.26552368e-04
   1.74753702e-03   1.84664790e-04   8.52334702e-04   6.58494988e-04
   1.22829090e-04   1.80729945e-05   5.14646434e-07   2.30651626e-06
   1.10419066e-06   7.55917467e-07])
fallback 119 to 'Expansion.Conjunction' ([  1.03991465e-06   4.23223526e-01   2.66134322e-01   1.79756254e-01
   2.34387424e-02   2.16908027e-02   1.50311683e-02   3.74098160e-02
   3.73991183e-03   2.09209211e-02   2.13613641e-03   9.92615708e-04
   2.51503429e-03   4.12721275e-04   1.41555071e-03   1.05237065e-03
   1.09956760e-04   1.41203364e-05   5.43707586e-07   2.40870713e-06
   1.07566984e-06   9.61929801e-07])

Currently Loaded Modulefiles:
  1) intel/2017.0

Job script resource usage:
       JobID  MaxVMSize     MaxRSS 
------------ ---------- ---------- 
16175455.ba+   1639236K    825824K 

Job step resource usage:
       JobID    JobName  AllocCPUS  MaxVMSize     MaxRSS    Elapsed ExitCode 
------------ ---------- ---------- ---------- ---------- ---------- -------- 
16175455     rnn-cbow-+          2                         00:04:00      0:0 

Job 16175455 ("rnn-cbow-googlenews") completed on c31-33 at tor dec 15 13:05:46 CET 2016
